[
    {
        "date": "2014-12-30",
        "title": "Detecting Malicious Code by Exploiting Dependencies of System-call Groups",
        "author": "Stavros D. Nikolopoulos, and Iosif Polenakis",
        "link": "http://arxiv.org/abs/1412.8712v1",
        "abstract": "In this paper we present an elaborated graph-based algorithmic technique for\nefficient malware detection. More precisely, we utilize the system-call\ndependency graphs (or, for short ScD graphs), obtained by capturing taint\nanalysis traces and a set of various similarity metrics in order to detect\nwhether an unknown test sample is a malicious or a benign one. For the sake of\ngeneralization, we decide to empower our model against strong mutations by\napplying our detection technique on a weighted directed graph resulting from\nScD graph after grouping disjoint subsets of its vertices. Additionally, we\nhave developed a similarity metric, which we call NP-similarity, that combines\nqualitative, quantitative, and relational characteristics that are spread among\nthe members of known malware families to archives a clear distinction between\ngraph-representations of malware and the ones of benign software. Finally, we\nevaluate our detection model and compare our results against the results\nachieved by a variety of techniques proving the potentials of our model."
    },
    {
        "date": "2014-12-30",
        "title": "Percolation Model of Insider Threats to Assess the Optimum Number of Rules",
        "author": "Jeremy Kepner, Vijay Gadepally, and Pete Michaleas",
        "link": "http://arxiv.org/abs/1412.8699v1",
        "abstract": "Rules, regulations, and policies are the basis of civilized society and are\nused to coordinate the activities of individuals who have a variety of goals\nand purposes. History has taught that over-regulation (too many rules) makes it\ndifficult to compete and under-regulation (too few rules) can lead to crisis.\nThis implies an optimal number of rules that avoids these two extremes. Rules\ncreate boundaries that define the latitude an individual has to perform their\nactivities. This paper creates a Toy Model of a work environment and examines\nit with respect to the latitude provided to a normal individual and the\nlatitude provided to an insider threat. Simulations with the Toy Model\nillustrate four regimes with respect to an insider threat: under-regulated,\npossibly optimal, tipping-point, and over-regulated. These regimes depend up\nthe number of rules (N) and the minimum latitude (Lmin) required by a normal\nindividual to carry out their activities. The Toy Model is then mapped onto the\nstandard 1D Percolation Model from theoretical physics and the same behavior is\nobserved. This allows the Toy Model to be generalized to a wide array of more\ncomplex models that have been well studied by the theoretical physics community\nand also show the same behavior. Finally, by estimating N and Lmin it should be\npossible to determine the regime of any particular environment."
    },
    {
        "date": "2014-12-29",
        "title": "Bloom Filters in Adversarial Environments",
        "author": "Moni Naor, and Eylon Yogev",
        "link": "http://arxiv.org/abs/1412.8356v5",
        "abstract": "Many efficient data structures use randomness, allowing them to improve upon\ndeterministic ones. Usually, their efficiency and correctness are analyzed\nusing probabilistic tools under the assumption that the inputs and queries are\nindependent of the internal randomness of the data structure. In this work, we\nconsider data structures in a more robust model, which we call the adversarial\nmodel. Roughly speaking, this model allows an adversary to choose inputs and\nqueries adaptively according to previous responses. Specifically, we consider a\ndata structure known as \"Bloom filter\" and prove a tight connection between\nBloom filters in this model and cryptography.\n  A Bloom filter represents a set $S$ of elements approximately, by using fewer\nbits than a precise representation. The price for succinctness is allowing some\nerrors: for any $x \\in S$ it should always answer `Yes', and for any $x \\notin\nS$ it should answer `Yes' only with small probability.\n  In the adversarial model, we consider both efficient adversaries (that run in\npolynomial time) and computationally unbounded adversaries that are only\nbounded in the number of queries they can make. For computationally bounded\nadversaries, we show that non-trivial (memory-wise) Bloom filters exist if and\nonly if one-way functions exist. For unbounded adversaries we show that there\nexists a Bloom filter for sets of size $n$ and error $\\varepsilon$, that is\nsecure against $t$ queries and uses only $O(n \\log{\\frac{1}{\\varepsilon}}+t)$\nbits of memory. In comparison, $n\\log{\\frac{1}{\\varepsilon}}$ is the best\npossible under a non-adaptive adversary."
    },
    {
        "date": "2014-12-27",
        "title": "Attacks exploiting deviation of mean photon number in quantum key distribution and coin tossing",
        "author": "Shihan Sajeed, Igor Radchenko, Sarah Kaiser, Jean-Philippe Bourgoin, Anna Pappa, Laurent Monat, Matthieu Legre, and Vadim Makarov",
        "link": "http://arxiv.org/abs/1412.8032v2",
        "abstract": "The security of quantum communication using a weak coherent source requires\nan accurate knowledge of the source's mean photon number. Finite calibration\nprecision or an active manipulation by an attacker may cause the actual emitted\nphoton number to deviate from the known value. We model effects of this\ndeviation on the security of three quantum communication protocols: the\nBennett-Brassard 1984 (BB84) quantum key distribution (QKD) protocol without\ndecoy states, Scarani-Acin-Ribordy-Gisin 2004 (SARG04) QKD protocol, and a\ncoin-tossing protocol. For QKD, we model both a strong attack using technology\npossible in principle, and a realistic attack bounded by today's technology. To\nmaintain the mean photon number in two-way systems, such as plug-and-play and\nrelativistic quantum cryptography schemes, bright pulse energy incoming from\nthe communication channel must be monitored. Implementation of a monitoring\ndetector has largely been ignored so far, except for ID Quantique's commercial\nQKD system Clavis2. We scrutinize this implementation for security problems,\nand show that designing a hack-proof pulse-energy-measuring detector is far\nfrom trivial. Indeed the first implementation has three serious flaws confirmed\nexperimentally, each of which may be exploited in a cleverly constructed\nTrojan-horse attack. We discuss requirements for a loophole-free implementation\nof the monitoring detector."
    },
    {
        "date": "2014-12-24",
        "title": "Balancing Isolation and Sharing of Data for Third-Party Extensible App Ecosystems",
        "author": "Florian Schröder, Raphael M. Reischuk, and Johannes Gehrke",
        "link": "http://arxiv.org/abs/1412.7641v2",
        "abstract": "In the landscape of application ecosystems, today's cloud users wish to\npersonalize not only their browsers with various extensions or their\nsmartphones with various applications, but also the various extensions and\napplications themselves. The resulting personalization significantly raises the\nattractiveness for typical Web 2.0 users, but gives rise to various security\nrisks and privacy concerns, such as unforeseen access to certain critical\ncomponents, undesired information flow of personal information to untrusted\napplications, or emerging attack surfaces that were not possible before a\npersonalization has taken place.\n  In this paper, we propose a novel extensibility mechanism which is used for\nimplementing personalization of existing cloud applications towards (possibly\nuntrusted) components in a secure and privacy-friendly manner. Our model\nprovides a clean component abstraction, thereby in particular ruling out\nundesired component accesses and ensuring that no undesired information flow\ntakes place between application components -- either trusted from the base\napplication or untrusted from various extensions. We then instantiate our model\nin the SAFE web application framework (WWW 2012), resulting in a novel\nmethodology that is inspired by traditional access control and specifically\ndesigned for the newly emerging needs of extensibility in application\necosystems. We illustrate the convenient usage of our techniques by showing how\nto securely extend an existing social network application."
    },
    {
        "date": "2014-12-24",
        "title": "Differential Privacy and Machine Learning: a Survey and Review",
        "author": "Zhanglong Ji, Zachary C. Lipton, and Charles Elkan",
        "link": "http://arxiv.org/abs/1412.7584v1",
        "abstract": "The objective of machine learning is to extract useful information from data,\nwhile privacy is preserved by concealing information. Thus it seems hard to\nreconcile these competing interests. However, they frequently must be balanced\nwhen mining sensitive data. For example, medical research represents an\nimportant application where it is necessary both to extract useful information\nand protect patient privacy. One way to resolve the conflict is to extract\ngeneral characteristics of whole populations without disclosing the private\ninformation of individuals.\n  In this paper, we consider differential privacy, one of the most popular and\npowerful definitions of privacy. We explore the interplay between machine\nlearning and differential privacy, namely privacy-preserving machine learning\nalgorithms and learning-based data release mechanisms. We also describe some\ntheoretical results that address what can be learned differentially privately\nand upper bounds of loss functions for differentially private algorithms.\n  Finally, we present some open questions, including how to incorporate public\ndata, how to deal with missing data in private datasets, and whether, as the\nnumber of observed samples grows arbitrarily large, differentially private\nmachine learning algorithms can be achieved at no cost to utility as compared\nto corresponding non-differentially private algorithms."
    },
    {
        "date": "2014-12-23",
        "title": "Systemization of Pluggable Transports for Censorship Resistance",
        "author": "Sheharbano Khattak, Laurent Simon, and Steven J. Murdoch",
        "link": "http://arxiv.org/abs/1412.7448v2",
        "abstract": "An increasing number of countries implement Internet censorship at different\nscales and for a variety of reasons. In particular, the link between the\ncensored client and entry point to the uncensored network is a frequent target\nof censorship due to the ease with which a nation-state censor can control it.\nA number of censorship resistance systems have been developed thus far to help\ncircumvent blocking on this link, which we refer to as link circumvention\nsystems (LCs). The variety and profusion of attack vectors available to a\ncensor has led to an arms race, leading to a dramatic speed of evolution of\nLCs. Despite their inherent complexity and the breadth of work in this area,\nthere is no systematic way to evaluate link circumvention systems and compare\nthem against each other. In this paper, we (i) sketch an attack model to\ncomprehensively explore a censor's capabilities, (ii) present an abstract model\nof a LC, a system that helps a censored client communicate with a server over\nthe Internet while resisting censorship, (iii) describe an evaluation stack\nthat underscores a layered approach to evaluate LCs, and (iv) systemize and\nevaluate existing censorship resistance systems that provide link\ncircumvention. We highlight open challenges in the evaluation and development\nof LCs and discuss possible mitigations."
    },
    {
        "date": "2014-12-18",
        "title": "Crypto-Nets: Neural Networks over Encrypted Data",
        "author": "Pengtao Xie, Misha Bilenko, Tom Finley, Ran Gilad-Bachrach, Kristin Lauter, and Michael Naehrig",
        "link": "http://arxiv.org/abs/1412.6181v2",
        "abstract": "The problem we address is the following: how can a user employ a predictive\nmodel that is held by a third party, without compromising private information.\nFor example, a hospital may wish to use a cloud service to predict the\nreadmission risk of a patient. However, due to regulations, the patient's\nmedical files cannot be revealed. The goal is to make an inference using the\nmodel, without jeopardizing the accuracy of the prediction or the privacy of\nthe data.\n  To achieve high accuracy, we use neural networks, which have been shown to\noutperform other learning models for many tasks. To achieve the privacy\nrequirements, we use homomorphic encryption in the following protocol: the data\nowner encrypts the data and sends the ciphertexts to the third party to obtain\na prediction from a trained model. The model operates on these ciphertexts and\nsends back the encrypted prediction. In this protocol, not only the data\nremains private, even the values predicted are available only to the data\nowner.\n  Using homomorphic encryption and modifications to the activation functions\nand training algorithms of neural networks, we show that it is protocol is\npossible and may be feasible. This method paves the way to build a secure\ncloud-based neural network prediction services without invading users' privacy."
    },
    {
        "date": "2014-12-16",
        "title": "The Abandoned Side of the Internet: Hijacking Internet Resources When Domain Names Expire",
        "author": "Johann Schlamp, Josef Gustafsson, Matthias Wählisch, Thomas C. Schmidt, and Georg Carle",
        "link": "http://arxiv.org/abs/1412.5052v2",
        "abstract": "The vulnerability of the Internet has been demonstrated by prominent IP\nprefix hijacking events. Major outages such as the China Telecom incident in\n2010 stimulate speculations about malicious intentions behind such anomalies.\nSurprisingly, almost all discussions in the current literature assume that\nhijacking incidents are enabled by the lack of security mechanisms in the\ninter-domain routing protocol BGP. In this paper, we discuss an attacker model\nthat accounts for the hijacking of network ownership information stored in\nRegional Internet Registry (RIR) databases. We show that such threats emerge\nfrom abandoned Internet resources (e.g., IP address blocks, AS numbers). When\nDNS names expire, attackers gain the opportunity to take resource ownership by\nre-registering domain names that are referenced by corresponding RIR database\nobjects. We argue that this kind of attack is more attractive than conventional\nhijacking, since the attacker can act in full anonymity on behalf of a victim.\nDespite corresponding incidents have been observed in the past, current\ndetection techniques are not qualified to deal with these attacks. We show that\nthey are feasible with very little effort, and analyze the risk potential of\nabandoned Internet resources for the European service region: our findings\nreveal that currently 73 /24 IP prefixes and 7 ASes are vulnerable to be\nstealthily abused. We discuss countermeasures and outline research directions\ntowards preventive solutions."
    },
    {
        "date": "2014-12-14",
        "title": "Privacy-Preserving and Outsourced Multi-User k-Means Clustering",
        "author": "Bharath K. Samanthula, Fang-Yu Rao, Elisa Bertino, Xun Yi, and Dongxi Liu",
        "link": "http://arxiv.org/abs/1412.4378v1",
        "abstract": "Many techniques for privacy-preserving data mining (PPDM) have been\ninvestigated over the past decade. Often, the entities involved in the data\nmining process are end-users or organizations with limited computing and\nstorage resources. As a result, such entities may want to refrain from\nparticipating in the PPDM process. To overcome this issue and to take many\nother benefits of cloud computing, outsourcing PPDM tasks to the cloud\nenvironment has recently gained special attention. We consider the scenario\nwhere n entities outsource their databases (in encrypted format) to the cloud\nand ask the cloud to perform the clustering task on their combined data in a\nprivacy-preserving manner. We term such a process as privacy-preserving and\noutsourced distributed clustering (PPODC). In this paper, we propose a novel\nand efficient solution to the PPODC problem based on k-means clustering\nalgorithm. The main novelty of our solution lies in avoiding the secure\ndivision operations required in computing cluster centers altogether through an\nefficient transformation technique. Our solution builds the clusters securely\nin an iterative fashion and returns the final cluster centers to all entities\nwhen a pre-determined termination condition holds. The proposed solution\nprotects data confidentiality of all the participating entities under the\nstandard semi-honest model. To the best of our knowledge, ours is the first\nwork to discuss and propose a comprehensive solution to the PPODC problem that\nincurs negligible cost on the participating entities. We theoretically estimate\nboth the computation and communication costs of the proposed protocol and also\ndemonstrate its practical value through experiments on a real dataset."
    },
    {
        "date": "2014-12-11",
        "title": "Exploiting n-gram location for intrusion detection",
        "author": "Fabrizio Angiulli, Luciano Argento, and Angelo Furfaro",
        "link": "http://arxiv.org/abs/1412.3664v3",
        "abstract": "Signature-based and protocol-based intrusion detection systems (IDS) are\nemployed as means to reveal content-based network attacks. Such systems have\nproven to be effective in identifying known intrusion attempts and exploits but\nthey fail to recognize new types of attacks or carefully crafted variants of\nwell known ones. This paper presents the design and the development of an\nanomaly-based IDS technique which is able to detect content-based attacks\ncarried out over application level protocols, like HTTP and FTP. In order to\nidentify anomalous packets, the payload is split up in chunks of equal length\nand the n-gram technique is used to learn which byte sequences usually appear\nin each chunk. The devised technique builds a different model for each pair\n<protocol of interest, packet length> and uses them to classify the incoming\ntraffic. Models are build by means of a semi-supervised approach. Experimental\nresults witness that the technique achieves an excellent accuracy with a very\nlow false positive rate."
    },
    {
        "date": "2014-12-09",
        "title": "Distributed Protocols and Heterogeneous Trust: Technical Report",
        "author": "Isaac C. Sheff, Robbert van Renesse, and Andrew C. Myers",
        "link": "http://arxiv.org/abs/1412.3136v1",
        "abstract": "The robustness of distributed systems is usually phrased in terms of the\nnumber of failures of certain types that they can withstand. However, these\nfailure models are too crude to describe the different kinds of trust and\nexpectations of participants in the modern world of complex, integrated systems\nextending across different owners, networks, and administrative domains. Modern\nsystems often exist in an environment of heterogeneous trust, in which\ndifferent participants may have different opinions about the trustworthiness of\nother nodes, and a single participant may consider other nodes to differ in\ntheir trustworthiness. We explore how to construct distributed protocols that\nmeet the requirements of all participants, even in heterogeneous trust\nenvironments. The key to our approach is using lattice-based information flow\nto analyse and prove protocol properties. To demonstrate this approach, we show\nhow two earlier distributed algorithms can be generalized to work in the\npresence of heterogeneous trust: first, Heterogeneous Fast Consensus, an\nadaptation of the earlier Bosco Fast Consensus protocol; and second, Nysiad, an\nalgorithm for converting crash-tolerant protocols to be Byzantine-tolerant.\nThrough simulations, we show that customizing a protocol to a heterogeneous\ntrust configuration yields performance improvements over the conventional\nprotocol designed for homogeneous trust."
    },
    {
        "date": "2014-12-09",
        "title": "The Impact of Stealthy Attacks on Smart Grid Performance: Tradeoffs and Implications",
        "author": "Yara Abdallah, Zizhan Zheng, Ness B. Shroff, Hesham El Gamal, and Tarek M. El-Fouly",
        "link": "http://arxiv.org/abs/1502.06004v2",
        "abstract": "The smart grid is envisioned to significantly enhance the efficiency of\nenergy consumption, by utilizing two-way communication channels between\nconsumers and operators. For example, operators can opportunistically leverage\nthe delay tolerance of energy demands in order to balance the energy load over\ntime, and hence, reduce the total operational cost. This opportunity, however,\ncomes with security threats, as the grid becomes more vulnerable to\ncyber-attacks. In this paper, we study the impact of such malicious\ncyber-attacks on the energy efficiency of the grid in a simplified setup. More\nprecisely, we consider a simple model where the energy demands of the smart\ngrid consumers are intercepted and altered by an active attacker before they\narrive at the operator, who is equipped with limited intrusion detection\ncapabilities. We formulate the resulting optimization problems faced by the\noperator and the attacker and propose several scheduling and attack strategies\nfor both parties. Interestingly, our results show that, as opposed to\nfacilitating cost reduction in the smart grid, increasing the delay tolerance\nof the energy demands potentially allows the attacker to force increased costs\non the system. This highlights the need for carefully constructed and robust\nintrusion detection mechanisms at the operator."
    },
    {
        "date": "2014-12-06",
        "title": "Protection de la vie privée à base d'agents dans un système d'e-learning",
        "author": "Marwa Bekrar",
        "link": "http://arxiv.org/abs/1412.2261v1",
        "abstract": "The e-learning systems are designed to provide an easy and constant access to\neducational resources online. Indeed, E-learning systems have capacity to adapt\ncontent and learning process according to the learner profile. Adaptation\ntechniques using advanced behavioral analysis mechanisms, called \"Learner\nModeling\" or \"Profiling\". The latter require continuous tracking of the\nactivities of the learner to identify gaps and strengths in order to tailor\ncontent to their specific needs or advise and accompany him during his\napprenticeship. However, the disadvantage of these systems is that they cause\nlearners' discouragement, for learners, alone with his screen loses its\nmotivation to improve. Adding social extension to learning, to avoid isolation\nof learners and boost support and interaction between members of the learning\ncommunity, was able to increase learner's motivation. However, the tools to\nfacilitate social interactions integrated to E-learning platforms can be used\nfor purposes other than learning. These needs, which can be educational,\nprofessional or personal, create a mixture of data from the private life and\npublic life of learners. With the integration of these tools for e-learning\nsystems and the growth of the amount of personal data stored in the databases\nof these latter, protecting the privacy of students becomes a major concern.\nIndeed, the exchange of profiles between e-learning systems is done without the\npermission of their owners. Furthermore, the profiling behavior analysis\ncurrently represents a very cost-effective way to generate profits by selling\nthese profiles advertising companies. Today, the right to privacy is threatened\nfrom all sides. In addition to the threat from pirates, the source of the most\ndangerous threats is that from service providers online that users devote a\nblind trust. Control and centralized data storage and access privileges that\nhave suppliers are responsible for the threat. Our work is limited to the\nprotection of personal data in e-learning systems. We try to answer the\nquestion: How can we design a system that protects the privacy of users against\nthreats from the provider while benefiting from all the services, including\nanalysis of behavior? In the absence of solutions that take into account the\nprotection and respect of privacy in e-learning systems that integrate social\nlearning tools, we designed our own solution. Our \"ApprAide\" system uses a set\nof protocols based on security techniques to protect users' privacy. In\naddition, our system incorporates tools that promote social interactions as a\nsocial learning network, a chat tool and a virtual table. Our solution allows\nthe use of adaptation techniques and profiling to assist learners. Keywords:\nSocial learning, privacy, security, e-learning, agents"
    },
    {
        "date": "2014-12-04",
        "title": "Censorship Resistance: Let a Thousand Flowers Bloom?",
        "author": "Tariq Elahi, Steven J. Murdoch, and Ian Goldberg",
        "link": "http://arxiv.org/abs/1412.1859v1",
        "abstract": "This paper argues that one of the most important decisions in designing and\ndeploying censorship resistance systems is whether one set of system options\nshould be selected (the best), or whether there should be several sets of good\nones. We model the problem of choosing these options as a cat-and-mouse game\nand show that the best strategy depends on the value the censor associates with\ntotal system censorship versus partial, and the tolerance of false positives.\nIf the censor has a low tolerance to false positives then choosing one\ncensorship resistance system is best. Otherwise choosing several systems is the\nbetter choice, but the way traffic should be distributed over the systems\ndepends on the tolerance of the censor to false negatives. We demonstrate that\nestablishing the censor's utility function is critical to discovering the best\nstrategy for censorship resistance."
    },
    {
        "date": "2014-12-04",
        "title": "Do not trust me: Using malicious IdPs for analyzing and attacking Single Sign-On",
        "author": "Christian Mainka, Vladislav Mladenov, and Jörg Schwenk",
        "link": "http://arxiv.org/abs/1412.1623v1",
        "abstract": "Single Sign-On (SSO) systems simplify login procedures by using an an\nIdentity Provider (IdP) to issue authentication tokens which can be consumed by\nService Providers (SPs). Traditionally, IdPs are modeled as trusted third\nparties. This is reasonable for SSO systems like Kerberos, MS Passport and\nSAML, where each SP explicitely specifies which IdP he trusts. However, in open\nsystems like OpenID and OpenID Connect, each user may set up his own IdP, and a\ndiscovery phase is added to the protocol flow. Thus it is easy for an attacker\nto set up its own IdP. In this paper we use a novel approach for analyzing SSO\nauthentication schemes by introducing a malicious IdP. With this approach we\nevaluate one of the most popular and widely deployed SSO protocols - OpenID. We\nfound four novel attack classes on OpenID, which were not covered by previous\nresearch, and show their applicability to real-life implementations. As a\nresult, we were able to compromise 11 out of 16 existing OpenID implementations\nlike Sourceforge, Drupal and ownCloud. We automated discovery of these attacks\nin a open source tool OpenID Attacker, which additionally allows fine-granular\ntesting of all parameters in OpenID implementations. Our research helps to\nbetter understand the message flow in the OpenID protocol, trust assumptions in\nthe different components of the system, and implementation issues in OpenID\ncomponents. It is applicable to other SSO systems like OpenID Connect and SAML.\nAll OpenID implementations have been informed about their vulnerabilities and\nwe supported them in fixing the issues."
    },
    {
        "date": "2014-12-03",
        "title": "Hashing Pursuit for Online Identification of Heavy-Hitters in High-Speed Network Streams",
        "author": "Michael Kallitsis, Stilian Stoev, and George Michailidis",
        "link": "http://arxiv.org/abs/1412.6148v1",
        "abstract": "Distributed Denial of Service (DDoS) attacks have become more prominent\nrecently, both in frequency of occurrence, as well as magnitude. Such attacks\nrender key Internet resources unavailable and disrupt its normal operation. It\nis therefore of paramount importance to quickly identify malicious Internet\nactivity. The DDoS threat model includes characteristics such as: (i)\nheavy-hitters that transmit large volumes of traffic towards \"victims\", (ii)\npersistent-hitters that send traffic, not necessarily large, to specific\ndestinations to be used as attack facilitators, (iii) host and port scanning\nfor compiling lists of un-secure servers to be used as attack amplifiers, etc.\nThis conglomeration of problems motivates the development of space/time\nefficient summaries of data traffic streams that can be used to identify\nheavy-hitters associated with the above attack vectors. This paper presents a\nhashing-based framework and fast algorithms that take into account the\nlarge-dimensionality of the incoming network stream and can be employed to\nquickly identify the culprits. The algorithms and data structures proposed\nprovide a synopsis of the network stream that is not taxing to fast-memory, and\ncan be efficiently implemented in hardware due to simple bit-wise operations.\nThe methods are evaluated using real-world Internet data from a large academic\nnetwork."
    },
    {
        "date": "2014-12-01",
        "title": "Countermeasures Against High-Order Fault-Injection Attacks on CRT-RSA",
        "author": "Pablo Rauzy, and Sylvain Guilley",
        "link": "http://arxiv.org/abs/1412.0600v1",
        "abstract": "In this paper we study the existing CRT-RSA countermeasures against\nfault-injection at-tacks. In an attempt to classify them we get to achieve deep\nunderstanding of how they work. We show that the many countermeasures that we\nstudy (and their variations) actually share a number of common features, but\noptimize them in different ways. We also show that there is no conceptual\ndistinction between test-based and infective countermeasures and how either one\ncan be transformed into the other. Furthermore, we show that faults on the code\n(skipping instructions) can be captured by considering only faults on the data.\nThese intermediate results allow us to improve the state of the art in several\nways: (a) we fix an existing and that was known to be broken countermeasure\n(namely the one from Shamir); (b) we drastically optimize an existing\ncountermeasure (namely the one from Vigilant) which we reduce to 3 tests\ninstead of 9 in its original version, and prove that it resists not only one\nfault but also an arbitrary number of randomizing faults; (c) we also show how\nto upgrade countermeasures to resist any given number of faults: given a\ncorrect first-order countermeasure, we present a way to design a prov-able\nhigh-order countermeasure (for a well-defined and reasonable fault model).\nFinally, we pave the way for a generic approach against fault attacks for any\nmodular arithmetic computations, and thus for the automatic insertion of\ncountermeasures."
    },
    {
        "date": "2014-11-26",
        "title": "Analyzing the BrowserID SSO System with Primary Identity Providers Using an Expressive Model of the Web",
        "author": "Daniel Fett, Ralf Kuesters, and Guido Schmitz",
        "link": "http://arxiv.org/abs/1411.7210v2",
        "abstract": "BrowserID is a complex, real-world Single Sign-On (SSO) System for web\napplications recently developed by Mozilla. It employs new HTML5 features (such\nas web messaging and web storage) and cryptographic assertions to provide\ndecentralized login, with the intent to respect users' privacy. It can operate\nin a primary and a secondary identity provider mode. While in the primary mode\nBrowserID runs with arbitrary identity providers (IdPs), in the secondary mode\nthere is one IdP only, namely Mozilla's default IdP.\n  We recently proposed an expressive general model for the web infrastructure\nand, based on this web model, analyzed the security of the secondary IdP mode\nof BrowserID. The analysis revealed several severe vulnerabilities.\n  In this paper, we complement our prior work by analyzing the even more\ncomplex primary IdP mode of BrowserID. We do not only study authentication\nproperties as before, but also privacy properties. During our analysis we\ndiscovered new and practical attacks that do not apply to the secondary mode:\nan identity injection attack, which violates a central authentication property\nof SSO systems, and attacks that break an important privacy promise of\nBrowserID and which do not seem to be fixable without a major redesign of the\nsystem. Some of our attacks on privacy make use of a browser side channel that\nhas not gained a lot of attention so far.\n  For the authentication bug, we propose a fix and formally prove in a slight\nextension of our general web model that the fixed system satisfies all the\nrequirements we consider. This constitutes the most complex formal analysis of\na web application based on an expressive model of the web infrastructure so\nfar.\n  As another contribution, we identify and prove important security properties\nof generic web features in the extended web model to facilitate future analysis\nefforts of web standards and web applications."
    },
    {
        "date": "2014-11-24",
        "title": "Warp2: A Method of Email and Messaging with Encrypted Addressing and Headers",
        "author": "H. Bjorgvinsdottir, and P. M. Bentley",
        "link": "http://arxiv.org/abs/1411.6409v1",
        "abstract": "Secure communications are playing increasing roles in society, particularly\nin finance, journalism, and military projects. Current methods of securing\ne-mail and similar messaging methods rely on encryption of the message body,\nbut the header with addressing information remains plaintext. This allows third\nparty eavesdroppers to collect and analyse the header metadata and construct a\nnetwork model of the participants in conversations (who, where, when, subject).\nIn this article, we describe a method of communication where the header is also\nencrypted, hindering the assembly of the communication network models, which is\nverified with a working prototype application. This provides a useful tool to\njournalists and proponents of free speech in oppressed countries, protecting\nboth the messages and their sources."
    },
    {
        "date": "2014-11-23",
        "title": "A Novel Model for Integration of Information Security Management against Replication Attack Based on Biological Structures of the Body",
        "author": "Amir Hosein Bodaghi",
        "link": "http://arxiv.org/abs/1504.03340v1",
        "abstract": "By developing communications and increase of access points, computer networks\nhave been vulnerable considerably against wide range of information attacks,\nspecially new and complicated attacks. Every day, replication attacks attack\nmillions of network and mobile users. Increase in amount of replication attack\nmay be a potential danger for income of SMS or network and causes losing\ncustomers of these services provider. Humans or software can be used to\nencounter these replication attacks. It is obvious that lonely absolute use of\neach method will not result in a proper answer to encounter replication\nattack`s problem. Since replication attack is one of the important problems of\ninformation protection and security in organizations for computer and mobile\nphone users, while reviewing types of replication attacks and methods of\nencountering, this paper uses similarities between pathologies in body and\ninvader factors in replication attacks, a model is provided based on biological\nsimulation methods existing in body`s adapted immune system to encounter these\nthreats."
    },
    {
        "date": "2014-11-23",
        "title": "A Pair-wise Key Distribution Mechanism and Distributed Trust Evaluation Model for Secure Data Aggregation in Mobile Sensor Networks",
        "author": "Natarajan Meghanathan",
        "link": "http://arxiv.org/abs/1411.6188v1",
        "abstract": "We propose a secure data aggregation (SDA) framework for mobile sensor\nnetworks whose topology changes dynamically with time. The SDA framework\n(designed to be resilient to both insider and outsider attacks) comprises of a\npair-wise key establishment mechanism run along the edges of a data gathering\ntree and a distributed trust evaluation model that is tightly integrated with\nthe data aggregation process itself. If an aggregator node already shares a\nsecret key with its child node, the two nodes locally coordinate to refresh and\nestablish a new pair-wise secret key; otherwise, the aggregator node requests\nthe sink to send a seed-secret key message that is used as the basis to\nestablish a new pair-wise secret key. The trust evaluation model uses the\ntwo-sided Grubbs test to identify outlier data in the periodic beacons\ncollected from the child nodes (neighbor) nodes. Once the estimated trust score\nfor a neighbor node falls below a threshold, the sensor node locally classifies\nits neighbor node as a Compromised or Faulty (CF) node, and discards the data\nor aggregated data received from the CF node. This way, the erroneous data\ngenerated by the CF nodes could be filtered at various levels of the data\ngathering tree and are prevented from reaching the root node (sink node).\nFinally, we assess the effectiveness of our trust evaluation model through a\ncomprehensive simulation study."
    },
    {
        "date": "2014-11-20",
        "title": "Private Empirical Risk Minimization Beyond the Worst Case: The Effect of the Constraint Set Geometry",
        "author": "Kunal Talwar, Abhradeep Thakurta, and Li Zhang",
        "link": "http://arxiv.org/abs/1411.5417v3",
        "abstract": "Empirical Risk Minimization (ERM) is a standard technique in machine\nlearning, where a model is selected by minimizing a loss function over\nconstraint set. When the training dataset consists of private information, it\nis natural to use a differentially private ERM algorithm, and this problem has\nbeen the subject of a long line of work started with Chaudhuri and Monteleoni\n2008. A private ERM algorithm outputs an approximate minimizer of the loss\nfunction and its error can be measured as the difference from the optimal value\nof the loss function. When the constraint set is arbitrary, the required error\nbounds are fairly well understood \\cite{BassilyST14}. In this work, we show\nthat the geometric properties of the constraint set can be used to derive\nsignificantly better results. Specifically, we show that a differentially\nprivate version of Mirror Descent leads to error bounds of the form\n$\\tilde{O}(G_{\\mathcal{C}}/n)$ for a lipschitz loss function, improving on the\n$\\tilde{O}(\\sqrt{p}/n)$ bounds in Bassily, Smith and Thakurta 2014. Here $p$ is\nthe dimensionality of the problem, $n$ is the number of data points in the\ntraining set, and $G_{\\mathcal{C}}$ denotes the Gaussian width of the\nconstraint set that we optimize over. We show similar improvements for strongly\nconvex functions, and for smooth functions. In addition, we show that when the\nloss function is Lipschitz with respect to the $\\ell_1$ norm and $\\mathcal{C}$\nis $\\ell_1$-bounded, a differentially private version of the Frank-Wolfe\nalgorithm gives error bounds of the form $\\tilde{O}(n^{-2/3})$. This captures\nthe important and common case of sparse linear regression (LASSO), when the\ndata $x_i$ satisfies $|x_i|_{\\infty} \\leq 1$ and we optimize over the $\\ell_1$\nball. We show new lower bounds for this setting, that together with known\nbounds, imply that all our upper bounds are tight."
    },
    {
        "date": "2014-11-19",
        "title": "Complexity of distance fraud attacks in graph-based distance bounding",
        "author": "Rolando Trujillo-Rasua",
        "link": "http://arxiv.org/abs/1412.6016v1",
        "abstract": "Distance bounding (DB) emerged as a countermeasure to the so-called\n\\emph{relay attack}, which affects several technologies such as RFID, NFC,\nBluetooth, and Ad-hoc networks. A prominent family of DB protocols are those\nbased on graphs, which were introduced in 2010 to resist both mafia and\ndistance frauds. The security analysis in terms of distance fraud is performed\nby considering an adversary that, given a vertex labeled graph $G = (V, E)$ and\na vertex $v \\in V$, is able to find the most frequent $n$-long sequence in $G$\nstarting from $v$ (MFS problem). However, to the best of our knowledge, it is\nstill an open question whether the distance fraud security can be computed\nconsidering the aforementioned adversarial model. Our first contribution is a\nproof that the MFS problem is NP-Hard even when the graph is constrained to\nmeet the requirements of a graph-based DB protocol. Although this result does\nnot invalidate the model, it does suggest that a \\emph{too-strong} adversary is\nperhaps being considered (i.e., in practice, graph-based DB protocols might\nresist distance fraud better than the security model suggests.) Our second\ncontribution is an algorithm addressing the distance fraud security of the\ntree-based approach due to Avoine and Tchamkerten. The novel algorithm improves\nthe computational complexity $O(2^{2^n+n})$ of the naive approach to\n$O(2^{2n}n)$ where $n$ is the number of rounds."
    },
    {
        "date": "2014-11-18",
        "title": "Security Analysis of the Unrestricted Identity-Based Aggregate Signature Scheme",
        "author": "Kwangsu Lee, and Dong Hoon Lee",
        "link": "http://arxiv.org/abs/1411.4696v1",
        "abstract": "Aggregate signatures allow anyone to combine different signatures signed by\ndifferent signers on different messages into a single short signature. An ideal\naggregate signature scheme is an identity-based aggregate signature (IBAS)\nscheme that supports full aggregation since it can reduce the total transmitted\ndata by using an identity string as a public key and anyone can freely\naggregate different signatures. Constructing a secure IBAS scheme that supports\nfull aggregation in bilinear maps is an important open problem. Recently, Yuan\n{\\it et al.} proposed an IBAS scheme with full aggregation in bilinear maps and\nclaimed its security in the random oracle model under the computational\nDiffie-Hellman assumption. In this paper, we show that there exists an\nefficient forgery attacker on their IBAS scheme and their security proof has a\nserious flaw."
    },
    {
        "date": "2014-11-13",
        "title": "Holistic Collaborative Privacy Framework for Users' Privacy in Social Recommender Service",
        "author": "Ahmed M. Elmisery, Seungmin Rho, and Dmitri Botvich",
        "link": "http://arxiv.org/abs/1411.3737v1",
        "abstract": "The current business model for existing recommender services is centered\naround the availability of users' personal data at their side whereas consumers\nhave to trust that the recommender service providers will not use their data in\na malicious way. With the increasing number of cases for privacy breaches,\ndifferent countries and corporations have issued privacy laws and regulations\nto define the best practices for the protection of personal information. The\ndata protection directive 95/46/EC and the privacy principles established by\nthe Organization for Economic Cooperation and Development (OECD) are examples\nof such regulation frameworks. In this paper, we assert that utilizing\nthird-party recommender services to generate accurate referrals are feasible,\nwhile preserving the privacy of the users' sensitive information which will be\nresiding on a clear form only on his/her own device. As a result, each user who\nbenefits from the third-party recommender service will have absolute control\nover what to release from his/her own preferences. We proposed a collaborative\nprivacy middleware that executes a two stage concealment process within a\ndistributed data collection protocol in order to attain this claim.\nAdditionally, the proposed solution complies with one of the common privacy\nregulation frameworks for fair information practice in a natural and functional\nway -which is OECD privacy principles. The approach presented in this paper is\neasily integrated into the current business model as it is implemented using a\nmiddleware that runs at the end-users side and utilizes the social nature of\ncontent distribution services to implement a topological data collection\nprotocol."
    },
    {
        "date": "2014-11-10",
        "title": "A Formal Approach to Distributed System Security Test Generation",
        "author": "Vladimir A. Khlevnoy, and Andrey A. Shchurov",
        "link": "http://arxiv.org/abs/1411.2406v1",
        "abstract": "Deployment of distributed systems sets high requirements for procedures for\nthe security testing of these systems. This work introduces: (1) a list of\ntypical threats based on standards and actual practices; (2) an extended\nsix-layered model for test generation mission on the basis of technical\nspecifications and end-user requirements. Based on the list of typical threats\nand the multilayer model, we describe a formal approach to the automated design\nand generation of security mechanisms checklists for complex distributed\nsystems."
    },
    {
        "date": "2014-11-07",
        "title": "A Provenance-Policy Based Access Control Model For Data Usage Validation In Cloud",
        "author": "Muralikrishnan Ramane, Balaji Vasudevan, and Sathappan Allaphan",
        "link": "http://arxiv.org/abs/1411.1933v1",
        "abstract": "In an organization specifically as virtual as cloud there is need for access\ncontrol systems to constrain users direct or backhanded action that could lead\nto breach of security. In cloud, apart from owner access to confidential data\nthe third party auditing and accounting is done which could stir up further\ndata leaks. To control such data leaks and integrity, in past several security\npolicies based on role, identity and user attributes were proposed and found\nineffective since they depend on static policies which do not monitor data\naccess and its origin. Provenance on the other hand tracks data usage and its\norigin which proves the authenticity of data. To employ provenance in a real\ntime system like cloud, the service provider needs to store metadata on the\nsubject of data alteration which is universally called as the Provenance\nInformation. This paper presents a provenance-policy based access control model\nwhich is designed and integrated with the system that not only makes data\nauditable but also incorporates accountability for data alteration events."
    },
    {
        "date": "2014-11-06",
        "title": "Wireless-Delimited Secure Zones with Encrypted Attribute-Based Broadcast for Safe Firearms",
        "author": "Marcos Portnoi, and Chien-Chung Shen",
        "link": "http://arxiv.org/abs/1411.1733v1",
        "abstract": "This work presents an application of the highly expressive Attribute-Based\nEncryption to implement wireless-delimited Secure Zones for firearms. Within\nthese zones, radio-transmitted local policies based on attributes of the\nconsumer and the firearm are received by embedded hardware in the firearms,\nwhich then advises the consumer about safe operations. The Secure Zones utilize\nAttribute-Based Encryption to encode the policies and consumer or user\nattributes, and providing privacy and security through it cryptography. We\ndescribe a holistic approach to evolving the firearm to a cyber-physical system\nto aid in augmenting safety. We introduce a conceptual model for a firearm\nequipped with sensors and a context-aware software agent. Based on the\ninformation from the sensors, the agent can access the context and inform the\nconsumer of potential unsafe operations. To support Secure Zones and the\ncyber-physical firearm model, we propose a Key Infrastructure Scheme for key\ngeneration, distribution, and management, and a Context-Aware Software Agent\nFramework for Firearms."
    },
    {
        "date": "2014-11-05",
        "title": "Storms in Mobile Networks",
        "author": "Gokce Gorbil, Omer H. Abdelrahman, Mihajlo Pavloski, and Erol Gelenbe",
        "link": "http://arxiv.org/abs/1411.1280v1",
        "abstract": "Mobile networks are vulnerable to signalling attacks and storms that are\ncaused by traffic patterns that overload the control plane, and differ from\ndistributed denial of service (DDoS) attacks in the Internet since they\ndirectly attack the control plane, and also reserve wireless bandwidth without\nactually using it. Such attacks can result from malware and mobile botnets, as\nwell as from poorly designed applications, and can cause service outages in 3G\nand 4G networks which have been experienced by mobile operators. Since the\nradio resource control (RRC) protocol in 3G and 4G networks is particularly\nsusceptible to such attacks, we analyze their effect with a mathematical model\nthat helps to predict the congestion that is caused by an attack. A detailed\nsimulation model of a mobile network is used to better understand the temporal\ndynamics of user behavior and signalling in the network and to show how RRC\nbased signalling attacks and storms cause significant problems in the control\nplane and the user plane of the network. Our analysis also serves to identify\nhow storms can be detected, and to propose how system parameters can be chosen\nto mitigate their effect."
    },
    {
        "date": "2014-11-02",
        "title": "AirHopper: Bridging the Air-Gap between Isolated Networks and Mobile Phones using Radio Frequencies",
        "author": "Mordechai Guri, Gabi Kedma, Assaf Kachlon, and Yuval Elovici",
        "link": "http://arxiv.org/abs/1411.0237v1",
        "abstract": "Information is the most critical asset of modern organizations, and\naccordingly coveted by adversaries. When highly sensitive data is involved, an\norganization may resort to air-gap isolation, in which there is no networking\nconnection between the inner network and the external world. While infiltrating\nan air-gapped network has been proven feasible in recent years (e.g., Stuxnet),\ndata exfiltration from an air-gapped network is still considered to be one of\nthe most challenging phases of an advanced cyber-attack. In this paper we\npresent \"AirHopper\", a bifurcated malware that bridges the air-gap between an\nisolated network and nearby infected mobile phones using FM signals. While it\nis known that software can intentionally create radio emissions from a video\ndisplay unit, this is the first time that mobile phones are considered in an\nattack model as the intended receivers of maliciously crafted radio signals. We\nexamine the attack model and its limitations, and discuss implementation\nconsiderations such as stealth and modulation methods. Finally, we evaluate\nAirHopper and demonstrate how textual and binary data can be exfiltrated from\nphysically isolated computer to mobile phones at a distance of 1-7 meters, with\neffective bandwidth of 13-60 Bps (Bytes per second)."
    },
    {
        "date": "2014-10-29",
        "title": "Design of Binary Quantizers for Distributed Detection under Secrecy Constraints",
        "author": "V. Sriram Siddhardh Nadendla, and Pramod K. Varshney",
        "link": "http://arxiv.org/abs/1410.8100v2",
        "abstract": "In this paper, we investigate the design of distributed detection networks in\nthe presence of an eavesdropper (Eve). We consider the problem of designing\nbinary quantizers at the sensors that maximize the Kullback-Leibler (KL)\nDivergence at the fusion center (FC), subject to a tolerable constraint on the\nKL Divergence at Eve. In the case of i.i.d. received symbols at both the FC and\nEve, we prove that the structure of the optimal binary quantizers is a\nlikelihood ratio test (LRT). We also present an algorithm to find the threshold\nof the optimal LRT, and illustrate it for the case of Additive White Gaussian\nNoise (AWGN) observation models at the sensors. In the case of non-i.i.d.\nreceived symbols at both FC and Eve, we propose a dynamic-programming based\nalgorithm to find efficient quantizers at the sensors. Numerical results are\npresented to illustrate the performance of the proposed network design."
    },
    {
        "date": "2014-10-28",
        "title": "A Systematic Security Evaluation of Android's Multi-User Framework",
        "author": "Paul Ratazzi, Yousra Aafer, Amit Ahlawat, Hao Hao, Yifei Wang, and Wenliang Du",
        "link": "http://arxiv.org/abs/1410.7752v1",
        "abstract": "Like many desktop operating systems in the 1990s, Android is now in the\nprocess of including support for multi-user scenarios. Because these scenarios\nintroduce new threats to the system, we should have an understanding of how\nwell the system design addresses them. Since the security implications of\nmulti-user support are truly pervasive, we developed a systematic approach to\nstudying the system and identifying problems. Unlike other approaches that\nfocus on specific attacks or threat models, ours systematically identifies\ncritical places where access controls are not present or do not properly\nidentify the subject and object of a decision. Finding these places gives us\ninsight into hypothetical attacks that could result, and allows us to design\nspecific experiments to test our hypothesis.\n  Following an overview of the new features and their implementation, we\ndescribe our methodology, present a partial list of our most interesting\nhypotheses, and describe the experiments we used to test them. Our findings\nindicate that the current system only partially addresses the new threats,\nleaving the door open to a number of significant vulnerabilities and privacy\nissues. Our findings span a spectrum of root causes, from simple oversights,\nall the way to major system design problems. We conclude that there is still a\nlong way to go before the system can be used in anything more than the most\ncasual of sharing environments."
    },
    {
        "date": "2014-10-28",
        "title": "Sprobes: Enforcing Kernel Code Integrity on the TrustZone Architecture",
        "author": "Xinyang Ge, Hayawardh Vijayakumar, and Trent Jaeger",
        "link": "http://arxiv.org/abs/1410.7747v1",
        "abstract": "Many smartphones now deploy conventional operating systems, so the rootkit\nattacks so prevalent on desktop and server systems are now a threat to\nsmartphones. While researchers have advocated using virtualization to detect\nand prevent attacks on operating systems (e.g., VM introspection and trusted\nvirtual domains), virtualization is not practical on smartphone systems due to\nthe lack of virtualization support and/or the expense of virtualization.\nCurrent smartphone processors do have hardware support for running a protected\nenvironment, such as the ARM TrustZone extensions, but such hardware does not\ncontrol the operating system operations sufficiently to enable VM\nintrospection. In particular, a conventional operating system running with\nTrustZone still retains full control of memory management, which a rootkit can\nuse to prevent traps on sensitive instructions or memory accesses necessary for\neffective introspection. In this paper, we present SPROBES, a novel primitive\nthat enables introspection of operating systems running on ARM TrustZone\nhardware. Using SPROBES, an introspection mechanism protected by TrustZone can\ninstrument individual operating system instructions of its choice, receiving an\nunforgeable trap whenever any SPROBE is executed. The key challenge in\ndesigning SPROBES is preventing the rootkit from removing them, but we identify\na set of five invariants whose enforcement is sufficient to restrict rootkits\nto execute only approved, SPROBE-injected kernel code. We implemented a\nproof-of-concept version of SPROBES for the ARM Fast Models emulator,\ndemonstrating that in Linux kernel 2.6.38, only 12 SPROBES are sufficient to\nenforce all five of these invariants. With SPROBES we show that it is possible\nto leverage the limited TrustZone extensions to limit conventional kernel\nexecution to approved code comprehensively."
    },
    {
        "date": "2014-10-28",
        "title": "Data Driven Authentication: On the Effectiveness of User Behaviour Modelling with Mobile Device Sensors",
        "author": "Hilmi Gunes Kayacik, Mike Just, Lynne Baillie, David Aspinall, and Nicholas Micallef",
        "link": "http://arxiv.org/abs/1410.7743v1",
        "abstract": "We propose a lightweight, and temporally and spatially aware user behaviour\nmodelling technique for sensor-based authentication. Operating in the\nbackground, our data driven technique compares current behaviour with a user\nprofile. If the behaviour deviates sufficiently from the established norm,\nactions such as explicit authentication can be triggered. To support a quick\nand lightweight deployment, our solution automatically switches from training\nmode to deployment mode when the user's behaviour is sufficiently learned.\nFurthermore, it allows the device to automatically determine a suitable\ndetection threshold. We use our model to investigate practical aspects of\nsensor-based authentication by applying it to three publicly available data\nsets, computing expected times for training duration and behaviour drift. We\nalso test our model with scenarios involving an attacker with varying knowledge\nand capabilities."
    },
    {
        "date": "2014-10-28",
        "title": "Anomaly Detection Framework Using Rule Extraction for Efficient Intrusion Detection",
        "author": "Antti Juvonen, and Tuomo Sipola",
        "link": "http://arxiv.org/abs/1410.7709v1",
        "abstract": "Huge datasets in cyber security, such as network traffic logs, can be\nanalyzed using machine learning and data mining methods. However, the amount of\ncollected data is increasing, which makes analysis more difficult. Many machine\nlearning methods have not been designed for big datasets, and consequently are\nslow and difficult to understand. We address the issue of efficient network\ntraffic classification by creating an intrusion detection framework that\napplies dimensionality reduction and conjunctive rule extraction. The system\ncan perform unsupervised anomaly detection and use this information to create\nconjunctive rules that classify huge amounts of traffic in real time. We test\nthe implemented system with the widely used KDD Cup 99 dataset and real-world\nnetwork logs to confirm that the performance is satisfactory. This system is\ntransparent and does not work like a black box, making it intuitive for domain\nexperts, such as network administrators."
    },
    {
        "date": "2014-10-28",
        "title": "Fisher-Yates Chaotic Shuffling Based Image Encryption",
        "author": "Swaleha Saeed, M Sarosh Umar, M Athar Ali, and Musheer Ahmad",
        "link": "http://arxiv.org/abs/1410.7540v1",
        "abstract": "In Present era, information security is of utmost concern and encryption is\none of the alternatives to ensure security. Chaos based cryptography has\nbrought a secure and efficient way to meet the challenges of secure multimedia\ntransmission over the networks. In this paper, we have proposed a secure\nGrayscale image encryption methodology in wavelet domain. The proposed\nalgorithm performs shuffling followed by encryption using states of chaotic map\nin a secure manner. Firstly, the image is transformed from spatial domain to\nwavelet domain by the Haar wavelet. Subsequently, Fisher Yates chaotic\nshuffling technique is employed to shuffle the image in wavelet domain to\nconfuse the relationship between plain image and cipher image. A key dependent\npiece-wise linear chaotic map is used to generate chaos for the chaotic\nshuffling. Further, the resultant shuffled approximate coefficients are\nchaotically modulated. To enhance the statistical characteristics from\ncryptographic point of view, the shuffled image is self keyed diffused and\nmixing operation is carried out using keystream extracted from one-dimensional\nchaotic map and the plain-image. The proposed algorithm is tested over some\nstandard image dataset. The results of several experimental, statistical and\nsensitivity analyses proved that the algorithm provides an efficient and secure\nmethod to achieve trusted gray scale image encryption."
    },
    {
        "date": "2014-10-24",
        "title": "That Ain't You: Detecting Spearphishing Emails Before They Are Sent",
        "author": "Gianluca Stringhini, and Olivier Thonnard",
        "link": "http://arxiv.org/abs/1410.6629v1",
        "abstract": "One of the ways in which attackers try to steal sensitive information from\ncorporations is by sending spearphishing emails. This type of emails typically\nappear to be sent by one of the victim's coworkers, but have instead been\ncrafted by an attacker. A particularly insidious type of spearphishing emails\nare the ones that do not only claim to come from a trusted party, but were\nactually sent from that party's legitimate email account that was compromised\nin the first place. In this paper, we propose a radical change of focus in the\ntechniques used for detecting such malicious emails: instead of looking for\nparticular features that are indicative of attack emails, we look for possible\nindicators of impersonation of the legitimate owners. We present\nIdentityMailer, a system that validates the authorship of emails by learning\nthe typical email-sending behavior of users over time, and comparing any\nsubsequent email sent from their accounts against this model. Our experiments\non real world e-mail datasets demonstrate that our system can effectively block\nadvanced email attacks sent from genuine email accounts, which traditional\nprotection systems are unable to detect. Moreover, we show that it is resilient\nto an attacker willing to evade the system. To the best of our knowledge,\nIdentityMailer is the first system able to identify spearphishing emails that\nare sent from within an organization, by a skilled attacker having access to a\ncompromised email account."
    },
    {
        "date": "2014-10-22",
        "title": "Protecting Locations with Differential Privacy under Temporal Correlations",
        "author": "Yonghui Xiao, and Li Xiong",
        "link": "http://arxiv.org/abs/1410.5919v5",
        "abstract": "Concerns on location privacy frequently arise with the rapid development of\nGPS enabled devices and location-based applications. While spatial\ntransformation techniques such as location perturbation or generalization have\nbeen studied extensively, most techniques rely on syntactic privacy models\nwithout rigorous privacy guarantee. Many of them only consider static scenarios\nor perturb the location at single timestamps without considering temporal\ncorrelations of a moving user's locations, and hence are vulnerable to various\ninference attacks. While differential privacy has been accepted as a standard\nfor privacy protection, applying differential privacy in location based\napplications presents new challenges, as the protection needs to be enforced on\nthe fly for a single user and needs to incorporate temporal correlations\nbetween a user's locations.\n  In this paper, we propose a systematic solution to preserve location privacy\nwith rigorous privacy guarantee. First, we propose a new definition,\n\"$\\delta$-location set\" based differential privacy, to account for the temporal\ncorrelations in location data. Second, we show that the well known\n$\\ell_1$-norm sensitivity fails to capture the geometric sensitivity in\nmultidimensional space and propose a new notion, sensitivity hull, based on\nwhich the error of differential privacy is bounded. Third, to obtain the\noptimal utility we present a planar isotropic mechanism (PIM) for location\nperturbation, which is the first mechanism achieving the lower bound of\ndifferential privacy. Experiments on real-world datasets also demonstrate that\nPIM significantly outperforms baseline approaches in data utility."
    },
    {
        "date": "2014-10-22",
        "title": "Distributed Detection in Tree Networks: Byzantines and Mitigation Techniques",
        "author": "Bhavya Kailkhura, Swastik Brahma, Berkan Dulek, Yunghsiang S Han, and Pramod K. Varshney",
        "link": "http://arxiv.org/abs/1410.5904v1",
        "abstract": "In this paper, the problem of distributed detection in tree networks in the\npresence of Byzantines is considered. Closed form expressions for optimal\nattacking strategies that minimize the miss detection error exponent at the\nfusion center (FC) are obtained. We also look at the problem from the network\ndesigner's (FC's) perspective. We study the problem of designing optimal\ndistributed detection parameters in a tree network in the presence of\nByzantines. Next, we model the strategic interaction between the FC and the\nattacker as a Leader-Follower (Stackelberg) game. This formulation provides a\nmethodology for predicting attacker and defender (FC) equilibrium strategies,\nwhich can be used to implement the optimal detector. Finally, a reputation\nbased scheme to identify Byzantines is proposed and its performance is\nanalytically evaluated. We also provide some numerical examples to gain\ninsights into the solution."
    },
    {
        "date": "2014-10-21",
        "title": "DAPriv: Decentralized architecture for preserving the privacy of medical data",
        "author": "Rajesh Sharma, Deepak Subramanian, and Satish N. Srirama",
        "link": "http://arxiv.org/abs/1410.5696v1",
        "abstract": "The digitization of the medical data has been a sensitive topic. In modern\ntimes laws such as the HIPAA provide some guidelines for electronic\ntransactions in medical data to prevent attacks and fraudulent usage of private\ninformation. In our paper, we explore an architecture that uses hybrid\ncomputing with decentralized key management and show how it is suitable in\npreventing a special form of re-identification attack that we name as the\nre-assembly attack. This architecture would be able to use current\ninfrastructure from mobile phones to server certificates and cloud based\ndecentralized storage models in an efficient way to provide a reliable model\nfor communication of medical data. We encompass entities including patients,\ndoctors, insurance agents, emergency contacts, researchers, medical test\nlaboratories and technicians. This is a complete architecture that provides\npatients with a good level of privacy, secure communication and more direct\ncontrol."
    },
    {
        "date": "2014-10-17",
        "title": "Testing Security Policies for Distributed Systems: Vehicular Networks as a Case Study",
        "author": "Mohamed H. E. Aouadi, Khalifa Toumi, and Ana Cavalli",
        "link": "http://arxiv.org/abs/1410.5789v1",
        "abstract": "Due to the increasing complexity of distributed systems, security testing is\nbecoming increasingly critical in insuring reliability of such systems in\nrelation to their security requirements. . To challenge this issue, we rely in\nthis paper1 on model based active testing. In this paper we propose a framework\nto specify security policies and test their implementation. Our framework makes\nit possible to automatically generate test sequences, in order to validate the\nconformance of a security policy. This framework contains several new methods\nto ease the test case generation. To demonstrate the reliability of our\nframework, we present a Vehicular Networks System as an ongoing case study."
    },
    {
        "date": "2014-10-16",
        "title": "Model the System from Adversary Viewpoint: Threats Identification and Modeling",
        "author": "Muhammad Sabir Idrees, Yves Roudier, and Ludovic Apvrille",
        "link": "http://arxiv.org/abs/1410.4305v1",
        "abstract": "Security attacks are hard to understand, often expressed with unfriendly and\nlimited details, making it difficult for security experts and for security\nanalysts to create intelligible security specifications. For instance, to\nexplain Why (attack objective), What (i.e., system assets, goals, etc.), and\nHow (attack method), adversary achieved his attack goals. We introduce in this\npaper a security attack meta-model for our SysML-Sec framework, developed to\nimprove the threat identification and modeling through the explicit\nrepresentation of security concerns with knowledge representation techniques.\nOur proposed meta-model enables the specification of these concerns through\nontological concepts which define the semantics of the security artifacts and\nintroduced using SysML-Sec diagrams. This meta-model also enables representing\nthe relationships that tie several such concepts together. This representation\nis then used for reasoning about the knowledge introduced by system designers\nas well as security experts through the graphical environment of the SysML-Sec\nframework."
    },
    {
        "date": "2014-10-16",
        "title": "Digital Investigation of Security Attacks on Cardiac Implantable Medical Devices",
        "author": "Nourhene Ellouze, Slim Rekhis, Mohamed Allouche, and Noureddine Boudriga",
        "link": "http://arxiv.org/abs/1410.4303v1",
        "abstract": "A Cardiac Implantable Medical device (IMD) is a device, which is surgically\nimplanted into a patient's body, and wirelessly configured using an external\nprogrammer by prescribing physicians and doctors. A set of lethal attacks\ntargeting these devices can be conducted due to the use of vulnerable wireless\ncommunication and security protocols, and the lack of security protection\nmechanisms deployed on IMDs. In this paper, we propose a system for postmortem\nanalysis of lethal attack scenarios targeting cardiac IMDs. Such a system\nreconciles in the same framework conclusions derived by technical investigators\nand deductions generated by pathologists. An inference system integrating a\nlibrary of medical rules is used to automatically infer potential medical\nscenarios that could have led to the death of a patient. A Model Checking based\nformal technique allowing the reconstruction of potential technical attack\nscenarios on the IMD, starting from the collected evidence, is also proposed. A\ncorrelation between the results obtained by the two techniques allows to prove\nwhether a potential attack scenario is the source of the patient's death."
    },
    {
        "date": "2014-10-16",
        "title": "Combining Technical and Financial Impacts for Countermeasure Selection",
        "author": "Gustavo Gonzalez-Granadillo, Christophe Ponchel, Gregory Blanc, and Hervé Debar",
        "link": "http://arxiv.org/abs/1411.0654v1",
        "abstract": "Research in information security has generally focused on providing a\ncomprehensive interpretation of threats, vulnerabilities, and attacks, in\nparticular to evaluate their danger and prioritize responses accordingly. Most\nof the current approaches propose advanced techniques to detect intrusions and\ncomplex attacks but few of these approaches propose well defined methodologies\nto react against a given attack. In this paper, we propose a novel and\nsystematic method to select security countermeasures from a pool of candidates,\nby ranking them based on the technical and financial impact associated to each\nalternative. The method includes industrial evaluation and simulations of the\nimpact associated to a given security measure which allows to compute the\nreturn on response investment for different candidates. A simple case study is\nproposed at the end of the paper to show the applicability of the model."
    },
    {
        "date": "2014-10-15",
        "title": "XSS Peeker: A Systematic Analysis of Cross-site Scripting Vulnerability Scanners",
        "author": "Enrico Bazzoli, Claudio Criscione, Federico Maggi, and Stefano Zanero",
        "link": "http://arxiv.org/abs/1410.4207v1",
        "abstract": "Since the first publication of the \"OWASP Top 10\" (2004), cross-site\nscripting (XSS) vulnerabilities have always been among the top 5 web\napplication security bugs. Black-box vulnerability scanners are widely used in\nthe industry to reproduce (XSS) attacks automatically. In spite of the\ntechnical sophistication and advancement, previous work showed that black-box\nscanners miss a non-negligible portion of vulnerabilities, and report\nnon-existing, non-exploitable or uninteresting vulnerabilities. Unfortunately,\nthese results hold true even for XSS vulnerabilities, which are relatively\nsimple to trigger if compared, for instance, to logic flaws.\n  Black-box scanners have not been studied in depth on this vertical: knowing\nprecisely how scanners try to detect XSS can provide useful insights to\nunderstand their limitations, to design better detection methods. In this\npaper, we present and discuss the results of a detailed and systematic study on\n6 black-box web scanners (both proprietary and open source) that we conducted\nin coordination with the respective vendors. To this end, we developed an\nautomated tool to (1) extract the payloads used by each scanner, (2) distill\nthe \"templates\" that have originated each payload, (3) evaluate them according\nto quality indicators, and (4) perform a cross-scanner analysis. Unlike\nprevious work, our testbed application, which contains a large set of XSS\nvulnerabilities, including DOM XSS, was gradually retrofitted to accomodate for\nthe payloads that triggered no vulnerabilities.\n  Our analysis reveals a highly fragmented scenario. Scanners exhibit a wide\nvariety of distinct payloads, a non-uniform approach to fuzzing and mutating\nthe payloads, and a very diverse detection effectiveness."
    },
    {
        "date": "2014-10-14",
        "title": "The Foundational Cryptography Framework",
        "author": "Adam Petcher, and Greg Morrisett",
        "link": "http://arxiv.org/abs/1410.3735v1",
        "abstract": "We present the Foundational Cryptography Framework (FCF) for developing and\nchecking complete proofs of security for cryptographic schemes within a proof\nassistant. This is a general-purpose framework that is capable of modeling and\nreasoning about a wide range of cryptographic schemes, security definitions,\nand assumptions. Security is proven in the computational model, and the proof\nprovides concrete bounds as well as asymptotic conclusions. FCF provides a\nlanguage for probabilistic programs, a theory that is used to reason about\nprograms, and a library of tactics and definitions that are useful in proofs\nabout cryptography. The framework is designed to leverage fully the existing\ntheory and capabilities of the Coq proof assistant in order to reduce the\neffort required to develop proofs."
    },
    {
        "date": "2014-10-13",
        "title": "An exhaustive survey of trust models in p2p network",
        "author": "S. Udhaya Shree, and Dr. M. S. Saleem Basha",
        "link": "http://arxiv.org/abs/1411.3294v1",
        "abstract": "Most of the peers accessing the services are under the assumption that the\nservice accessed in a P2P network is utmost secured. By means of prevailing\nhard security mechanisms, security goals like authentication, authorization,\nprivacy, non repudiation of services and other hard security issues are\nresolved. But these mechanisms fail to provide soft security. An exhaustive\nsurvey of existing trust and reputation models in P2P network regarding service\nprovisioning is presented and challenges are listed.p2p Trust issues like trust\nbootstrapping, trust evidence procurement, trust assessment, trust interaction\noutcome evaluation and other trust based classification of peers behaviour into\ntrusted, inconsistent, un trusted, malicious, betraying, redemptive are\ndiscussed."
    },
    {
        "date": "2014-10-13",
        "title": "POSTER: Privacy-preserving Indoor Localization",
        "author": "Jan Henrik Ziegeldorf, Nicolai Viol, Martin Henze, and Klaus Wehrle",
        "link": "http://arxiv.org/abs/1410.3270v1",
        "abstract": "Upcoming WiFi-based localization systems for indoor environments face a\nconflict of privacy interests: Server-side localization violates location\nprivacy of the users, while localization on the user's device forces the\nlocalization provider to disclose the details of the system, e.g.,\nsophisticated classification models. We show how Secure Two-Party Computation\ncan be used to reconcile privacy interests in a state-of-the-art localization\nsystem. Our approach provides strong privacy guarantees for all involved\nparties, while achieving room-level localization accuracy at reasonable\noverheads."
    },
    {
        "date": "2014-10-05",
        "title": "Security Formalizations and Their Relationships for Encryption and Key Agreement in Information-Theoretic Cryptography",
        "author": "Mitsugu Iwamoto, Kazuo Ohta, and Junji Shikata",
        "link": "http://arxiv.org/abs/1410.1120v1",
        "abstract": "This paper revisits formalizations of information-theoretic security for\nsymmetric-key encryption and key agreement protocols which are very fundamental\nprimitives in cryptography. In general, we can formalize information-theoretic\nsecurity in various ways: some of them can be formalized as stand-alone\nsecurity by extending (or relaxing) Shannon's perfect secrecy or by other ways\nsuch as semantic security; some of them can be done based on composable\nsecurity. Then, a natural question about this is: what is the gap between the\nformalizations? To answer the question, we investigate relationships between\nseveral formalizations of information-theoretic security for symmetric-key\nencryption and key agreement protocols. Specifically, for symmetric-key\nencryption protocols in a general setting including the case where there exist\ndecryption-errors, we deal with the following formalizations of security:\nformalizations extended (or relaxed) from Shannon's perfect secrecy by using\nmutual information and statistical distance; information-theoretic analogues of\nindistinguishability and semantic security by Goldwasser and Micali; and\ncomposable security by Maurer et al. and Canetti. Then, we explicitly show the\nequivalence and non-equivalence between those formalizations. Under the model,\nwe also derive lower bounds on the adversary's (or distinguisher's) advantage\nand the size of secret-keys required under all of the above formalizations.\nAlthough some of them may be already known, we can explicitly derive them all\nat once through our relationships between the formalizations. In addition, we\nbriefly observe impossibility results which easily follow from the lower\nbounds. The similar results are also shown for key agreement protocols in a\ngeneral setting including the case where there exist agreement-errors in the\nprotocols."
    },
    {
        "date": "2014-09-30",
        "title": "The Case for a Collaborative Universal Peer-to-Peer Botnet Investigation Framework",
        "author": "Mark Scanlon, and M-Tahar Kechadi",
        "link": "http://arxiv.org/abs/1409.8490v1",
        "abstract": "Peer-to-Peer (P2P) botnets are becoming widely used as a low-overhead,\nefficient, self-maintaining, distributed alternative to the traditional\nclient/server model across a broad range of cyberattacks. These cyberattacks\ncan take the form of distributed denial of service attacks, authentication\ncracking, spamming, cyberwarfare or malware distribution targeting on financial\nsystems. These attacks can also cross over into the physical world attacking\ncritical infrastructure causing its disruption or destruction (power,\ncommunications, water, etc.). P2P technology lends itself well to being\nexploited for such malicious purposes due to the minimal setup, running and\nmaintenance costs involved in executing a globally orchestrated attack,\nalongside the perceived additional layer of anonymity. In the ever-evolving\nspace of botnet technology, reducing the time lag between discovering a newly\ndeveloped or updated botnet system and gaining the ability to mitigate against\nit is paramount. Often, numerous investigative bodies duplicate their efforts\nin creating bespoke tools to combat particular threats. This paper outlines a\nframework capable of fast tracking the investigative process through\ncollaboration between key stakeholders."
    },
    {
        "date": "2014-09-29",
        "title": "THRIVE: Threshold Homomorphic encryption based secure and privacy preserving bIometric VErification system",
        "author": "Cagatay Karabat, Mehmet Sabir Kiraz, Hakan Erdogan, and Erkay Savas",
        "link": "http://arxiv.org/abs/1409.8212v1",
        "abstract": "In this paper, we propose a new biometric verification and template\nprotection system which we call the THRIVE system. The system includes novel\nenrollment and authentication protocols based on threshold homomorphic\ncryptosystem where the private key is shared between a user and the verifier.\nIn the THRIVE system, only encrypted binary biometric templates are stored in\nthe database and verification is performed via homomorphically randomized\ntemplates, thus, original templates are never revealed during the\nauthentication stage. The THRIVE system is designed for the malicious model\nwhere the cheating party may arbitrarily deviate from the protocol\nspecification. Since threshold homomorphic encryption scheme is used, a\nmalicious database owner cannot perform decryption on encrypted templates of\nthe users in the database. Therefore, security of the THRIVE system is enhanced\nusing a two-factor authentication scheme involving the user's private key and\nthe biometric data. We prove security and privacy preservation capability of\nthe proposed system in the simulation-based model with no assumption. The\nproposed system is suitable for applications where the user does not want to\nreveal her biometrics to the verifier in plain form but she needs to proof her\nphysical presence by using biometrics. The system can be used with any\nbiometric modality and biometric feature extraction scheme whose output\ntemplates can be binarized. The overall connection time for the proposed THRIVE\nsystem is estimated to be 336 ms on average for 256-bit biohash vectors on a\ndesktop PC running with quad-core 3.2 GHz CPUs at 10 Mbit/s up/down link\nconnection speed. Consequently, the proposed system can be efficiently used in\nreal life applications."
    },
    {
        "date": "2014-09-28",
        "title": "A network-dependent rewarding system: proof-of-mining",
        "author": "Joe Lao",
        "link": "http://arxiv.org/abs/1409.7948v1",
        "abstract": "A soft control of the network activity through varying reward in a\nproof-of-work (PoW) cryptocurrency is reported. Rewards are the necessity to\nincent the contributors activities (i.e., mining) in order to maintain the PoW\nnetwork. Contrary to constant rewarding in a certain period implemented in most\nof cryptocurrency, such as bitcoin, we propose a network-dependent rewarding\nmodel system, primarily including two phases: 1) activities encouraging phase\nin which higher rewards are issued at higher network activities; and 2)\ndiscouraging further increase of activities by reducing rewards. The advantages\nof this system include 1) fair distribution of rewards among a variety of\ncontributors, and 2) enforcing a limit to the network activity and hence the\ncost of maintaining the PoW network. This mechanism requires network\ncontributors to show their participation in order to earn maximum rewards,\ni.e., proof-of-mining."
    },
    {
        "date": "2014-09-23",
        "title": "Adversary Model: Adaptive Chosen Ciphertext Attack with Timing Attack",
        "author": "Mohd Anuar Mat Isa, and Habibah Hashim",
        "link": "http://arxiv.org/abs/1409.6556v1",
        "abstract": "We have introduced a novel adversary model in Chosen-Ciphertext Attack with\nTiming Attack (CCA2-TA) and it was a practical model because the model\nincorporates the timing attack. This paper is an extended paper for 'A Secure\nTFTP Protocol with Security Proofs'.\n  Keywords - Timing Attack, Random Oracle Model, Indistinguishabilit, Chosen\nPlaintext Attack, CPA, Chosen Ciphertext Attack, IND-CCA1, Adaptive Chosen\nCiphertext Attack, IND-CCA2, Trivial File Transfer Protocol, TFTP, Security,\nTrust, Privacy, Trusted Computing, UBOOT, AES, IOT, Lightweight, Asymmetric,\nSymmetric, Raspberry Pi, ARM."
    },
    {
        "date": "2014-09-21",
        "title": "IP Tracing and Active Network Response",
        "author": "Tarek S. Sobh, and Awad H. Khalil",
        "link": "http://arxiv.org/abs/1409.5942v1",
        "abstract": "Active security is mainly concerned with performing one or more security\nfunctions when a host in a communication network is subject to an attack. Such\nsecurity functions include appropriate actions against attackers. To properly\nafford active security actions a set of software subsystems should be\nintegrated together so that they can automatically detect and appropriately\naddress any vulnerability in the underlying network. This work presents\nintegrated model for active security response model. The proposed model\nintroduces Active Response Mechanism (ARM) for tracing anonymous attacks in the\nnetwork back to their source. This work is motivated by the increased frequency\nand sophistication of denial-of-service attacks and by the difficulty in\ntracing packets with incorrect, or \"spoofed\", source addresses. This paper\npresents within the proposed model two tracing approaches based on:\n  1.Sleepy Watermark Tracing (SWT) for unauthorized access attacks.\n  2.Probabilistic Packet Marking (PPM) in the network for Denial of Service\n(DoS) and Distributed Denial of Service (DDoS) attacks. On the basis of the\nproposed model a cooperative network security tools such as firewall, intrusion\ndetection system with IP tracing mechanism has been designed for taking a rapid\nactive response against real IPs for attackers. The proposed model is able to\ndetect network vulnerabilities, trace attack source IP and reconfigure the\nattacked subnetworks."
    },
    {
        "date": "2014-09-18",
        "title": "Differentially Private Linear Algebra in the Streaming Model",
        "author": "Jalaj Upadhyay",
        "link": "http://arxiv.org/abs/1409.5414v5",
        "abstract": "Numerical linear algebra plays an important role in computer science. In this\npaper, we initiate the study of performing linear algebraic tasks while\npreserving privacy when the data is streamed online. Our main focus is the\nspace requirement of the privacy-preserving data-structures. We give the first\n{\\em sketch-based} algorithm for differential privacy. We give optimal, up to\nlogarithmic factor, space data-structures that can compute low rank\napproximation, linear regression, and matrix multiplication, while preserving\ndifferential privacy with better additive error bounds compared to the known\nresults. Notably, we match the best known space bound in the non-private\nsetting by Kane and Nelson (J. ACM, 61(1):4).\n  Our mechanism for differentially private low-rank approximation {\\em reuses}\nthe random Gaussian matrix in a specific way to provide a single-pass\nmechanism. We prove that the resulting distribution also preserve differential\nprivacy. This can be of independent interest. We do not make any assumptions,\nlike singular value separation or normalized row assumption, as made in the\nearlier works. The mechanisms for matrix multiplication and linear regression\ncan be seen as the private analogues of the known non-private algorithms. All\nour mechanisms, in the form presented, can also be computed in the distributed\nsetting."
    },
    {
        "date": "2014-09-16",
        "title": "Differentially Private Exponential Random Graphs",
        "author": "Vishesh Karwa, Aleksandra B. Slavković, and Pavel Krivitsky",
        "link": "http://arxiv.org/abs/1409.4696v2",
        "abstract": "We propose methods to release and analyze synthetic graphs in order to\nprotect privacy of individual relationships captured by the social network.\nProposed techniques aim at fitting and estimating a wide class of exponential\nrandom graph models (ERGMs) in a differentially private manner, and thus offer\nrigorous privacy guarantees. More specifically, we use the randomized response\nmechanism to release networks under $\\epsilon$-edge differential privacy. To\nmaintain utility for statistical inference, treating the original graph as\nmissing, we propose a way to use likelihood based inference and Markov chain\nMonte Carlo (MCMC) techniques to fit ERGMs to the produced synthetic networks.\nWe demonstrate the usefulness of the proposed techniques on a real data\nexample."
    },
    {
        "date": "2014-09-16",
        "title": "Audit Games with Multiple Defender Resources",
        "author": "Jeremiah Blocki, Nicolas Christin, Anupam Datta, Ariel Procaccia, and Arunesh Sinha",
        "link": "http://arxiv.org/abs/1409.4503v3",
        "abstract": "Modern organizations (e.g., hospitals, social networks, government agencies)\nrely heavily on audit to detect and punish insiders who inappropriately access\nand disclose confidential information. Recent work on audit games models the\nstrategic interaction between an auditor with a single audit resource and\nauditees as a Stackelberg game, augmenting associated well-studied security\ngames with a configurable punishment parameter. We significantly generalize\nthis audit game model to account for multiple audit resources where each\nresource is restricted to audit a subset of all potential violations, thus\nenabling application to practical auditing scenarios. We provide an FPTAS that\ncomputes an approximately optimal solution to the resulting non-convex\noptimization problem. The main technical novelty is in the design and\ncorrectness proof of an optimization transformation that enables the\nconstruction of this FPTAS. In addition, we experimentally demonstrate that\nthis transformation significantly speeds up computation of solutions for a\nclass of audit games and security games."
    },
    {
        "date": "2014-09-10",
        "title": "On Modeling the Costs of Censorship",
        "author": "Michael Carl Tschantz, Sadia Afroz, Vern Paxson, and J. D. Tygar",
        "link": "http://arxiv.org/abs/1409.3211v1",
        "abstract": "We argue that the evaluation of censorship evasion tools should depend upon\neconomic models of censorship. We illustrate our position with a simple model\nof the costs of censorship. We show how this model makes suggestions for how to\nevade censorship. In particular, from it, we develop evaluation criteria. We\nexamine how our criteria compare to the traditional methods of evaluation\nemployed in prior works."
    },
    {
        "date": "2014-09-08",
        "title": "The Crypto-democracy and the Trustworthy",
        "author": "Sebastien Gambs, Samuel Ranellucci, and and Alain Tapp",
        "link": "http://arxiv.org/abs/1409.2432v1",
        "abstract": "In the current architecture of the Internet, there is a strong asymmetry in\nterms of power between the entities that gather and process personal data\n(e.g., major Internet companies, telecom operators, cloud providers, ...) and\nthe individuals from which this personal data is issued. In particular,\nindividuals have no choice but to blindly trust that these entities will\nrespect their privacy and protect their personal data. In this position paper,\nwe address this issue by proposing an utopian crypto-democracy model based on\nexisting scientific achievements from the field of cryptography. More\nprecisely, our main objective is to show that cryptographic primitives,\nincluding in particular secure multiparty computation, offer a practical\nsolution to protect privacy while minimizing the trust assumptions. In the\ncrypto-democracy envisioned, individuals do not have to trust a single physical\nentity with their personal data but rather their data is distributed among\nseveral institutions. Together these institutions form a virtual entity called\nthe Trustworthy that is responsible for the storage of this data but which can\nalso compute on it (provided first that all the institutions agree on this).\nFinally, we also propose a realistic proof-of-concept of the Trustworthy, in\nwhich the roles of institutions are played by universities. This\nproof-of-concept would have an important impact in demonstrating the\npossibilities offered by the crypto-democracy paradigm."
    },
    {
        "date": "2014-09-08",
        "title": "A Note on Quantum Security for Post-Quantum Cryptography",
        "author": "Fang Song",
        "link": "http://arxiv.org/abs/1409.2187v1",
        "abstract": "Shor's quantum factoring algorithm and a few other efficient quantum\nalgorithms break many classical crypto-systems. In response, people proposed\npost-quantum cryptography based on computational problems that are believed\nhard even for quantum computers. However, security of these schemes against\n\\emph{quantum} attacks is elusive. This is because existing security analysis\n(almost) only deals with classical attackers and arguing security in the\npresence of quantum adversaries is challenging due to unique quantum features\nsuch as no-cloning.\n  This work proposes a general framework to study which classical security\nproofs can be restored in the quantum setting. Basically, we split a security\nproof into (a sequence of) classical security reductions, and investigate what\nsecurity reductions are \"quantum-friendly\". We characterize sufficient\nconditions such that a classical reduction can be \"lifted\" to the quantum\nsetting. We then apply our lifting theorems to post-quantum signature schemes.\nWe are able to show that the classical generic construction of hash-tree based\nsignatures from one-way functions and and a more efficient variant proposed\nin~\\cite{BDH11} carry over to the quantum setting. Namely, assuming existence\nof (classical) one-way functions that are resistant to efficient quantum\ninversion algorithms, there exists a quantum-secure signature scheme. We note\nthat the scheme in~\\cite{BDH11} is a promising (post-quantum) candidate to be\nimplemented in practice and our result further justifies it. Finally we\ndemonstrate the generality of our framework by showing that several existing\nworks (Full-Domain hash in the quantum random-oracle model~\\cite{Zha12ibe} and\nthe simple hybrid arguments framework in~\\cite{HSS11}) can be reformulated\nunder our unified framework."
    },
    {
        "date": "2014-09-07",
        "title": "Quantifying Privacy: A Novel Entropy-Based Measure of Disclosure Risk",
        "author": "Mousa Alfalayleh, and Ljiljana Brankovic",
        "link": "http://arxiv.org/abs/1409.2112v1",
        "abstract": "It is well recognised that data mining and statistical analysis pose a\nserious treat to privacy. This is true for financial, medical, criminal and\nmarketing research. Numerous techniques have been proposed to protect privacy,\nincluding restriction and data modification. Recently proposed privacy models\nsuch as differential privacy and k-anonymity received a lot of attention and\nfor the latter there are now several improvements of the original scheme, each\nremoving some security shortcomings of the previous one. However, the challenge\nlies in evaluating and comparing privacy provided by various techniques. In\nthis paper we propose a novel entropy based security measure that can be\napplied to any generalisation, restriction or data modification technique. We\nuse our measure to empirically evaluate and compare a few popular methods,\nnamely query restriction, sampling and noise addition."
    },
    {
        "date": "2014-09-05",
        "title": "On the Optimality of Keyless Authentication in a Noisy Model",
        "author": "Shaoquan Jiang",
        "link": "http://arxiv.org/abs/1409.1657v1",
        "abstract": "We further study the keyless authentication problem in a noisy model in our\nprevious work, where no secret setup is available for sender Alice and receiver\nBob while there is DMC $W_1$ from Alice to Bob and a two-way noiseless but\ninsecure channel between them. We propose a construction such that the message\nlength over DMC $W_1$ does not depend on the size of the source space. If the\nsource space is ${\\cal S}$ and the number of channel $W_1$ uses is $n$, then\nour protocol only has a round complexity of $\\log^*|{\\cal S}|-\\log^*n+4.$ In\naddition, we show that the round complexity of any secure protocol in our model\nis lower bounded by $\\log^*|{\\cal S}|-\\log^* n-5$. We also obtain a lower bound\non the success probability when the message size on DMC $W_1$ is given.\nFinally, we derive the capacity for a non-interactive authentication protocol\nunder general DMCs, which extends the result under BSCs in our previous work."
    },
    {
        "date": "2014-09-03",
        "title": "Citizen Electronic Identities using TPM 2.0",
        "author": "Thomas Nyman, Jan-Erik Ekberg, and N. Asokan",
        "link": "http://arxiv.org/abs/1409.1023v2",
        "abstract": "Electronic Identification (eID) is becoming commonplace in several European\ncountries. eID is typically used to authenticate to government e-services, but\nis also used for other services, such as public transit, e-banking, and\nphysical security access control. Typical eID tokens take the form of physical\nsmart cards, but successes in merging eID into phone operator SIM cards show\nthat eID tokens integrated into a personal device can offer better usability\ncompared to standalone tokens. At the same time, trusted hardware that enables\nsecure storage and isolated processing of sensitive data have become\ncommonplace both on PC platforms as well as mobile devices.\n  Some time ago, the Trusted Computing Group (TCG) released the version 2.0 of\nthe Trusted Platform Module (TPM) specification. We propose an eID architecture\nbased on the new, rich authorization model introduced in the TCGs TPM 2.0. The\ngoal of the design is to improve the overall security and usability compared to\ntraditional smart card-based solutions. We also provide, to the best our\nknowledge, the first accessible description of the TPM 2.0 authorization model."
    },
    {
        "date": "2014-09-02",
        "title": "Visual Passwords Using Automatic Lip Reading",
        "author": "Ahmad Basheer Hassanat",
        "link": "http://arxiv.org/abs/1409.0924v1",
        "abstract": "This paper presents a visual passwords system to increase security. The\nsystem depends mainly on recognizing the speaker using the visual speech signal\nalone. The proposed scheme works in two stages: setting the visual password\nstage and the verification stage. At the setting stage the visual passwords\nsystem request the user to utter a selected password, a video recording of the\nuser face is captured, and processed by a special words-based VSR system which\nextracts a sequence of feature vectors. In the verification stage, the same\nprocedure is executed, the features will be sent to be compared with the stored\nvisual password. The proposed scheme has been evaluated using a video database\nof 20 different speakers (10 females and 10 males), and 15 more males in\nanother video database with different experiment sets. The evaluation has\nproved the system feasibility, with average error rate in the range of 7.63% to\n20.51% at the worst tested scenario, and therefore, has potential to be a\npractical approach with the support of other conventional authentication\nmethods such as the use of usernames and passwords."
    },
    {
        "date": "2014-09-02",
        "title": "Verification of Information Flow Properties under Rational Observation",
        "author": "Béatrice Bérard, and John Mullins",
        "link": "http://arxiv.org/abs/1409.0871v1",
        "abstract": "Information flow properties express the capability for an agent to infer\ninformation about secret behaviours of a partially observable system. In a\nlanguage-theoretic setting, where the system behaviour is described by a\nlanguage, we define the class of rational information flow properties (RIFP),\nwhere observers are modeled by finite transducers, acting on languages in a\ngiven family $\\mathcal{L}$. This leads to a general decidability criterion for\nthe verification problem of RIFPs on $\\mathcal{L}$, implying\nPSPACE-completeness for this problem on regular languages. We show that most\ntrace-based information flow properties studied up to now are RIFPs, including\nthose related to selective declassification and conditional anonymity. As a\nconsequence, we retrieve several existing decidability results that were\nobtained by ad-hoc proofs."
    },
    {
        "date": "2014-09-02",
        "title": "A Supervisory Control Approach to Dynamic Cyber-Security",
        "author": "Mohammad Rasouli, Erik Miehling, and Demosthenis Teneketzis",
        "link": "http://arxiv.org/abs/1409.0838v2",
        "abstract": "An analytical approach for a dynamic cyber-security problem that captures\nprogressive attacks to a computer network is presented. We formulate the\ndynamic security problem from the defender's point of view as a supervisory\ncontrol problem with imperfect information, modeling the computer network's\noperation by a discrete event system. We consider a min-max performance\ncriterion and use dynamic programming to determine, within a restricted set of\npolicies, an optimal policy for the defender. We study and interpret the\nbehavior of this optimal policy as we vary certain parameters of the\nsupervisory control problem."
    },
    {
        "date": "2014-08-30",
        "title": "Multi-Use Multi-Secret Sharing Scheme for General Access Structure",
        "author": "Partha Sarathi Roy, and Avishek Adhikari",
        "link": "http://arxiv.org/abs/1409.0089v1",
        "abstract": "The main aim of this paper is to construct a multi-secret sharing scheme for\ngeneral access structure in a trusted dealer model using suitable hash function\nand Lagrange's interpolation method. Even though, the proposed scheme is a\nmulti-secret and multi-use one, each participant has to carry only one share.\nThe suitable use of collision resistant one way hash function makes the scheme\nefficient and multi-use. Moreover, the scheme has a nice property that secrets,\nparticipants or qualified sets of participants may be added to or even may be\nmade inactive dynamically by the dealer to get a new access structure without\naltering the shares of the existing participants in the old access structure.\nFinally, in the proposed scheme, both the combiner and the share holders can\nverify the correctness of the information that they are receiving from each\nother."
    },
    {
        "date": "2014-08-29",
        "title": "A Secure TFTP Protocol with Security Proofs",
        "author": "Mohd Anuar Mat Isa, Habibah Hashim, Syed Farid Syed Adnan, Jamalul-lail Ab Manan, and Ramlan Mahmod",
        "link": "http://arxiv.org/abs/1409.0060v1",
        "abstract": "Advances in smart devices has witnessed major developments in many mobile\napplications such as Android applications. These smart devices normally\ninterconnect to the internet using wireless technology and applications using\nthe TFTP protocol among these wireless devices are becoming commonplace. In\nthis work, we present an enhanced lightweight security protocol for smart\ndevice and server communications using Trivial File Transfer Protocol (TFTP).\nWe suggest the use of lightweight symmetric encryption for data encryption and\nasymmetric encryption for key exchange protocols in TFTP. The target\nimplementation of secure TFTP is for embedded devices such as Wi-Fi Access\nPoints (AP) and remote Base Stations (BS). In this paper we present the\nsecurity proofs based on an attack model (IND-CCA2) for securing TFTP protocol.\nWe also present the security reduction of SSW-ARQ protocol from Cramer-Shoup\nencryption scheme and fixed-time side channel security. We have also introduced\na novel adversary model in IND-CCA2-(SC-TA) and it is considered a practical\nmodel because the model incorporates the timing attack."
    },
    {
        "date": "2014-08-29",
        "title": "Factors Influencing the Quality of the User Experience in Ubiquitous Recommender Systems",
        "author": "Nikolaos Polatidis, and Christos K. Georgiadis",
        "link": "http://arxiv.org/abs/1408.6926v1",
        "abstract": "The use of mobile devices and the rapid growth of the internet and networking\ninfrastructure has brought the necessity of using Ubiquitous recommender\nsystems. However in mobile devices there are different factors that need to be\nconsidered in order to get more useful recommendations and increase the quality\nof the user experience. This paper gives an overview of the factors related to\nthe quality and proposes a new hybrid recommendation model."
    },
    {
        "date": "2014-08-28",
        "title": "The Barth-Boneh-Waters Private Broadcast Encryption Scheme Revisited",
        "author": "Zhengjun Cao, and Lihua Liu",
        "link": "http://arxiv.org/abs/1408.6610v1",
        "abstract": "The primitive of private broadcast encryption introduced by Barth, Boneh and\nWaters, is used to encrypt a message to several recipients while hiding the\nidentities of the recipients. In their construction, a recipient has to first\ndecrypt the received ciphertext to extract the verification key for one-time\nsignature. He then uses the verification key to check whether the ciphertext is\nmalformed. The authors did not consider that information delivered over a\nchannel, especially over a broadcast channel, should be authenticated as to its\norigin. We remark that the conventional public key signature suffices to\nauthenticate data origin and filter out all malformed ciphertexts. We also\ndiscuss the disadvantages of the primitive of one-time signature used in their\nconstruction."
    },
    {
        "date": "2014-08-26",
        "title": "A Public Key Cryptoscheme Using Bit-pairs and Probabilistic Mazes",
        "author": "Shenghui Su, Shuwang Lu, Maozhi Xu, and Tao Xie",
        "link": "http://arxiv.org/abs/1408.6226v3",
        "abstract": "This paper gives the definition and property of a bit-pair shadow, and\ndevises the three algorithms of a public key cryptoscheme called JUOAN that is\nbased on a multivariate permutation problem and an anomalous subset product\nproblem to which no subexponential time solutions are found so far, and regards\na bit-pair as a manipulation unit. The authors demonstrate that the decryption\nalgorithm is correct, deduce the probability that a plaintext solution is\nnonunique is nearly zero, analyze the security of the new cryptoscheme against\nextracting a private key from a public key and recovering a plaintext from a\nciphertext on the assumption that an integer factorization problem, a discrete\nlogarithm problem, and a low-density subset sum problem can be solved\nefficiently, and prove that the new cryptoscheme using random padding and\nrandom permutation is semantically secure. The analysis shows that the bit-pair\nmethod increases the density D of a related knapsack to a number more than 1,\nand decreases the modulus length lgM of the new cryptoscheme to 464, 544, or\n640."
    },
    {
        "date": "2014-08-26",
        "title": "Self-Adaptation and Secure Information Flow in Multiparty Structured Communications: A Unified Perspective",
        "author": "Ilaria Castellani, Mariangiola Dezani-Ciancaglini, and Jorge A. Pérez",
        "link": "http://arxiv.org/abs/1408.5978v1",
        "abstract": "We present initial results on a comprehensive model of structured\ncommunications, in which self- adaptation and security concerns are jointly\naddressed. More specifically, we propose a model of self-adaptive, multiparty\ncommunications with secure information flow guarantees. In this model, security\nviolations occur when processes attempt to read or write messages of\ninappropriate security levels within directed exchanges. Such violations\ntrigger adaptation mechanisms that prevent the violations to occur and/or to\npropagate their effect in the choreography. Our model is equipped with local\nand global mechanisms for reacting to security violations; type soundness\nresults ensure that global protocols are still correctly executed, while the\nsystem adapts itself to preserve security."
    },
    {
        "date": "2014-08-20",
        "title": "On Topological Properties of Wireless Sensor Networks under the q-Composite Key Predistribution Scheme with On/Off Channels",
        "author": "Jun Zhao, Osman Yağan, and Virgil Gligor",
        "link": "http://arxiv.org/abs/1408.5082v1",
        "abstract": "The q-composite key predistribution scheme [1] is used prevalently for secure\ncommunications in large-scale wireless sensor networks (WSNs). Prior work\n[2]-[4] explores topological properties of WSNs employing the q-composite\nscheme for q = 1 with unreliable communication links modeled as independent\non/off channels. In this paper, we investigate topological properties related\nto the node degree in WSNs operating under the q-composite scheme and the\non/off channel model. Our results apply to general q and are stronger than\nthose reported for the node degree in prior work even for the case of q being\n1. Specifically, we show that the number of nodes with certain degree\nasymptotically converges in distribution to a Poisson random variable, present\nthe asymptotic probability distribution for the minimum degree of the network,\nand establish the asymptotically exact probability for the property that the\nminimum degree is at least an arbitrary value. Numerical experiments confirm\nthe validity of our analytical findings."
    },
    {
        "date": "2014-08-17",
        "title": "Verifiable Member and Order Queries on a List in Zero-Knowledge",
        "author": "Esha Ghosh, Olga Ohrimenko, and Roberto Tamassia",
        "link": "http://arxiv.org/abs/1408.3843v1",
        "abstract": "We introduce a formal model for order queries on lists in zero knowledge in\nthe traditional authenticated data structure model. We call this model\nPrivacy-Preserving Authenticated List (PPAL). In this model, the queries are\nperformed on the list stored in the (untrusted) cloud where data integrity and\nprivacy have to be maintained. To realize an efficient authenticated data\nstructure, we first adapt consistent data query model. To this end we introduce\na formal model called Zero-Knowledge List (ZKL) scheme which generalizes\nconsistent membership queries in zero-knowledge to consistent membership and\norder queries on a totally ordered set in zero knowledge. We present a\nconstruction of ZKL based on zero-knowledge set and homomorphic integer\ncommitment scheme. Then we discuss why this construction is not as efficient as\ndesired in cloud applications and present an efficient construction of PPAL\nbased on bilinear accumulators and bilinear maps which is provably secure and\nzero-knowledge."
    },
    {
        "date": "2014-08-14",
        "title": "On the Role of Identity in Surveillance",
        "author": "Victoria Wang, and John V. Tucker",
        "link": "http://arxiv.org/abs/1408.3438v1",
        "abstract": "Surveillance is a process that observes behaviour, recognises properties and\nidentifies individuals. It has become a commonplace phenomenon in our everyday\nlife. Many surveillance practices depend on the use of advanced technologies to\ncollect, store and process data. We propose (i) an abstract definition of\nsurveillance; and (ii) an abstract definition of identity, designed to capture\nthe common structure of many disparate surveillance situations. We argue that\nthe notion of identity is fundamental to surveillance. Rather than having a\nsingle identity, individuals have many identities, real and virtual, that are\nused in different aspects of their lives. Most aspects of life are subject to\nsome form of surveillance, and observations and identities can be aggregated.\nThe notion of identity needs to be theorised. Our analysis is very general and,\nat the same time, sufficiently precise to be the basis of mathematical models."
    },
    {
        "date": "2014-08-08",
        "title": "An Evasion and Counter-Evasion Study in Malicious Websites Detection",
        "author": "Li Xu, Zhenxin Zhan, Shouhuai Xu, and Keyin Ye",
        "link": "http://arxiv.org/abs/1408.1993v1",
        "abstract": "Malicious websites are a major cyber attack vector, and effective detection\nof them is an important cyber defense task. The main defense paradigm in this\nregard is that the defender uses some kind of machine learning algorithms to\ntrain a detection model, which is then used to classify websites in question.\nUnlike other settings, the following issue is inherent to the problem of\nmalicious websites detection: the attacker essentially has access to the same\ndata that the defender uses to train its detection models. This 'symmetry' can\nbe exploited by the attacker, at least in principle, to evade the defender's\ndetection models. In this paper, we present a framework for characterizing the\nevasion and counter-evasion interactions between the attacker and the defender,\nwhere the attacker attempts to evade the defender's detection models by taking\nadvantage of this symmetry. Within this framework, we show that an adaptive\nattacker can make malicious websites evade powerful detection models, but\nproactive training can be an effective counter-evasion defense mechanism. The\nframework is geared toward the popular detection model of decision tree, but\ncan be adapted to accommodate other classifiers."
    },
    {
        "date": "2014-08-05",
        "title": "DTKI: a new formalized PKI with no trusted parties",
        "author": "Jiangshan Yu, Vincent Cheval, and Mark Ryan",
        "link": "http://arxiv.org/abs/1408.1023v6",
        "abstract": "The security of public key validation protocols for web-based applications\nhas recently attracted attention because of weaknesses in the certificate\nauthority model, and consequent attacks.\n  Recent proposals using public logs have succeeded in making certificate\nmanagement more transparent and verifiable. However, those proposals involve a\nfixed set of authorities. This means an oligopoly is created. Another problem\nwith current log-based system is their heavy reliance on trusted parties that\nmonitor the logs.\n  We propose a distributed transparent key infrastructure (DTKI), which greatly\nreduces the oligopoly of service providers and allows verification of the\nbehaviour of trusted parties. In addition, this paper formalises the public log\ndata structure and provides a formal analysis of the security that DTKI\nguarantees."
    },
    {
        "date": "2014-08-04",
        "title": "Advanced reversible Data Hiding With Encrypted Data",
        "author": "Shilpa Sreekumar, and Vincy Salam",
        "link": "http://arxiv.org/abs/1408.0733v1",
        "abstract": "The advanced RDH work focuses on both data encryption and image encryption\nwhich makes it more secure and free of errors. All previous methods embed data\nwithout encrypting the data which may subject to errors on the data extraction\nor image recovery. The proposed work provides a novel RDH scheme in which both\ndata and image can be encrypted and extracted reversibly without any errors. In\nthe proposed work, data extraction and image recovery are free of any errors.\nThe PSNR is significantly improved in the proposed work. This advanced work\nalso performs data hiding in videos."
    },
    {
        "date": "2014-08-02",
        "title": "RiPKI: The Tragic Story of RPKI Deployment in the Web Ecosystem",
        "author": "Matthias Wählisch, Robert Schmidt, Thomas C. Schmidt, Olaf Maennel, Steve Uhlig, and Gareth Tyson",
        "link": "http://arxiv.org/abs/1408.0391v3",
        "abstract": "Web content delivery is one of the most important services on the Internet.\nAccess to websites is typically secured via TLS. However, this security model\ndoes not account for prefix hijacking on the network layer, which may lead to\ntraffic blackholing or transparent interception. Thus, to achieve comprehensive\nsecurity and service availability, additional protective mechanisms are\nnecessary such as the RPKI, a recently deployed Resource Public Key\nInfrastructure to prevent hijacking of traffic by networks. This paper argues\ntwo positions. First, that modern web hosting practices make route protection\nchallenging due to the propensity to spread servers across many different\nnetworks, often with unpredictable client redirection strategies, and, second,\nthat we need a better understanding why protection mechanisms are not deployed.\nTo initiate this, we empirically explore the relationship between web hosting\ninfrastructure and RPKI deployment. Perversely, we find that less popular\nwebsites are more likely to be secured than the prominent sites. Worryingly, we\nfind many large-scale CDNs do not support RPKI, thus making their customers\nvulnerable. This leads us to explore business reasons why operators are\nhesitant to deploy RPKI, which may help to guide future research on improving\nInternet security."
    },
    {
        "date": "2014-07-31",
        "title": "Strategic Evolution of Adversaries Against Temporal Platform Diversity Active Cyber Defenses",
        "author": "Michael L. Winterrose, and Kevin M. Carter",
        "link": "http://arxiv.org/abs/1408.0023v1",
        "abstract": "Adversarial dynamics are a critical facet within the cyber security domain,\nin which there exists a co-evolution between attackers and defenders in any\ngiven threat scenario. While defenders leverage capabilities to minimize the\npotential impact of an attack, the adversary is simultaneously developing\ncountermeasures to the observed defenses. In this study, we develop a set of\ntools to model the adaptive strategy formulation of an intelligent actor\nagainst an active cyber defensive system. We encode strategies as binary\nchromosomes representing finite state machines that evolve according to\nHolland's genetic algorithm. We study the strategic considerations including\noverall actor reward balanced against the complexity of the determined\nstrategies. We present a series of simulation results demonstrating the ability\nto automatically search a large strategy space for optimal resultant fitness\nagainst a variety of counter-strategies."
    },
    {
        "date": "2014-07-31",
        "title": "Adaptive Attacker Strategy Development Against Moving Target Cyber Defenses",
        "author": "M. L. Winterrose, K. M. Carter, N. Wagner, and W. W. Streilein",
        "link": "http://arxiv.org/abs/1407.8540v1",
        "abstract": "A model of strategy formulation is used to study how an adaptive attacker\nlearns to overcome a moving target cyber defense. The attacker-defender\ninteraction is modeled as a game in which a defender deploys a temporal\nplatform migration defense. Against this defense, a population of attackers\ndevelop strategies specifying the temporal ordering of resource investments\nthat bring targeted zero-day exploits into existence. Attacker response to two\ndefender temporal platform migration scheduling policies are examined. In the\nfirst defender scheduling policy, the defender selects the active platform in\neach match uniformly at random from a pool of available platforms. In the\nsecond policy the defender schedules each successive platform to maximize the\ndiversity of the source code presented to the attacker. Adaptive attacker\nresponse strategies are modeled by finite state machine (FSM) constructs that\nevolve during simulated play against defender strategies via an evolutionary\nalgorithm. It is demonstrated that the attacker learns to invest heavily in\nexploit creation for the platform with the least similarity to other platforms\nwhen faced with a diversity defense, while avoiding investment in exploits for\nthis least similar platform when facing a randomization defense. Additionally,\nit is demonstrated that the diversity-maximizing defense is superior for\nshorter duration attacker-defender engagements, but performs sub-optimally in\nextended attacker-defender interactions."
    },
    {
        "date": "2014-07-29",
        "title": "Caching and Auditing in the RPPM Model",
        "author": "Jason Crampton, and James Sellwood",
        "link": "http://arxiv.org/abs/1407.7841v3",
        "abstract": "Crampton and Sellwood recently introduced a variant of relationship-based\naccess control based on the concepts of relationships, paths and principal\nmatching, to which we will refer as the RPPM model. In this paper, we show that\nthe RPPM model can be extended to provide support for caching of authorization\ndecisions and enforcement of separation of duty policies. We show that these\nextensions are natural and powerful. Indeed, caching provides far greater\nadvantages in RPPM than it does in most other access control models and we are\nable to support a wide range of separation of duty policies."
    },
    {
        "date": "2014-07-28",
        "title": "Secure aggregation of distributed information: How a team of agents can safely share secrets in front of a spy",
        "author": "David Fernández-Duque, and Valentin Goranko",
        "link": "http://arxiv.org/abs/1407.7582v3",
        "abstract": "We consider the generic problem of Secure Aggregation of Distributed\nInformation (SADI), where several agents acting as a team have information\ndistributed among them, modeled by means of a publicly known deck of cards\ndistributed among the agents, so that each of them knows only her cards. The\nagents have to exchange and aggregate the information about how the cards are\ndistributed among them by means of public announcements over insecure\ncommunication channels, intercepted by an adversary \"eavesdropper\", in such a\nway that the adversary does not learn who holds any of the cards. We present a\ncombinatorial construction of protocols that provides a direct solution of a\nclass of SADI problems and develop a technique of iterated reduction of SADI\nproblems to smaller ones which are eventually solvable directly. We show that\nour methods provide a solution to a large class of SADI problems, including all\nSADI problems with sufficiently large size and sufficiently balanced card\ndistributions."
    },
    {
        "date": "2014-07-25",
        "title": "RAPPOR: Randomized Aggregatable Privacy-Preserving Ordinal Response",
        "author": "Úlfar Erlingsson, Vasyl Pihur, and Aleksandra Korolova",
        "link": "http://arxiv.org/abs/1407.6981v2",
        "abstract": "Randomized Aggregatable Privacy-Preserving Ordinal Response, or RAPPOR, is a\ntechnology for crowdsourcing statistics from end-user client software,\nanonymously, with strong privacy guarantees. In short, RAPPORs allow the forest\nof client data to be studied, without permitting the possibility of looking at\nindividual trees. By applying randomized response in a novel manner, RAPPOR\nprovides the mechanisms for such collection as well as for efficient,\nhigh-utility analysis of the collected data. In particular, RAPPOR permits\nstatistics to be collected on the population of client-side strings with strong\nprivacy guarantees for each client, and without linkability of their reports.\nThis paper describes and motivates RAPPOR, details its differential-privacy and\nutility guarantees, discusses its practical deployment and properties in the\nface of different attack models, and, finally, gives results of its application\nto both synthetic and real-world data."
    },
    {
        "date": "2014-07-24",
        "title": "Providing better confidentiality and authentication on the Internet using Namecoin and MinimaLT",
        "author": "Frederic Jacobs",
        "link": "http://arxiv.org/abs/1407.6453v1",
        "abstract": "In this paper, we introduce a duo of improvements for the Internet that would\nlead to better security. The authentication model on the Internet is broken and\nTLS connections have a considerable overhead. We try to address those issues\nwith changes in both the application layer, discussing a replacement for the\nDNS system, and in the transport layer, a drop-in replacement for TCP built on\ntop of UDP so that it can run on today's internet infrastructure."
    },
    {
        "date": "2014-07-21",
        "title": "Composing security protocols: from confidentiality to privacy",
        "author": "Myrto Arapinis, Vincent Cheval, and Stéphanie Delaune",
        "link": "http://arxiv.org/abs/1407.5444v3",
        "abstract": "Security protocols are used in many of our daily-life applications, and our\nprivacy largely depends on their design. Formal verification techniques have\nproved their usefulness to analyse these protocols, but they become so complex\nthat modular techniques have to be developed. We propose several results to\nsafely compose security protocols. We consider arbitrary primitives modeled\nusing an equational theory, and a rich process algebra close to the applied pi\ncalculus.\n  Relying on these composition results, we are able to derive some security\nproperties on a protocol from the security analysis performed on each\nsub-protocol individually. We consider parallel composition and the case of\nkey-exchange protocols. Our results apply to deal with confidentiality but also\nprivacy-type properties (e.g. anonymity, unlinkability) expressed using a\nnotion of equivalence. We illustrate the usefulness of our composition results\non protocols from the 3G phone application and electronic passport."
    },
    {
        "date": "2014-07-21",
        "title": "Privacy-Preserving Important Passage Retrieval",
        "author": "Luis Marujo, José Portêlo, David Martins de Matos, João P. Neto, Anatole Gershman, Jaime Carbonell, Isabel Trancoso, and Bhiksha Raj",
        "link": "http://arxiv.org/abs/1407.5416v1",
        "abstract": "State-of-the-art important passage retrieval methods obtain very good\nresults, but do not take into account privacy issues. In this paper, we present\na privacy preserving method that relies on creating secure representations of\ndocuments. Our approach allows for third parties to retrieve important passages\nfrom documents without learning anything regarding their content. We use a\nhashing scheme known as Secure Binary Embeddings to convert a key phrase and\nbag-of-words representation to bit strings in a way that allows the computation\nof approximate distances, instead of exact ones. Experiments show that our\nsecure system yield similar results to its non-private counterpart on both\nclean text and noisy speech recognized text."
    },
    {
        "date": "2014-07-21",
        "title": "An Empirical Study on Android for Saving Non-shared Data on Public Storage",
        "author": "Xiangyu Liu, Zhe Zhou, Wenrui Diao, Zhou Li, and Kehuan Zhang",
        "link": "http://arxiv.org/abs/1407.5410v3",
        "abstract": "With millions of apps that can be downloaded from official or third-party\nmarket, Android has become one of the most popular mobile platforms today.\nThese apps help people in all kinds of ways and thus have access to lots of\nuser's data that in general fall into three categories: sensitive data, data to\nbe shared with other apps, and non-sensitive data not to be shared with others.\nFor the first and second type of data, Android has provided very good storage\nmodels: an app's private sensitive data are saved to its private folder that\ncan only be access by the app itself, and the data to be shared are saved to\npublic storage (either the external SD card or the emulated SD card area on\ninternal FLASH memory). But for the last type, i.e., an app's non-sensitive and\nnon-shared data, there is a big problem in Android's current storage model\nwhich essentially encourages an app to save its non-sensitive data to shared\npublic storage that can be accessed by other apps. At first glance, it seems no\nproblem to do so, as those data are non-sensitive after all, but it implicitly\nassumes that app developers could correctly identify all sensitive data and\nprevent all possible information leakage from private-but-non-sensitive data.\nIn this paper, we will demonstrate that this is an invalid assumption with a\nthorough survey on information leaks of those apps that had followed Android's\nrecommended storage model for non-sensitive data. Our studies showed that\nhighly sensitive information from billions of users can be easily hacked by\nexploiting the mentioned problematic storage model. Although our empirical\nstudies are based on a limited set of apps, the identified problems are never\nisolated or accidental bugs of those apps being investigated. On the contrary,\nthe problem is rooted from the vulnerable storage model recommended by Android.\nTo mitigate the threat, we also propose a defense framework."
    },
    {
        "date": "2014-07-18",
        "title": "Your Voice Assistant is Mine: How to Abuse Speakers to Steal Information and Control Your Phone",
        "author": "Wenrui Diao, Xiangyu Liu, Zhe Zhou, and Kehuan Zhang",
        "link": "http://arxiv.org/abs/1407.4923v1",
        "abstract": "Previous research about sensor based attacks on Android platform focused\nmainly on accessing or controlling over sensitive device components, such as\ncamera, microphone and GPS. These approaches get data from sensors directly and\nneed corresponding sensor invoking permissions.\n  This paper presents a novel approach (GVS-Attack) to launch permission\nbypassing attacks from a zero permission Android application (VoicEmployer)\nthrough the speaker. The idea of GVS-Attack utilizes an Android system built-in\nvoice assistant module -- Google Voice Search. Through Android Intent\nmechanism, VoicEmployer triggers Google Voice Search to the foreground, and\nthen plays prepared audio files (like \"call number 1234 5678\") in the\nbackground. Google Voice Search can recognize this voice command and execute\ncorresponding operations. With ingenious designs, our GVS-Attack can forge\nSMS/Email, access privacy information, transmit sensitive data and achieve\nremote control without any permission.\n  Also we found a vulnerability of status checking in Google Search app, which\ncan be utilized by GVS-Attack to dial arbitrary numbers even when the phone is\nsecurely locked with password. A prototype of VoicEmployer has been implemented\nto demonstrate the feasibility of GVS-Attack in real world. In theory, nearly\nall Android devices equipped with Google Services Framework can be affected by\nGVS-Attack. This study may inspire application developers and researchers\nrethink that zero permission doesn't mean safety and the speaker can be treated\nas a new attack surface."
    },
    {
        "date": "2014-07-10",
        "title": "Learning Privately with Labeled and Unlabeled Examples",
        "author": "Amos Beimel, Kobbi Nissim, and Uri Stemmer",
        "link": "http://arxiv.org/abs/1407.2662v3",
        "abstract": "A private learner is an algorithm that given a sample of labeled individual\nexamples outputs a generalizing hypothesis while preserving the privacy of each\nindividual. In 2008, Kasiviswanathan et al. (FOCS 2008) gave a generic\nconstruction of private learners, in which the sample complexity is (generally)\nhigher than what is needed for non-private learners. This gap in the sample\ncomplexity was then further studied in several followup papers, showing that\n(at least in some cases) this gap is unavoidable. Moreover, those papers\nconsidered ways to overcome the gap, by relaxing either the privacy or the\nlearning guarantees of the learner.\n  We suggest an alternative approach, inspired by the (non-private) models of\nsemi-supervised learning and active-learning, where the focus is on the sample\ncomplexity of labeled examples whereas unlabeled examples are of a\nsignificantly lower cost. We consider private semi-supervised learners that\noperate on a random sample, where only a (hopefully small) portion of this\nsample is labeled. The learners have no control over which of the sample\nelements are labeled. Our main result is that the labeled sample complexity of\nprivate learners is characterized by the VC dimension.\n  We present two generic constructions of private semi-supervised learners. The\nfirst construction is of learners where the labeled sample complexity is\nproportional to the VC dimension of the concept class, however, the unlabeled\nsample complexity of the algorithm is as big as the representation length of\ndomain elements. Our second construction presents a new technique for\ndecreasing the labeled sample complexity of a given private learner, while\nroughly maintaining its unlabeled sample complexity. In addition, we show that\nin some settings the labeled sample complexity does not depend on the privacy\nparameters of the learner."
    },
    {
        "date": "2014-07-09",
        "title": "Designing and implementing the logical security framework for e-commerce based on service oriented architecture",
        "author": "Ashish Kr. Luhach, Sanjay K Dwivedi, and C K Jha",
        "link": "http://arxiv.org/abs/1407.2421v1",
        "abstract": "Rapid evolution of information technology has contributed to the evolution of\nmore sophisticated E- commerce system with the better transaction time and\nprotection. The currently used E-commerce models lack in quality properties\nsuch as logical security because of their poor designing and to face the highly\nequipped and trained intruders. This editorial proposed a security framework\nfor small and medium sized E-commerce, based on service oriented architecture\nand gives an analysis of the eminent security attacks which can be averted. The\nproposed security framework will be implemented and validated on an open source\nE-commerce, and the results achieved so far are also presented."
    },
    {
        "date": "2014-07-03",
        "title": "Acoustic Fingerprinting Revisited: Generate Stable Device ID Stealthy with Inaudible Sound",
        "author": "Zhe Zhou, Wenrui Diao, Xiangyu Liu, and Kehuan Zhang",
        "link": "http://arxiv.org/abs/1407.0803v1",
        "abstract": "The popularity of mobile device has made people's lives more convenient, but\nthreatened people's privacy at the same time. As end users are becoming more\nand more concerned on the protection of their private information, it is even\nharder to track a specific user using conventional technologies. For example,\ncookies might be cleared by users regularly. Apple has stopped apps accessing\nUDIDs, and Android phones use some special permission to protect IMEI code. To\naddress this challenge, some recent studies have worked on tracing smart phones\nusing the hardware features resulted from the imperfect manufacturing process.\nThese works have demonstrated that different devices can be differentiated to\neach other. However, it still has a long way to go in order to replace cookie\nand be deployed in real world scenarios, especially in terms of properties like\nuniqueness, robustness, etc. In this paper, we presented a novel method to\ngenerate stable and unique device ID stealthy for smartphones by exploiting the\nfrequency response of the speaker. With carefully selected audio frequencies\nand special sound wave patterns, we can reduce the impacts of non-linear\neffects and noises, and keep our feature extraction process un-noticeable to\nusers. The extracted feature is not only very stable for a given smart phone\nspeaker, but also unique to that phone. The feature contains rich information\nthat is equivalent to around 40 bits of entropy, which is enough to identify\nbillions of different smart phones of the same model. We have built a prototype\nto evaluate our method, and the results show that the generated device ID can\nbe used as a replacement of cookie."
    },
    {
        "date": "2014-07-01",
        "title": "A New Path to Construct Parametric Orientation Field: Sparse FOMFE Model and Compressed Sparse FOMFE Model",
        "author": "Jinwei Xu, Jiankun Hu, and Xiuping Jia",
        "link": "http://arxiv.org/abs/1407.0342v1",
        "abstract": "Orientation field, representing the fingerprint ridge structure direction,\nplays a crucial role in fingerprint-related image processing tasks. Orientation\nfield is able to be constructed by either non-parametric or parametric methods.\nIn this paper, the advantages and disadvantages regarding to the existing\nnon-parametric and parametric approaches are briefly summarized. With the\nfurther investigation for constructing the orientation field by parametric\ntechnique, two new models - sparse FOMFE model and compressed sparse FOMFE\nmodel are introduced, based on the rapidly developing signal sparse\nrepresentation and compressed sensing theories. The experiments on high-quality\nfingerprint image dataset (plain and rolled print) and poor-quality fingerprint\nimage dataset (latent print) demonstrate their feasibilities to construct the\norientation field in a sparse or even compressed sparse mode. The comparisons\namong the state-of-art orientation field modeling approaches show that the\nproposed two models have the potential availability in big data-oriented\nfingerprint indexing tasks."
    },
    {
        "date": "2014-06-27",
        "title": "Evolution and Detection of Polymorphic and Metamorphic Malwares: A Survey",
        "author": "Ashu Sharma, and S. K. Sahay",
        "link": "http://arxiv.org/abs/1406.7061v2",
        "abstract": "Malwares are big threat to digital world and evolving with high complexity.\nIt can penetrate networks, steal confidential information from computers, bring\ndown servers and can cripple infrastructures etc. To combat the threat/attacks\nfrom the malwares, anti- malwares have been developed. The existing\nanti-malwares are mostly based on the assumption that the malware structure\ndoes not changes appreciably. But the recent advancement in second generation\nmalwares can create variants and hence posed a challenge to anti-malwares\ndevelopers. To combat the threat/attacks from the second generation malwares\nwith low false alarm we present our survey on malwares and its detection\ntechniques."
    },
    {
        "date": "2014-06-25",
        "title": "Extract Secrets from Wireless Channel: A New Shape-based Approach",
        "author": "Yue Qiao, Kannan Srinivasan, and Anish Arora",
        "link": "http://arxiv.org/abs/1406.6647v2",
        "abstract": "Existing secret key extraction techniques use quantization to map wireless\nchannel amplitudes to secret bits. This pa- per shows that such techniques are\nhighly prone to environ- ment and local noise effects: They have very high\nmismatch rates between the two nodes that measure the channel be- tween them.\nThis paper advocates using the shape of the channel instead of the size (or\namplitude) of the channel. It shows that this new paradigm shift is\nsignificantly ro- bust against environmental and local noises. We refer to this\nshape-based technique as Puzzle. Implementation in a software-defined radio\n(SDR) platform demonstrates that Puzzle has a 63% reduction in bit mismatch\nrate than the state-of-art frequency domain approach (CSI-2bit). Exper- iments\nalso show that unlike the state-of-the-art received signal strength (RSS)-based\nmethods like ASBG, Puzzle is robust against an attack in which an eavesdropper\ncan pre- dict the secret bits using planned movements."
    },
    {
        "date": "2014-06-22",
        "title": "Hybrid Epidemics - A Case Study on Computer Worm Conficker",
        "author": "Changwang Zhang, Shi Zhou, and Benjamin M. Chain",
        "link": "http://arxiv.org/abs/1406.6046v3",
        "abstract": "Conficker is a computer worm that erupted on the Internet in 2008. It is\nunique in combining three different spreading strategies: local probing,\nneighbourhood probing, and global probing. We propose a mathematical model that\ncombines three modes of spreading, local, neighbourhood and global to capture\nthe worm's spreading behaviour. The parameters of the model are inferred\ndirectly from network data obtained during the first day of the Conifcker\nepidemic. The model is then used to explore the trade-off between spreading\nmodes in determining the worm's effectiveness. Our results show that the\nConficker epidemic is an example of a critically hybrid epidemic, in which the\ndifferent modes of spreading in isolation do not lead to successful epidemics.\nSuch hybrid spreading strategies may be used beneficially to provide the most\neffective strategies for promulgating information across a large population.\nWhen used maliciously, however, they can present a dangerous challenge to\ncurrent internet security protocols."
    },
    {
        "date": "2014-06-22",
        "title": "Publicly Verifiable Outsourced Computation with a Key Distribution Centre",
        "author": "James Alderman, Carlos Cid, Jason Crampton, and Christian Janson",
        "link": "http://arxiv.org/abs/1406.5720v1",
        "abstract": "The combination of software-as-a-service and the increasing use of mobile\ndevices gives rise to a considerable difference in computational power between\nservers and clients. Thus, there is a desire for clients to outsource the\nevaluation of complex functions to a server and to be able to verify that the\nresulting value is correct. Previous work in this area of Publicly Verifiable\nOutsourced Computation (PVC) requires a costly pre-processing stage. However,\nin many practical situations multiple clients will be interested in the same\nset of core functions and will make use of the same servers. Thus, the\npre-processing phase may be performed many more times than is necessary. In\nthis paper we introduce a Key Distribution Center (KDC) that handles the\ngeneration and distribution of the keys that are required to support PVC,\nthereby eliminating this redundancy. We define a number of new security models\nand functionalities that arise with the introduction of the KDC, and present a\nconstruction of such a scheme built upon Key-Policy Attribute-based Encryption."
    },
    {
        "date": "2014-06-21",
        "title": "On the Reverse Engineering of the Citadel Botnet",
        "author": "Ashkan Rahimian, Raha Ziarati, Stere Preda, and Mourad Debbabi",
        "link": "http://arxiv.org/abs/1406.5569v1",
        "abstract": "Citadel is an advanced information-stealing malware which targets financial\ninformation. This malware poses a real threat against the confidentiality and\nintegrity of personal and business data. A joint operation was recently\nconducted by the FBI and the Microsoft Digital Crimes Unit in order to take\ndown Citadel command-and-control servers. The operation caused some disruption\nin the botnet but has not stopped it completely. Due to the complex structure\nand advanced anti-reverse engineering techniques, the Citadel malware analysis\nprocess is both challenging and time-consuming. This allows cyber criminals to\ncarry on with their attacks while the analysis is still in progress. In this\npaper, we present the results of the Citadel reverse engineering and provide\nadditional insight into the functionality, inner workings, and open source\ncomponents of the malware. In order to accelerate the reverse engineering\nprocess, we propose a clone-based analysis methodology. Citadel is an offspring\nof a previously analyzed malware called Zeus; thus, using the former as a\nreference, we can measure and quantify the similarities and differences of the\nnew variant. Two types of code analysis techniques are provided in the\nmethodology, namely assembly to source code matching and binary clone\ndetection. The methodology can help reduce the number of functions requiring\nmanual analysis. The analysis results prove that the approach is promising in\nCitadel malware analysis. Furthermore, the same approach is applicable to\nsimilar malware analysis scenarios."
    },
    {
        "date": "2014-06-19",
        "title": "Path Conditions and Principal Matching: A New Approach to Access Control",
        "author": "Jason Crampton, and James Sellwood",
        "link": "http://arxiv.org/abs/1406.4988v1",
        "abstract": "Traditional authorization policies are user-centric, in the sense that\nauthorization is defined, ultimately, in terms of user identities. We believe\nthat this user-centric approach is inappropriate for many applications, and\nthat what should determine authorization is the relationships that exist\nbetween entities in the system. While recent research has considered the\npossibility of specifying authorization policies based on the relationships\nthat exist between peers in social networks, we are not aware of the\napplication of these ideas to general computing systems. We develop a formal\naccess control model that makes use of ideas from relationship-based access\ncontrol and a two-stage method for evaluating policies. Our policies are\ndefined using path conditions, which are similar to regular expressions. We\ndefine semantics for path conditions, which we use to develop a rigorous method\nfor evaluating policies. We describe the algorithm required to evaluate\npolicies and establish its complexity. Finally, we illustrate the advantages of\nour model using an example and describe a preliminary implementation of our\nalgorithm."
    },
    {
        "date": "2014-06-17",
        "title": "Classification of Attacks in Wireless Sensor Networks",
        "author": "Mohamed-Lamine Messai",
        "link": "http://arxiv.org/abs/1406.4516v2",
        "abstract": "In wireless sensor networks (WSNs), security has a vital importance.\nRecently, there was a huge interest to propose security solutions in WSNs\nbecause of their applications in both civilian and military domains.\nAdversaries can launch different types of attacks, and cryptography is used to\ncountering these attacks. This paper presents challenges of security and a\nclassification of the different possible attacks in WSNs. The problems of\nsecurity in each layer of the network's OSI model are discussed."
    },
    {
        "date": "2014-06-17",
        "title": "C-sanitized: a privacy model for document redaction and sanitization",
        "author": "David Sanchez, and Montserrat Batet",
        "link": "http://arxiv.org/abs/1406.4285v2",
        "abstract": "Within the current context of Information Societies, large amounts of\ninformation are daily exchanged and/or released. The sensitive nature of much\nof this information causes a serious privacy threat when documents are\nuncontrollably made available to untrusted third parties. In such cases,\nappropriate data protection measures should be undertaken by the responsible\norganization, especially under the umbrella of current legislations on data\nprivacy. To do so, human experts are usually requested to redact or sanitize\ndocument contents. To relieve this burdensome task, this paper presents a\nprivacy model for document redaction/sanitization, which offers several\nadvantages over other models available in the literature. Based on the\nwell-established foundations of data semantics and the information theory, our\nmodel provides a framework to develop and implement automated and inherently\nsemantic redaction/sanitization tools. Moreover, contrary to ad-hoc redaction\nmethods, our proposal provides a priori privacy guarantees which can be\nintuitively defined according to current legislations on data privacy.\nEmpirical tests performed within the context of several use cases illustrate\nthe applicability of our model and its ability to mimic the reasoning of human\nsanitizers."
    },
    {
        "date": "2014-06-11",
        "title": "Improved Secure Address Resolution Protocol",
        "author": "Abhishek Samvedi, Sparsh Owlak, and Vijay Kumar Chaurasia",
        "link": "http://arxiv.org/abs/1406.2930v1",
        "abstract": "In this paper, an improved secure address resolution protocol is presented\nwhere ARP spoofing attack is prevented. The proposed methodology is a\ncentralised methodology for preventing ARP spoofing attack. In the proposed\nmodel there is a central server on a network or subnet which prevents ARP\nspoofing attack."
    },
    {
        "date": "2014-06-11",
        "title": "A new approach for formal behavioral modeling of protection services in antivirus systems",
        "author": "Monire Norouzi, Saeed Parsa, and Ali Mahjur",
        "link": "http://arxiv.org/abs/1406.2791v1",
        "abstract": "Formal method techniques provides a suitable platform for the software\ndevelopment in software systems. Formal methods and formal verification is\nnecessary to prove the correctness and improve performance of software systems\nin various levels of design and implementation, too. Security Discussion is an\nimportant issue in computer systems. Since the antivirus applications have very\nimportant role in computer systems security, verifying these applications is\nvery essential and necessary. In this paper, we present four new approaches for\nantivirus system behavior and a behavioral model of protection services in the\nantivirus system is proposed. We divided the behavioral model in to preventive\nbehavior and control behavior and then we formal these behaviors. Finally by\nusing some definitions we explain the way these behaviors are mapped on each\nother by using our new approaches."
    },
    {
        "date": "2014-06-03",
        "title": "Subspace Methods for Data Attack on State Estimation: A Data Driven Approach",
        "author": "Jinsub Kim, Lang Tong, and Robert J. Thomas",
        "link": "http://arxiv.org/abs/1406.0866v1",
        "abstract": "Data attacks on state estimation modify part of system measurements such that\nthe tempered measurements cause incorrect system state estimates. Attack\ntechniques proposed in the literature often require detailed knowledge of\nsystem parameters. Such information is difficult to acquire in practice. The\nsubspace methods presented in this paper, on the other hand, learn the system\noperating subspace from measurements and launch attacks accordingly. Conditions\nfor the existence of an unobservable subspace attack are obtained under the\nfull and partial measurement models. Using the estimated system subspace, two\nattack strategies are presented. The first strategy aims to affect the system\nstate directly by hiding the attack vector in the system subspace. The second\nstrategy misleads the bad data detection mechanism so that data not under\nattack are removed. Performance of these attacks are evaluated using the IEEE\n14-bus network and the IEEE 118-bus network."
    },
    {
        "date": "2014-05-30",
        "title": "ROMEO: ReputatiOn Model Enhancing OpenID Simulator",
        "author": "Ginés Dólera Tormo, Félix Gómez Mármol, and Gregorio Martínez Pérez",
        "link": "http://arxiv.org/abs/1405.7831v1",
        "abstract": "OpenID is a standard decentralized initiative aimed at allowing Internet\nusers to use the same personal account to access different services. Since it\ndoes not rely on any central authority, it is hard for such users or other\nentities to validate the trust level of each entity deployed in the system.\nSome research has been conducted to handle this issue, defining a reputation\nframework to determine the trust level of a relying party based on past\nexperiences. However, this framework has been proposed in a theoretical way and\nsome deeper analysis and validation is still missing. Our main contribution in\nthis paper consist of a simulation environment able to validate the feasibility\nof the reputation framework and analyze its behaviour within different\nscenarios."
    },
    {
        "date": "2014-05-27",
        "title": "Non-collaborative Attackers and How and Where to Defend Flawed Security Protocols (Extended Version)",
        "author": "Michele Peroli, Luca Viganò, and Matteo Zavatteri",
        "link": "http://arxiv.org/abs/1405.6912v1",
        "abstract": "Security protocols are often found to be flawed after their deployment. We\npresent an approach that aims at the neutralization or mitigation of the\nattacks to flawed protocols: it avoids the complete dismissal of the interested\nprotocol and allows honest agents to continue to use it until a corrected\nversion is released. Our approach is based on the knowledge of the network\ntopology, which we model as a graph, and on the consequent possibility of\ncreating an interference to an ongoing attack of a Dolev-Yao attacker, by means\nof non-collaboration actuated by ad-hoc benign attackers that play the role of\nnetwork guardians. Such guardians, positioned in strategical points of the\nnetwork, have the task of monitoring the messages in transit and discovering at\nruntime, through particular types of inference, whether an attack is ongoing,\ninterrupting the run of the protocol in the positive case. We study not only\nhow but also where we can attempt to defend flawed security protocols: we\ninvestigate the different network topologies that make security protocol\ndefense feasible and illustrate our approach by means of concrete examples."
    },
    {
        "date": "2014-05-22",
        "title": "Quantifying the Utility-Privacy Tradeoff in the Smart Grid",
        "author": "Roy Dong, Alvaro A. Cárdenas, Lillian J. Ratliff, Henrik Ohlsson, and S. Shankar Sastry",
        "link": "http://arxiv.org/abs/1406.2568v2",
        "abstract": "The modernization of the electrical grid and the installation of smart meters\ncome with many advantages to control and monitoring. However, in the wrong\nhands, the data might pose a privacy threat. In this paper, we consider the\ntradeoff between smart grid operations and the privacy of consumers. We analyze\nthe tradeoff between smart grid operations and how often data is collected by\nconsidering a realistic direct-load control example using thermostatically\ncontrolled loads, and we give simulation results to show how its performance\ndegrades as the sampling frequency decreases. Additionally, we introduce a new\nprivacy metric, which we call inferential privacy. This privacy metric assumes\na strong adversary model, and provides an upper bound on the adversary's\nability to infer a private parameter, independent of the algorithm he uses.\nCombining these two results allow us to directly consider the tradeoff between\nbetter load control and consumer privacy."
    },
    {
        "date": "2014-05-22",
        "title": "Cover Story Management",
        "author": "Frédéric Cuppens, and Alban Gabillon",
        "link": "http://arxiv.org/abs/1405.5628v1",
        "abstract": "In a multilevel database, cover stories are usually managed using the\nambiguous technique of polyinstantiation. In this paper, we define a new\ntechnique to manage cover stories and propose a formal representation of a\nmultilevel database containing cover stories. Our model aims to be a generic\nmodel, that is, it can be interpreted for any kind of database (e.g.\nrelational, object- oriented etc). We then consider the problem of updating a\nmultilevel database containing cover stories managed with our technique."
    },
    {
        "date": "2014-05-21",
        "title": "The Effect of Visual Noise on The Completion of Security Critical Tasks",
        "author": "Tyler Kaczmarek, Alfed Kobsa, Robert Sy, and Gene Tsudik",
        "link": "http://arxiv.org/abs/1406.3002v2",
        "abstract": "User errors while performing security-critical tasks can lead to undesirable\nor even disastrous consequences. One major factor influencing mistakes and\nfailures is complexity of such tasks, which has been studied extensively in\nprior research. Another important issue which hardly received any attention is\nthe impact of both accidental and intended distractions on users performing\nsecurity-critical tasks. In particular, it is unclear whether, and to what\nextent, unexpected sensory cues (e.g., auditory or visual) can influence user\nbehavior and/or trigger mistakes. Better understanding of the effects of\nintended distractions will help clarify their role in adversarial models. As\npart of the research effort described in this paper, we administered a range of\nnaturally occurring -- yet unexpected -- sounds while study participants\nattempted to perform a security-critical task. We found that, although these\nauditory cues lowered participants' failure rates, they had no discernible\neffect on their task completion times. To this end, we overview some relevant\nliterature that explains these somewhat counter-intuitive findings.\n  Conducting a thorough and meaningful study on user errors requires a large\nnumber of participants, since errors are typically infrequent and should not be\ninstigated more than once per subject. To reduce the effort of running numerous\nsubjects, we developed a novel experimental setup that was fully automated and\nunattended. We discuss our experience with this setup and highlight the pros\nand cons of generalizing its usage."
    },
    {
        "date": "2014-05-21",
        "title": "TweetCred: Real-Time Credibility Assessment of Content on Twitter",
        "author": "Aditi Gupta, Ponnurangam Kumaraguru, Carlos Castillo, and Patrick Meier",
        "link": "http://arxiv.org/abs/1405.5490v2",
        "abstract": "During sudden onset crisis events, the presence of spam, rumors and fake\ncontent on Twitter reduces the value of information contained on its messages\n(or \"tweets\"). A possible solution to this problem is to use machine learning\nto automatically evaluate the credibility of a tweet, i.e. whether a person\nwould deem the tweet believable or trustworthy. This has been often framed and\nstudied as a supervised classification problem in an off-line (post-hoc)\nsetting. In this paper, we present a semi-supervised ranking model for scoring\ntweets according to their credibility. This model is used in TweetCred, a\nreal-time system that assigns a credibility score to tweets in a user's\ntimeline. TweetCred, available as a browser plug-in, was installed and used by\n1,127 Twitter users within a span of three months. During this period, the\ncredibility score for about 5.4 million tweets was computed, allowing us to\nevaluate TweetCred in terms of response time, effectiveness and usability. To\nthe best of our knowledge, this is the first research work to develop a\nreal-time system for credibility on Twitter, and to evaluate it on a user base\nof this size."
    },
    {
        "date": "2014-05-21",
        "title": "Effective Measurement Requirements for Network Security Management",
        "author": "Rabiah Ahmad, Shahrin Sahib, and Muhamad Pahri Nor'Azuwa",
        "link": "http://arxiv.org/abs/1405.5287v1",
        "abstract": "Technical security metrics provide measurements in ensuring the effectiveness\nof technical security controls or technology devices/objects that are used in\nprotecting the information systems. However, lack of understanding and method\nto develop the technical security metrics may lead to unachievable security\ncontrol objectives and incompetence of the implementation. This paper proposes\na model of technical security metric to measure the effectiveness of network\nsecurity management. The measurement is based on the effectiveness of security\nperformance for (1) network security controls such as firewall, Intrusion\nDetection Prevention System (IDPS), switch, wireless access point, wireless\ncontrollers and network architecture; and (2) network services such as\nHypertext Transfer Protocol Secure (HTTPS) and virtual private network (VPN).\nWe use the Goal-Question-Metric (GQM) paradigm [1] which links the measurement\ngoals to measurement questions and produce the metrics that can easily be\ninterpreted in compliance with the requirements. The outcome of this research\nmethod is the introduction of network security management metric as an\nattribute to the Technical Security Metric (TSM) model. Apparently, the\nproposed TSM model may provide guidance for organizations in complying with\neffective measurement requirements of ISO/IEC 27001 Information Security\nManagement System (ISMS) standard. The proposed model will provide a\ncomprehensive measurement and guidance to support the use of ISO/IEC 27004 ISMS\nMeasurement template."
    },
    {
        "date": "2014-05-15",
        "title": "An implementation on detection of trusted service provider in mobile ad-hoc networks",
        "author": "Mr. Rahul A Jichkar, and Dr. M. B. Chandak",
        "link": "http://arxiv.org/abs/1405.3912v1",
        "abstract": "The mobile ad-hoc network consists of energy constraint devices called nodes\ncommunicating through radio signals forming a temporary network i.e. nodes are\ncontinuously switching from one network to another. To minimize the power\nconsumption, we form the clusters with an elected cluster head (Service\nProvider) based on any cluster head selection strategy.To establish a trusted\nlink amongst newly entered node and CH we have adopted an indirect trust\ncomputation technique based on recommendations, which form an important\ncomponent in trust-based access control models for pervasive environment.In\nthis paper, we shall present some existing indirect trust based techniques and\nsubsequently discuss our proposal along with its merits and future scope."
    },
    {
        "date": "2014-05-14",
        "title": "Efficient classification using parallel and scalable compressed model and Its application on intrusion detection",
        "author": "Tieming Chen, Xu Zhang, Shichao Jin, and Okhee Kim",
        "link": "http://arxiv.org/abs/1405.3410v1",
        "abstract": "In order to achieve high efficiency of classification in intrusion detection,\na compressed model is proposed in this paper which combines horizontal\ncompression with vertical compression. OneR is utilized as horizontal\ncom-pression for attribute reduction, and affinity propagation is employed as\nvertical compression to select small representative exemplars from large\ntraining data. As to be able to computationally compress the larger volume of\ntraining data with scalability, MapReduce based parallelization approach is\nthen implemented and evaluated for each step of the model compression process\nabovementioned, on which common but efficient classification methods can be\ndirectly used. Experimental application study on two publicly available\ndatasets of intrusion detection, KDD99 and CMDC2012, demonstrates that the\nclassification using the compressed model proposed can effectively speed up the\ndetection procedure at up to 184 times, most importantly at the cost of a\nminimal accuracy difference with less than 1% on average."
    },
    {
        "date": "2014-05-13",
        "title": "Lattice-Based Ring Signature Scheme under the Random Oracle Model",
        "author": "Shangping Wang, and Ru zhao",
        "link": "http://arxiv.org/abs/1405.3177v1",
        "abstract": "On the basis of the signatures scheme without trapdoors from lattice, which\nis proposed by Vadim Lyubashevsky in 2012, we present a new ring signature\nscheme from lattice. The proposed ring signature scheme is an extension of the\nsignatures scheme without trapdoors. We proved that our scheme is strongly\nunforgeable against adaptive chosen message in the random oracle model, and\nproved that the security of our scheme can be reduced to the hardness of the\nsmall integer solution (SIS) problem by rejection samplings. Compared with the\nexisting lattice-based ring signature schemes, our new scheme is more efficient\nand with shorter signature length."
    },
    {
        "date": "2014-05-12",
        "title": "Dynamic Tags for Security Protocols",
        "author": "Myrto Arapinis, Stéphanie Delaune, and Steve Kremer",
        "link": "http://arxiv.org/abs/1405.2738v2",
        "abstract": "The design and verification of cryptographic protocols is a notoriously\ndifficult task, even in symbolic models which take an abstract view of\ncryptography. This is mainly due to the fact that protocols may interact with\nan arbitrary attacker which yields a verification problem that has several\nsources of unboundedness (size of messages, number of sessions, etc. In this\npaper, we characterize a class of protocols for which deciding security for an\nunbounded number of sessions is decidable. More precisely, we present a simple\ntransformation which maps a protocol that is secure for a bounded number of\nprotocol sessions (a decidable problem) to a protocol that is secure for an\nunbounded number of sessions. The precise number of sessions that need to be\nconsidered is a function of the security property and we show that for several\nclassical security properties a single session is sufficient. Therefore, in\nmany cases our results yields a design strategy for security protocols: (i)\ndesign a protocol intended to be secure for a {single session}; and (ii) apply\nour transformation to obtain a protocol which is secure for an unbounded number\nof sessions."
    },
    {
        "date": "2014-05-12",
        "title": "Signalling Storms in 3G Mobile Networks",
        "author": "Omer H. Abdelrahman, and Erol Gelenbe",
        "link": "http://arxiv.org/abs/1405.2735v1",
        "abstract": "We review the characteristics of signalling storms that have been caused by\ncertain common apps and recently observed in cellular networks, leading to\nsystem outages. We then develop a mathematical model of a mobile user's\nsignalling behaviour which focuses on the potential of causing such storms, and\nrepresent it by a large Markov chain. The analysis of this model allows us to\ndetermine the key parameters of mobile user device behaviour that can lead to\nsignalling storms. We then identify the parameter values that will lead to\nworst case load for the network itself in the presence of such storms. This\nleads to explicit results regarding the manner in which individual mobile\nbehaviour can cause overload conditions on the network and its signalling\nservers, and provides insight into how this may be avoided."
    },
    {
        "date": "2014-05-12",
        "title": "Reversible and Irreversible Data Hiding Technique",
        "author": "Tanmoy Sarkar, and Sugata Sanyal",
        "link": "http://arxiv.org/abs/1405.2684v2",
        "abstract": "Steganography (literally meaning covered writing) is the art and science of\nembedding secret message into seemingly harmless message. Stenography is\npractice from olden days where in ancient Greece people used wooden blocks to\ninscribe secret data and cover the date with wax and write normal message on\nit. Today stenography is used in various field like multimedia, networks,\nmedical, military etc. With increasing technology trends steganography is\nbecoming more and more advanced where people not only interested on hiding\nmessages in multimedia data (cover data) but also at the receiving end they are\nwilling to obtain original cover data without any distortion after extracting\nsecret message. This paper will discuss few irreversible data hiding techniques\nand also, some recently proposed reversible data hiding approach using images."
    },
    {
        "date": "2014-05-10",
        "title": "A Methodology for Information Flow Experiments",
        "author": "Michael Carl Tschantz, Amit Datta, Anupam Datta, and Jeannette M. Wing",
        "link": "http://arxiv.org/abs/1405.2376v1",
        "abstract": "Information flow analysis has largely ignored the setting where the analyst\nhas neither control over nor a complete model of the analyzed system. We\nformalize such limited information flow analyses and study an instance of it:\ndetecting the usage of data by websites. We prove that these problems are ones\nof causal inference. Leveraging this connection, we push beyond traditional\ninformation flow analysis to provide a systematic methodology based on\nexperimental science and statistical analysis. Our methodology allows us to\nsystematize prior works in the area viewing them as instances of a general\napproach. Our systematic study leads to practical advice for improving work on\ndetecting data usage, a previously unformalized area. We illustrate these\nconcepts with a series of experiments collecting data on the use of information\nby websites, which we statistically analyze."
    },
    {
        "date": "2014-05-08",
        "title": "A New Upperbound for the Oblivious Transfer Capacity of Discrete Memoryless Channels",
        "author": "K. Sankeerth Rao, and Vinod M. Prabhakaran",
        "link": "http://arxiv.org/abs/1405.2049v1",
        "abstract": "We derive a new upper bound on the string oblivious transfer capacity of\ndiscrete memoryless channels. The main tool we use is the tension region of a\npair of random variables introduced in Prabhakaran and Prabhakaran (2014) where\nit was used to derive upper bounds on rates of secure sampling in the source\nmodel. In this paper, we consider secure computation of string oblivious\ntransfer in the channel model. Our bound is based on a monotonicity property of\nthe tension region in the channel model. We show that our bound strictly\nimproves upon the upper bound of Ahlswede and Csisz\\'ar (2013)."
    },
    {
        "date": "2014-05-08",
        "title": "Modeling Bitcoin Contracts by Timed Automata",
        "author": "Marcin Andrychowicz, Stefan Dziembowski, Daniel Malinowski, and Łukasz Mazurek",
        "link": "http://arxiv.org/abs/1405.1861v2",
        "abstract": "Bitcoin is a peer-to-peer cryptographic currency system. Since its\nintroduction in 2008, Bitcoin has gained noticeable popularity, mostly due to\nits following properties: (1) the transaction fees are very low, and (2) it is\nnot controlled by any central authority, which in particular means that nobody\ncan \"print\" the money to generate inflation. Moreover, the transaction syntax\nallows to create the so-called contracts, where a number of\nmutually-distrusting parties engage in a protocol to jointly perform some\nfinancial task, and the fairness of this process is guaranteed by the\nproperties of Bitcoin. Although the Bitcoin contracts have several potential\napplications in the digital economy, so far they have not been widely used in\nreal life. This is partly due to the fact that they are cumbersome to create\nand analyze, and hence risky to use.\n  In this paper we propose to remedy this problem by using the methods\noriginally developed for the computer-aided analysis for hardware and software\nsystems, in particular those based on the timed automata. More concretely, we\npropose a framework for modeling the Bitcoin contracts using the timed automata\nin the UPPAAL model checker. Our method is general and can be used to model\nseveral contracts. As a proof-of-concept we use this framework to model some of\nthe Bitcoin contracts from our recent previous work. We then automatically\nverify their security in UPPAAL, finding (and correcting) some subtle errors\nthat were difficult to spot by the manual analysis. We hope that our work can\ndraw the attention of the researchers working on formal modeling to the problem\nof the Bitcoin contract verification, and spark off more research on this\ntopic."
    },
    {
        "date": "2014-05-07",
        "title": "Modelling Delegation and Revocation Schemes in IDP",
        "author": "Marcos Cramer, Pieter Van Hertum, Diego Agustin Ambrossio, and Marc Denecker",
        "link": "http://arxiv.org/abs/1405.1584v1",
        "abstract": "In ownership-based access control frameworks with the possibility of\ndelegating permissions and administrative rights, chains of delegated accesses\nwill form. There are different ways to treat these delegation chains when\nrevoking rights, which give rise to different revocation schemes. In this\npaper, we show how IDP - a knowledge base system that integrates technology\nfrom ASP, SAT and CP - can be used to efficiently implement executable\nrevocation schemes for an ownership-based access control system based on a\ndeclarative specification of their properties."
    },
    {
        "date": "2014-05-06",
        "title": "What's the Gist? Privacy-Preserving Aggregation of User Profiles",
        "author": "Igor Bilogrevic, Julien Freudiger, Emiliano De Cristofaro, and Ersin Uzun",
        "link": "http://arxiv.org/abs/1405.1328v2",
        "abstract": "Over the past few years, online service providers have started gathering\nincreasing amounts of personal information to build user profiles and monetize\nthem with advertisers and data brokers. Users have little control of what\ninformation is processed and are often left with an all-or-nothing decision\nbetween receiving free services or refusing to be profiled. This paper explores\nan alternative approach where users only disclose an aggregate model -- the\n\"gist\" -- of their data. We aim to preserve data utility and simultaneously\nprovide user privacy. We show that this approach can be efficiently supported\nby letting users contribute encrypted and differentially-private data to an\naggregator. The aggregator combines encrypted contributions and can only\nextract an aggregate model of the underlying data. We evaluate our framework on\na dataset of 100,000 U.S. users obtained from the U.S. Census Bureau and show\nthat (i) it provides accurate aggregates with as little as 100 users, (ii) it\ngenerates revenue for both users and data brokers, and (iii) its overhead is\nappreciably low."
    },
    {
        "date": "2014-05-06",
        "title": "In my Wish List, an Automated Tool for Fail-Secure Design Analysis: an Alloy-Based Feasibility Draft",
        "author": "Gurvan Le Guernic",
        "link": "http://arxiv.org/abs/1405.1115v1",
        "abstract": "A system is said to be fail-secure, sometimes confused with fail-safe, if it\nmaintains its security requirements even in the event of some faults.\nFail-secure analyses are required by some validation schemes, such as some\nCommon Criteria or NATO certifications. However, it is an aspect of security\nwhich as been overlooked by the community. This paper attempts to shed some\nlight on the fail-secure field of study by: giving a definition of fail-secure\nas used in those certification schemes, and emphasizing the differences with\nfail-safe; and exhibiting a first feasibility draft of a fail-secure design\nanalysis tool based on the Alloy model checker."
    },
    {
        "date": "2014-05-05",
        "title": "Verifiable Privacy-Preserving Member and Order Queries on a List",
        "author": "Esha Ghosh, Olga Ohrimenko, and Roberto Tamassia",
        "link": "http://arxiv.org/abs/1405.0962v2",
        "abstract": "We introduce a formal model for membership and order queries on\nprivacy-preserving authenticated lists. In this model, the queries are\nperformed on the list stored in the cloud where data integrity and privacy have\nto be maintained. We then present an efficient construction of\nprivacy-preserving authenticated lists based on bilinear accumulators and\nbilinear maps, analyze the performance, and prove the integrity and privacy of\nthis construction under widely accepted assumptions."
    },
    {
        "date": "2014-05-05",
        "title": "Confinement for Active Objects",
        "author": "Florian Kammueller",
        "link": "http://arxiv.org/abs/1405.0867v1",
        "abstract": "In this paper, we provide a formal framework for the security of distributed\nactive objects. Active objects communicate asynchronously implementing method\ncalls via futures. We base the formal framework on a security model that uses a\nsemi-lattice to enable multi-lateral security crucial for distributed\narchitectures. We further provide a security type system for the programming\nmodel ASPfun of functional active objects. Type safety and a confinement\nproperty are presented. ASPfun thus realizes secure down calls."
    },
    {
        "date": "2014-05-03",
        "title": "A Network Intrusions Detection System based on a Quantum Bio Inspired Algorithm",
        "author": "Omar S. Soliman, and Aliaa Rassem",
        "link": "http://arxiv.org/abs/1405.1404v1",
        "abstract": "Network intrusion detection systems (NIDSs) have a role of identifying\nmalicious activities by monitoring the behavior of networks. Due to the\ncurrently high volume of networks trafic in addition to the increased number of\nattacks and their dynamic properties, NIDSs have the challenge of improving\ntheir classification performance. Bio-Inspired Optimization Algorithms (BIOs)\nare used to automatically extract the the discrimination rules of normal or\nabnormal behavior to improve the classification accuracy and the detection\nability of NIDS. A quantum vaccined immune clonal algorithm with the estimation\nof distribution algorithm (QVICA-with EDA) is proposed in this paper to build a\nnew NIDS. The proposed algorithm is used as classification algorithm of the new\nNIDS where it is trained and tested using the KDD data set. Also, the new NIDS\nis compared with another detection system based on particle swarm optimization\n(PSO). Results shows the ability of the proposed algorithm of achieving high\nintrusions classification accuracy where the highest obtained accuracy is 94.8\n%."
    },
    {
        "date": "2014-05-02",
        "title": "Dovetail: Stronger Anonymity in Next-Generation Internet Routing",
        "author": "Jody Sankey, and Matthew Wright",
        "link": "http://arxiv.org/abs/1405.0351v2",
        "abstract": "Current low-latency anonymity systems use complex overlay networks to conceal\na user's IP address, introducing significant latency and network efficiency\npenalties compared to normal Internet usage. Rather than obfuscating network\nidentity through higher level protocols, we propose a more direct solution: a\nrouting protocol that allows communication without exposing network identity,\nproviding a strong foundation for Internet privacy, while allowing identity to\nbe defined in those higher level protocols where it adds value.\n  Given current research initiatives advocating \"clean slate\" Internet designs,\nan opportunity exists to design an internetwork layer routing protocol that\ndecouples identity from network location and thereby simplifies the anonymity\nproblem. Recently, Hsiao et al. proposed such a protocol (LAP), but it does not\nprotect the user against a local eavesdropper or an untrusted ISP, which will\nnot be acceptable for many users. Thus, we propose Dovetail, a next-generation\nInternet routing protocol that provides anonymity against an active attacker\nlocated at any single point within the network, including the user's ISP. A\nmajor design challenge is to provide this protection without including an\napplication-layer proxy in data transmission. We address this challenge in path\nconstruction by using a matchmaker node (an end host) to overlap two path\nsegments at a dovetail node (a router). The dovetail then trims away part of\nthe path so that data transmission bypasses the matchmaker. Additional design\nfeatures include the choice of many different paths through the network and the\njoining of path segments without requiring a trusted third party. We develop a\nsystematic mechanism to measure the topological anonymity of our designs, and\nwe demonstrate the privacy and efficiency of our proposal by simulation, using\na model of the complete Internet at the AS-level."
    },
    {
        "date": "2014-04-30",
        "title": "A Flow Sensitive Security Model for Cloud Computing Systems",
        "author": "Wen Zeng, Chunyan Mu, Maciej Koutny, and Paul Watson",
        "link": "http://arxiv.org/abs/1404.7760v1",
        "abstract": "The extent and importance of cloud computing is rapidly increasing due to the\never increasing demand for internet services and communications. Instead of\nbuilding individual information technology infrastructure to host databases or\nsoftware, a third party can host them in its large server clouds. Large\norganizations may wish to keep sensitive information on their more restricted\nservers rather than in the public cloud. This has led to the introduction of\nfederated cloud computing (FCC) in which both public and private cloud\ncomputing resources are used."
    },
    {
        "date": "2014-04-29",
        "title": "Classical leakage resilience from fault-tolerant quantum computation",
        "author": "Felipe G. Lacerda, Joseph M. Renes, and Renato Renner",
        "link": "http://arxiv.org/abs/1404.7516v1",
        "abstract": "Physical implementations of cryptographic algorithms leak information, which\nmakes them vulnerable to so-called side-channel attacks. The problem of secure\ncomputation in the presence of leakage is generally known as leakage\nresilience. In this work, we establish a connection between leakage resilience\nand fault-tolerant quantum computation. We first prove that for a general\nleakage model, there exists a corresponding noise model in which fault\ntolerance implies leakage resilience. Then we show how to use constructions for\nfault-tolerant quantum computation to implement classical circuits that are\nsecure in specific leakage models."
    },
    {
        "date": "2014-04-29",
        "title": "Secure Degrees of Freedom Regions of Multiple Access and Interference Channels: The Polytope Structure",
        "author": "Jianwei Xie, and Sennur Ulukus",
        "link": "http://arxiv.org/abs/1404.7478v1",
        "abstract": "The sum secure degrees of freedom (s.d.o.f.) of two fundamental multi-user\nnetwork structures, the K-user Gaussian multiple access (MAC) wiretap channel\nand the K-user interference channel (IC) with secrecy constraints, have been\ndetermined recently as K(K-1)/(K(K-1)+1) [1,2] and K(K-1)/(2K-1) [3,4],\nrespectively. In this paper, we determine the entire s.d.o.f. regions of these\ntwo channel models. The converse for the MAC follows from a middle step in the\nconverse of [1,2]. The converse for the IC includes constraints both due to\nsecrecy as well as due to interference. Although the portion of the region\nclose to the optimum sum s.d.o.f. point is governed by the upper bounds due to\nsecrecy constraints, the other portions of the region are governed by the upper\nbounds due to interference constraints. Different from the existing literature,\nin order to fully understand the characterization of the s.d.o.f. region of the\nIC, one has to study the 4-user case, i.e., the 2 or 3-user cases do not\nillustrate the generality of the problem. In order to prove the achievability,\nwe use the polytope structure of the converse region. In both MAC and IC cases,\nwe develop explicit schemes that achieve the extreme points of the polytope\nregion given by the converse. Specifically, the extreme points of the MAC\nregion are achieved by an m-user MAC wiretap channel with (K-m) helpers, i.e.,\nby setting (K-m) users' secure rates to zero and utilizing them as pure\n(structured) cooperative jammers. The extreme points of the IC region are\nachieved by a (K-m)-user IC with confidential messages, m helpers, and N\nexternal eavesdroppers, for m>=1 and a finite N. A byproduct of our results in\nthis paper is that the sum s.d.o.f. is achieved only at one extreme point of\nthe s.d.o.f. region, which is the symmetric-rate extreme point, for both MAC\nand IC channel models."
    },
    {
        "date": "2014-04-27",
        "title": "An Argumentation-Based Framework to Address the Attribution Problem in Cyber-Warfare",
        "author": "Paulo Shakarian, Gerardo I. Simari, Geoffrey Moores, Simon Parsons, and Marcelo A. Falappa",
        "link": "http://arxiv.org/abs/1404.6699v1",
        "abstract": "Attributing a cyber-operation through the use of multiple pieces of technical\nevidence (i.e., malware reverse-engineering and source tracking) and\nconventional intelligence sources (i.e., human or signals intelligence) is a\ndifficult problem not only due to the effort required to obtain evidence, but\nthe ease with which an adversary can plant false evidence. In this paper, we\nintroduce a formal reasoning system called the InCA (Intelligent Cyber\nAttribution) framework that is designed to aid an analyst in the attribution of\na cyber-operation even when the available information is conflicting and/or\nuncertain. Our approach combines argumentation-based reasoning, logic\nprogramming, and probabilistic models to not only attribute an operation but\nalso explain to the analyst why the system reaches its conclusions."
    },
    {
        "date": "2014-04-25",
        "title": "Active Adversaries from an Information-Theoretic Perspective: Data Modification Attacks",
        "author": "Mahtab Mirmohseni, and Panagiotis Papadimitratos",
        "link": "http://arxiv.org/abs/1404.6331v1",
        "abstract": "We investigate the problem of reliable communication in the presence of\nactive adversaries that can tamper with the transmitted data. We consider a\nlegitimate transmitter-receiver pair connected over multiple communication\npaths (routes). We propose two new models of adversary, a \"memoryless\" and a\n\"foreseer\" adversary. For both models, the adversaries are placing themselves\narbitrarily on the routes, keeping their placement fixed throughout the\ntransmission block. This placement may or may not be known to the transmitter.\nThe adversaries can choose their best modification strategy to increase the\nerror at the legitimate receiver, subject to a maximum distortion constraint.\nWe investigate the communication rates that can be achieved in the presence of\nthe two types of adversaries and the channel (benign) stochastic behavior. For\nmemoryless adversaries, the capacity is derived. Our method is to use the\ntypical set of the anticipated received signal for all possible adversarial\nstrategies (including their best one) in a compound channel that also captures\nadversarial placement. For the foreseer adversaries, which have enhanced\nobservation capabilities compared to the memoryless ones, we propose a new\ncoding scheme to guarantee resilience, i.e., recovery of the codeword\nindependently of the adversarial (best) choice. We derive an achievable rate\nand we propose an upper bound on the capacity. We evaluate our general results\nfor specific cases (e.g., binary symbol replacement or erasing attacks), to\ngain insights."
    },
    {
        "date": "2014-04-19",
        "title": "Towards $k$-connectivity of the random graph induced by a pairwise key predistribution scheme with unreliable links",
        "author": "Faruk Yavuz, Jun Zhao, Osman Yağan, and Virgil Gligor",
        "link": "http://arxiv.org/abs/1405.5193v1",
        "abstract": "We study the secure and reliable connectivity of wireless sensor networks.\nSecurity is assumed to be ensured by the random pairwise key predistribution\nscheme of Chan, Perrig, and Song, and unreliable wireless links are represented\nby independent on/off channels. Modeling the network by an intersection of a\nrandom $K$-out graph and an Erd\\H{o}s-R\\'enyi graph, we present scaling\nconditions (on the number of nodes, the scheme parameter $K$, and the\nprobability of a wireless channel being on) such that the resulting graph\ncontains no nodes with degree less than $k$ with high probability, when the\nnumber of nodes gets large. Results are given in the form of zero-one laws and\nare shown to improve the previous results by Ya\\u{g}an and Makowski on the\nabsence of isolated nodes (i.e., absence of nodes with degree zero). Via\nsimulations, the established zero-one laws are shown to hold also for the\nproperty of $k$-connectivity; i.e., the property that graph remains connected\ndespite the deletion of any $k-1$ nodes or edges."
    },
    {
        "date": "2014-04-17",
        "title": "Do electromagnetic waves exist in a short cable at low frequencies? What does physics say?",
        "author": "Hsien-Pu Chen, Laszlo B. Kish, Claes-Goran Granqvist, and Gabor Schmera",
        "link": "http://arxiv.org/abs/1404.4664v2",
        "abstract": "We refute a physical model, recently proposed by Gunn, Allison and Abbott\n(GAA) [arXiv:1402.2709v2], to utilize electromagnetic waves for eavesdropping\non the Kirchhoff-law-Johnson-noise (KLJN) secure key distribution. Their model,\nand its theoretical underpinnings, is found to be fundamentally flawed because\ntheir assumption of electromagnetic waves violates not only the wave equation\nbut also the Second Law of Thermodynamics, the Principle of Detailed Balance,\nBoltzmann's Energy Equipartition Theorem, and Planck's formula by implying\ninfinitely strong blackbody radiation. We deduce the correct mathematical model\nof the GAA scheme, which is based on impedances at the quasi-static limit.\nMathematical analysis and simulation results confirm our approach and prove\nthat GAA's experimental interpretation is incorrect too."
    },
    {
        "date": "2014-04-15",
        "title": "A Hybrid Analysis for Security Protocols with State",
        "author": "John D. Ramsdell, Daniel J. Dougherty, Joshua D. Guttman, and Paul D. Rowe",
        "link": "http://arxiv.org/abs/1404.3899v2",
        "abstract": "Cryptographic protocols rely on message-passing to coordinate activity among\nprincipals. Each principal maintains local state in individual local sessions\nonly as needed to complete that session. However, in some protocols a principal\nalso uses state to coordinate its different local sessions. Sometimes the\nnon-local, mutable state is used as a means, for example with smart cards or\nTrusted Platform Modules. Sometimes it is the purpose of running the protocol,\nfor example in commercial transactions.\n  Many richly developed tools and techniques, based on well-understood\nfoundations, are available for design and analysis of pure message-passing\nprotocols. But the presence of cross-session state poses difficulties for these\ntechniques.\n  In this paper we provide a framework for modeling stateful protocols. We\ndefine a hybrid analysis method. It leverages theorem-proving---in this\ninstance, the PVS prover---for reasoning about computations over state. It\ncombines that with an \"enrich-by-need\" approach---embodied by CPSA---that\nfocuses on the message-passing part. As a case study we give a full analysis of\nthe Envelope Protocol, due to Mark Ryan."
    },
    {
        "date": "2014-04-14",
        "title": "Information Security Management of Web Portals Based on Joomla CMS",
        "author": "Samir Lemes",
        "link": "http://arxiv.org/abs/1404.3707v1",
        "abstract": "Information is the key asset of all organizations and can exist in many\nforms. It can be printed or written on paper, stored electronically,\ntransmitted by mail or by electronic means, shown in films, or spoken in\nconversation. In today's competitive business environment, such information is\nconstantly under threat from many sources, which can be internal, external,\naccidental, or malicious. Joomla is a very popular Content Management System\n(CMS) used for web page maintenance. This highly versatile software has found\nitself in both large corporate web portals, and simple web pages such as blogs.\nSuch popularity increases its vulnerability to potential attacks and therefore\nneeds an appropriate security management. ISO (the International Organization\nfor Standardization) and IEC (the International Electrotechnical Commission)\ncreated the series of standards aimed at providing a model for establishing,\nimplementing, operating, monitoring, reviewing, maintaining and improving an\nInformation Security Management System (ISMS). This paper shows how principles\nset in ISO/IEC 27000 series of standards can be used to improve security of\nJoomla based web portals."
    },
    {
        "date": "2014-04-11",
        "title": "On the \"cracking\" scheme in the paper \"A directional coupler attack against the Kish key distribution system\" by Gunn, Allison and Abbott",
        "author": "Hsien-Pu Chen, Laszlo B. Kish, Claes-Goran Granqvist, and Gabor Schmera",
        "link": "http://arxiv.org/abs/1405.2034v4",
        "abstract": "Recently, Gunn, Allison and Abbott (GAA)\n[http://arxiv.org/pdf/1402.2709v2.pdf] proposed a new scheme to utilize\nelectromagnetic waves for eavesdropping on the Kirchhoff-law-Johnson-noise\n(KLJN) secure key distribution. We proved in a former paper [Fluct. Noise Lett.\n13 (2014) 1450016] that GAA's mathematical model is unphysical. Here we analyze\nGAA's cracking scheme and show that, in the case of a loss-free cable, it\nprovides less eavesdropping information than in the earlier\n(Bergou)-Scheuer-Yariv mean-square-based attack [Kish LB, Scheuer J, Phys.\nLett. A 374 (2010) 2140-2142], while it offers no information in the case of a\nlossy cable. We also investigate GAA's claim to be experimentally capable of\ndistinguishing - using statistics over a few correlation times only - the\ndistributions of two Gaussian noises with a relative variance difference of\nless than 10^-8. Normally such distinctions would require hundreds of millions\nof correlations times to be observable. We identify several potential\nexperimental artifacts as results of poor KLJN design, which can lead to GAA's\nassertions: deterministic currents due to spurious harmonic components caused\nby ground loops, DC offset, aliasing, non-Gaussian features including\nnon-linearities and other non-idealities in generators, and the time-derivative\nnature of GAA's scheme which tends to enhance all of these artifacts."
    },
    {
        "date": "2014-04-10",
        "title": "A blind robust watermarking scheme based on svd and circulant matrices",
        "author": "Noui Oussama, and Noui Lemnouar",
        "link": "http://arxiv.org/abs/1404.2952v1",
        "abstract": "Multimedia security has been the aim point of considerable research activity\nbecause of its wide application area. The major technology to achieve copyright\nprotection, content authentication, access control and multimedia security is\nwatermarking which is the process of embedding data into a multimedia element\nsuch as image or audio, this embedded data can later be extracted from, or\ndetected in the embedded element for different purposes. In this work, a blind\nwatermarking algorithm based on SVD and circulant matrices has been presented.\nEvery circulant matrix is associated with a matrix for which the SVD\ndecomposition coincides with the spectral decomposition. This leads to improve\nthe Chandra algorithm [1], our presentation will include a discussion on the\ndata hiding capacity, watermark transparency and robustness against a wide\nrange of common image processing attacks."
    },
    {
        "date": "2014-04-10",
        "title": "LDPC coded transmissions over the Gaussian broadcast channel with confidential messages",
        "author": "Marco Baldi, Nicola Maturo, Giacomo Ricciutelli, and Franco Chiaraluce",
        "link": "http://arxiv.org/abs/1404.2864v1",
        "abstract": "We design and assess some practical low-density parity-check (LDPC) coded\ntransmission schemes for the Gaussian broadcast channel with confidential\nmessages (BCC). This channel model is different from the classical wiretap\nchannel model as the unauthorized receiver (Eve) must be able to decode some\npart of the information. Hence, the reliability and security targets are\ndifferent from those of the wiretap channel. In order to design and assess\npractical coding schemes, we use the error rate as a metric of the performance\nachieved by the authorized receiver (Bob) and the unauthorized receiver (Eve).\nWe study the system feasibility, and show that two different levels of\nprotection against noise are required on the public and the secret messages.\nThis can be achieved in two ways: i) by using LDPC codes with unequal error\nprotection (UEP) of the transmitted information bits or ii) by using two\nclassical non-UEP LDPC codes with different rates. We compare these two\napproaches and show that, for the considered examples, the solution exploiting\nUEP LDPC codes is more efficient than that using non-UEP LDPC codes."
    },
    {
        "date": "2014-04-10",
        "title": "To Share or Not to Share in Client-Side Encrypted Clouds",
        "author": "Duane Wilson, and Giuseppe Ateniese",
        "link": "http://arxiv.org/abs/1404.2697v2",
        "abstract": "With the advent of cloud computing, a number of cloud providers have arisen\nto provide Storage-as-a-Service (SaaS) offerings to both regular consumers and\nbusiness organizations. SaaS (different than Software-as-a-Service in this\ncontext) refers to an architectural model in which a cloud provider provides\ndigital storage on their own infrastructure. Three models exist amongst SaaS\nproviders for protecting the confidentiality data stored in the cloud: 1) no\nencryption (data is stored in plain text), 2) server-side encryption (data is\nencrypted once uploaded), and 3) client-side encryption (data is encrypted\nprior to upload). This paper seeks to identify weaknesses in the third model,\nas it claims to offer 100% user data confidentiality throughout all data\ntransactions (e.g., upload, download, sharing) through a combination of Network\nTraffic Analysis, Source Code Decompilation, and Source Code Disassembly. The\nweaknesses we uncovered primarily center around the fact that the cloud\nproviders we evaluated were each operating in a Certificate Authority capacity\nto facilitate data sharing. In this capacity, they assume the role of both\ncertificate issuer and certificate authorizer as denoted in a Public-Key\nInfrastructure (PKI) scheme - which gives them the ability to view user data\ncontradicting their claims of 100% data confidentiality. We have collated our\nanalysis and findings in this paper and explore some potential solutions to\naddress these weaknesses in these sharing methods. The solutions proposed are a\ncombination of best practices associated with the use of PKI and other\ncryptographic primitives generally accepted for protecting the confidentiality\nof shared information."
    },
    {
        "date": "2014-04-09",
        "title": "Asymptotics of Fingerprinting and Group Testing: Capacity-Achieving Log-Likelihood Decoders",
        "author": "Thijs Laarhoven",
        "link": "http://arxiv.org/abs/1404.2825v1",
        "abstract": "We study the large-coalition asymptotics of fingerprinting and group testing,\nand derive explicit decoders that provably achieve capacity for many of the\nconsidered models. We do this both for simple decoders (fast but suboptimal)\nand for joint decoders (slow but optimal), and both for informed and uninformed\nsettings.\n  For fingerprinting, we show that if the pirate strategy is known, the\nNeyman-Pearson-based log-likelihood decoders provably achieve capacity,\nregardless of the strategy. The decoder built against the interleaving attack\nis further shown to be a universal decoder, able to deal with arbitrary attacks\nand achieving the uninformed capacity. This universal decoder is shown to be\nclosely related to the Lagrange-optimized decoder of Oosterwijk et al. and the\nempirical mutual information decoder of Moulin. Joint decoders are also\nproposed, and we conjecture that these also achieve the corresponding joint\ncapacities.\n  For group testing, the simple decoder for the classical model is shown to be\nmore efficient than the one of Chan et al. and it provably achieves the simple\ngroup testing capacity. For generalizations of this model such as noisy group\ntesting, the resulting simple decoders also achieve the corresponding simple\ncapacities."
    },
    {
        "date": "2014-04-09",
        "title": "Asymptotics of Fingerprinting and Group Testing: Tight Bounds from Channel Capacities",
        "author": "Thijs Laarhoven",
        "link": "http://arxiv.org/abs/1404.2576v1",
        "abstract": "In this work we consider the large-coalition asymptotics of various\nfingerprinting and group testing games, and derive explicit expressions for the\ncapacities for each of these models. We do this both for simple decoders (fast\nbut suboptimal) and for joint decoders (slow but optimal).\n  For fingerprinting, we show that if the pirate strategy is known, the\ncapacity often decreases linearly with the number of colluders, instead of\nquadratically as in the uninformed fingerprinting game. For many attacks the\njoint capacity is further shown to be strictly higher than the simple capacity.\n  For group testing, we improve upon known results about the joint capacities,\nand derive new explicit asymptotics for the simple capacities. These show that\nexisting simple group testing algorithms are suboptimal, and that simple\ndecoders cannot asymptotically be as efficient as joint decoders. For the\ntraditional group testing model, we show that the gap between the simple and\njoint capacities is a factor 1.44 for large numbers of defectives."
    },
    {
        "date": "2014-04-08",
        "title": "A Graphical Adversarial Risk Analysis Model for Oil and Gas Drilling Cybersecurity",
        "author": "Aitor Couce Vieira, Siv Hilde Houmb, and David Rios Insua",
        "link": "http://arxiv.org/abs/1404.1989v1",
        "abstract": "Oil and gas drilling is based, increasingly, on operational technology, whose\ncybersecurity is complicated by several challenges. We propose a graphical\nmodel for cybersecurity risk assessment based on Adversarial Risk Analysis to\nface those challenges. We also provide an example of the model in the context\nof an offshore drilling rig. The proposed model provides a more formal and\ncomprehensive analysis of risks, still using the standard business language\nbased on decisions, risks, and value."
    },
    {
        "date": "2014-04-08",
        "title": "Possibilistic Information Flow Control for Workflow Management Systems",
        "author": "Thomas Bauereiss, and Dieter Hutter",
        "link": "http://arxiv.org/abs/1404.1987v1",
        "abstract": "In workflows and business processes, there are often security requirements on\nboth the data, i.e. confidentiality and integrity, and the process, e.g.\nseparation of duty. Graphical notations exist for specifying both workflows and\nassociated security requirements. We present an approach for formally verifying\nthat a workflow satisfies such security requirements. For this purpose, we\ndefine the semantics of a workflow as a state-event system and formalise\nsecurity properties in a trace-based way, i.e. on an abstract level without\ndepending on details of enforcement mechanisms such as Role-Based Access\nControl (RBAC). This formal model then allows us to build upon well-known\nverification techniques for information flow control. We describe how a\ncompositional verification methodology for possibilistic information flow can\nbe adapted to verify that a specification of a distributed workflow management\nsystem satisfies security requirements on both data and processes."
    },
    {
        "date": "2014-04-08",
        "title": "Towards the Model-Driven Engineering of Secure yet Safe Embedded Systems",
        "author": "Ludovic Apvrille, and Yves Roudier",
        "link": "http://arxiv.org/abs/1404.1985v1",
        "abstract": "We introduce SysML-Sec, a SysML-based Model-Driven Engineering environment\naimed at fostering the collaboration between system designers and security\nexperts at all methodological stages of the development of an embedded system.\nA central issue in the design of an embedded system is the definition of the\nhardware/software partitioning of the architecture of the system, which should\ntake place as early as possible. SysML-Sec aims to extend the relevance of this\nanalysis through the integration of security requirements and threats. In\nparticular, we propose an agile methodology whose aim is to assess early on the\nimpact of the security requirements and of the security mechanisms designed to\nsatisfy them over the safety of the system. Security concerns are captured in a\ncomponent-centric manner through existing SysML diagrams with only minimal\nextensions. After the requirements captured are derived into security and\ncryptographic mechanisms, security properties can be formally verified over\nthis design. To perform the latter, model transformation techniques are\nimplemented in the SysML-Sec toolchain in order to derive a ProVerif\nspecification from the SysML models. An automotive firmware flashing procedure\nserves as a guiding example throughout our presentation."
    },
    {
        "date": "2014-04-08",
        "title": "Threats Management Throughout the Software Service Life-Cycle",
        "author": "Erlend Andreas Gjære, and Per Håkon Meland",
        "link": "http://arxiv.org/abs/1404.1984v1",
        "abstract": "Software services are inevitably exposed to a fluctuating threat picture.\nUnfortunately, not all threats can be handled only with preventive measures\nduring design and development, but also require adaptive mitigations at\nruntime. In this paper we describe an approach where we model composite\nservices and threats together, which allows us to create preventive measures at\ndesign-time. At runtime, our specification also allows the service runtime\nenvironment (SRE) to receive alerts about active threats that we have not\nhandled, and react to these automatically through adaptation of the composite\nservice. A goal-oriented security requirements modelling tool is used to model\nbusiness-level threats and analyse how they may impact goals. A process flow\nmodelling tool, utilising Business Process Model and Notation (BPMN) and\nstandard error boundary events, allows us to define how threats should be\nresponded to during service execution on a technical level. Throughout the\nsoftware life-cycle, we maintain threats in a centralised threat repository.\nRe-use of these threats extends further into monitoring alerts being\ndistributed through a cloud-based messaging service. To demonstrate our\napproach in practice, we have developed a proof-of-concept service for the Air\nTraffic Management (ATM) domain. In addition to the design-time activities, we\nshow how this composite service duly adapts itself when a service component is\nexposed to a threat at runtime."
    },
    {
        "date": "2014-04-06",
        "title": "Proceedings First International Workshop on Graphical Models for Security",
        "author": "Barbara Kordy, Sjouke Mauw, and Wolter Pieters",
        "link": "http://arxiv.org/abs/1404.1634v1",
        "abstract": "The present volume contains the proceedings of the First International\nWorkshop on Graphical Models for Security (GraMSec'14). The workshop was held\nin Grenoble, France, on April 12, 2014, as one of the satellite events of the\nEuropean Joint Conferences on Theory and Practice of Software 2014 (ETAPS'14).\n  Graphical security models provide an intuitive but systematic methodology to\nanalyze security weaknesses of systems and to evaluate potential protection\nmeasures. Such models have been subject of academic research and they have also\nbeen widely accepted by the industrial sector, as a means to support and\nfacilitate threat analysis and risk management processes.\n  The objective of GraMSec is to contribute to the development of well-founded\ngraphical security models, efficient algorithms for their analysis, as well as\nmethodologies for their practical usage. The workshop brings together academic\nresearchers and industry practitioners designing and employing visual models\nfor security in order to provide a platform for discussion, knowledge exchange\nand collaborations."
    },
    {
        "date": "2014-04-04",
        "title": "Android Security Framework: Enabling Generic and Extensible Access Control on Android",
        "author": "Michael Backes, Sven Bugiel, Sebastian Gerling, and Philipp von Styp-Rekowsky",
        "link": "http://arxiv.org/abs/1404.1395v1",
        "abstract": "We introduce the Android Security Framework (ASF), a generic, extensible\nsecurity framework for Android that enables the development and integration of\na wide spectrum of security models in form of code-based security modules. The\ndesign of ASF reflects lessons learned from the literature on established\nsecurity frameworks (such as Linux Security Modules or the BSD MAC Framework)\nand intertwines them with the particular requirements and challenges from the\ndesign of Android's software stack. ASF provides a novel security API that\nsupports authors of Android security extensions in developing their modules.\nThis overcomes the current unsatisfactory situation to provide security\nsolutions as separate patches to the Android software stack or to embed them\ninto Android's mainline codebase. As a result, ASF provides different practical\nbenefits such as a higher degree of acceptance, adaptation, and maintenance of\nsecurity solutions than previously possible on Android. We present a\nprototypical implementation of ASF and demonstrate its effectiveness and\nefficiency by modularizing different security models from related work, such as\ncontext-aware access control, inlined reference monitoring, and type\nenforcement."
    },
    {
        "date": "2014-04-01",
        "title": "Ontological Approach toward Cybersecurity in Cloud Computing",
        "author": "Takeshi Takahashi, Youki Kadobayashi, and Hiroyuki Fujiwara",
        "link": "http://arxiv.org/abs/1405.6169v1",
        "abstract": "Widespread deployment of the Internet enabled building of an emerging IT\ndelivery model, i.e., cloud computing. Albeit cloud computing-based services\nhave rapidly developed, their security aspects are still at the initial stage\nof development. In order to preserve cybersecurity in cloud computing,\ncybersecurity information that will be exchanged within it needs to be\nidentified and discussed. For this purpose, we propose an ontological approach\nto cybersecurity in cloud computing. We build an ontology for cybersecurity\noperational information based on actual cybersecurity operations mainly focused\non non-cloud computing. In order to discuss necessary cybersecurity information\nin cloud computing, we apply the ontology to cloud computing. Through the\ndiscussion, we identify essential changes in cloud computing such as data-asset\ndecoupling and clarify the cybersecurity information required by the changes\nsuch as data provenance and resource dependency information."
    },
    {
        "date": "2014-03-31",
        "title": "Secure and scalable match: overcoming the universal circuit bottleneck using group programs",
        "author": "Rajesh Krishnan, and Ravi Sundaram",
        "link": "http://arxiv.org/abs/1403.8137v1",
        "abstract": "Confidential Content-Based Publish/Subscribe (C-CBPS) is an interaction\n(pub/sub) model that allows parties to exchange data while still protecting\ntheir security and privacy interests. In this paper we advance the state of the\nart in C-CBPS by showing how all predicate circuits in NC1 (logarithmic-depth,\nbounded fan-in) can be securely computed by a broker while guaranteeing perfect\ninformation-theoretic security. Previous work could handle only strictly\nshallower circuits (e.g. those with depth O(\\sqrt{\\lg n}) [SYY99, V76]. We\npresent three protocols -- UGP-Match, FSGP-Match and OFSGP-Match -- all three\nare based on (2-decomposable randomized encodings of) group programs and handle\ncircuits in NC1. UGP-Match is conceptually simple and has a clean proof of\ncorrectness but it is inefficient and impractical. FSGP-Match uses a \"fixed\nstructure\" trick to achieve efficiency and scalability. And, finally,\nOFSGP-Match uses hand-optimized group programs to wring greater efficiencies.\nWe complete our investigation with an experimental evaluation of a prototype\nimplementation."
    },
    {
        "date": "2014-03-30",
        "title": "Relevant Feature Selection Model Using Data Mining for Intrusion Detection System",
        "author": "Ayman I. Madbouly, Amr M. Gody, and Tamer M. Barakat",
        "link": "http://arxiv.org/abs/1403.7726v1",
        "abstract": "Network intrusions have become a significant threat in recent years as a\nresult of the increased demand of computer networks for critical systems.\nIntrusion detection system (IDS) has been widely deployed as a defense measure\nfor computer networks. Features extracted from network traffic can be used as\nsign to detect anomalies. However with the huge amount of network traffic,\ncollected data contains irrelevant and redundant features that affect the\ndetection rate of the IDS, consumes high amount of system resources, and\nslowdown the training and testing process of the IDS. In this paper, a new\nfeature selection model is proposed; this model can effectively select the most\nrelevant features for intrusion detection. Our goal is to build a lightweight\nintrusion detection system by using a reduced features set. Deleting irrelevant\nand redundant features helps to build a faster training and testing process, to\nhave less resource consumption as well as to maintain high detection rates. The\neffectiveness and the feasibility of our feature selection model were verified\nby several experiments on KDD intrusion detection dataset. The experimental\nresults strongly showed that our model is not only able to yield high detection\nrates but also to speed up the detection process."
    },
    {
        "date": "2014-03-27",
        "title": "Building Secure and Anonymous Communication Channel: Formal Model and its Prototype Implementation",
        "author": "Keita Emura, Akira Kanaoka, Satoshi Ohta, and Takeshi Takahashi",
        "link": "http://arxiv.org/abs/1403.7014v3",
        "abstract": "Various techniques need to be combined to realize anonymously authenticated\ncommunication. Cryptographic tools enable anonymous user authentication while\nanonymous communication protocols hide users' IP addresses from service\nproviders. One simple approach for realizing anonymously authenticated\ncommunication is their simple combination, but this gives rise to another\nissue; how to build a secure channel. The current public key infrastructure\ncannot be used since the user's public key identifies the user. To cope with\nthis issue, we propose a protocol that uses identity-based encryption for\npacket encryption without sacrificing anonymity, and group signature for\nanonymous user authentication. Communications in the protocol take place\nthrough proxy entities that conceal users' IP addresses from service providers.\nThe underlying group signature is customized to meet our objective and improve\nits efficiency. We also introduce a proof-of-concept implementation to\ndemonstrate the protocol's feasibility. We compare its performance to SSL\ncommunication and demonstrate its practicality, and conclude that the protocol\nrealizes secure, anonymous, and authenticated communication between users and\nservice providers with practical performance."
    },
    {
        "date": "2014-03-26",
        "title": "Security Improvement of an Image Encryption Based on mPixel-Chaotic-Shuffle and Pixel-Chaotic-Diffusion",
        "author": "Musheer Ahmad, Hamed D. Alsharari, and Munazza Nizam",
        "link": "http://arxiv.org/abs/1403.6626v1",
        "abstract": "In this paper, we propose to improve the security performance of a recently\nproposed color image encryption algorithm which is based on multi-chaotic\nsystems. The existing cryptosystem employed a pixel-chaotic-shuffle mechanism\nto encrypt images, in which the generation of shuffling sequences are\nindependent to the plain-image/cipher-image. As a result, it fails to the\nchosen-plaintext and known-plaintext attacks. Moreover, the statistical\nfeatures of the cryptosystem are not up to the standard. Therefore, the\nsecurity improvements are framed to make the above attacks infeasible and\nenhance the statistical features as well. It is achieved by modifying the\npixel-chaotic-shuffle mechanism and adding a new pixel-chaotic-diffusion\nmechanism to it. The keys for diffusion of pixels are extracted from the same\nchaotic sequences generated in the previous stage. The simulation analyses and\nstudies are performed to demonstrate that the updated version of cryptosystem\nhas better statistical features and resistant to the chosen-plaintext and\nknown-plaintext attacks than the existing algorithm."
    },
    {
        "date": "2014-03-25",
        "title": "Embedding Cryptographic Features in Compressive Sensing",
        "author": "Yushu Zhang, Kwok-Wo Wong, Di Xiao, Leo Yu Zhang, and Ming Li",
        "link": "http://arxiv.org/abs/1403.6213v1",
        "abstract": "Compressive sensing (CS) has been widely studied and applied in many fields.\nRecently, the way to perform secure compressive sensing (SCS) has become a\ntopic of growing interest. The existing works on SCS usually take the sensing\nmatrix as a key and the resultant security level is not evaluated in depth.\nThey can only be considered as a preliminary exploration on SCS, but a concrete\nand operable encipher model is not given yet. In this paper, we are going to\ninvestigate SCS in a systematic way. The relationship between CS and\nsymmetric-key cipher indicates some possible encryption models. To this end, we\npropose the two-level protection models (TLPM) for SCS which are developed from\nmeasurements taking and something else, respectively. It is believed that these\nmodels will provide a new point of view and stimulate further research in both\nCS and cryptography. Specifically, an efficient and secure encryption scheme\nfor parallel compressive sensing (PCS) is designed by embedding a two-layer\nprotection in PCS using chaos. The first layer is undertaken by random\npermutation on a two-dimensional signal, which is proved to be an acceptable\npermutation with overwhelming probability. The other layer is to sample the\npermuted signal column by column with the same chaotic measurement matrix,\nwhich satisfies the restricted isometry property of PCS with overwhelming\nprobability. Both the random permutation and the measurement matrix are\nconstructed under the control of a chaotic system. Simulation results show that\nunlike the general joint compression and encryption schemes in which encryption\nalways leads to the same or a lower compression ratio, the proposed approach of\nembedding encryption in PCS actually improves the compression performance.\nBesides, the proposed approach possesses high transmission robustness against\nadditive Gaussian white noise and cropping attack."
    },
    {
        "date": "2014-03-24",
        "title": "A Framework for Hybrid Systems with Denial-of-Service Security Attack",
        "author": "Shuling Wang, Flemming Nielson, and Hanne Riis Nielson",
        "link": "http://arxiv.org/abs/1403.6367v2",
        "abstract": "Hybrid systems are integrations of discrete computation and continuous\nphysical evolution. The physical components of such systems introduce safety\nrequirements, the achievement of which asks for the correct monitoring and\ncontrol from the discrete controllers. However, due to denial-of-service\nsecurity attack, the expected information from the controllers is not received\nand as a consequence the physical systems may fail to behave as expected. This\npaper proposes a formal framework for expressing denial-of-service security\nattack in hybrid systems. As a virtue, a physical system is able to plan for\nreasonable behavior in case the ideal control fails due to unreliable\ncommunication, in such a way that the safety of the system upon\ndenial-of-service is still guaranteed. In the context of the modeling language,\nwe develop an inference system for verifying safety of hybrid systems, without\nputting any assumptions on how the environments behave. Based on the inference\nsystem, we implement an interactive theorem prover and have applied it to check\nan example taken from train control system."
    },
    {
        "date": "2014-03-22",
        "title": "A Survey on Cloud Security Issues and Techniques",
        "author": "Shubhanjali Sharma, Garima Gupta, and P. R. Laxmi",
        "link": "http://arxiv.org/abs/1403.5627v1",
        "abstract": "Today, cloud computing is an emerging way of computing in computer science.\nCloud computing is a set of resources and services that are offered by the\nnetwork or internet. Cloud computing extends various computing techniques like\ngrid computing, distributed computing. Today cloud computing is used in both\nindustrial field and academic field. Cloud facilitates its users by providing\nvirtual resources via internet. As the field of cloud computing is spreading\nthe new techniques are developing. This increase in cloud computing environment\nalso increases security challenges for cloud developers. Users of cloud save\ntheir data in the cloud hence the lack of security in cloud can lose the users\ntrust. In this paper we will discuss some of the cloud security issues in\nvarious aspects like multi-tenancy, elasticity, availability etc. The paper\nalso discuss existing security techniques and approaches for a secure cloud.\nThis paper will enable researchers and professionals to know about different\nsecurity threats and models and tools proposed."
    },
    {
        "date": "2014-03-22",
        "title": "Adversarial Wiretap Channel with Public Discussion",
        "author": "Pengwei Wang, and Reihaneh Safavi-Naini",
        "link": "http://arxiv.org/abs/1403.5598v4",
        "abstract": "Wyner's elegant model of wiretap channel exploits noise in the communication\nchannel to provide perfect secrecy against a computationally unlimited\neavesdropper without requiring a shared key. We consider an adversarial model\nof wiretap channel proposed in [18,19] where the adversary is active: it\nselects a fraction $\\rho_r$ of the transmitted codeword to eavesdrop and a\nfraction $\\rho_w$ of the codeword to corrupt by \"adding\" adversarial error. It\nwas shown that this model also captures network adversaries in the setting of\n1-round Secure Message Transmission [8]. It was proved that secure\ncommunication (1-round) is possible if and only if $\\rho_r + \\rho_w <1$.\n  In this paper we show that by allowing communicants to have access to a\npublic discussion channel (authentic communication without secrecy) secure\ncommunication becomes possible even if $\\rho_r + \\rho_w >1$. We formalize the\nmodel of \\awtppd protocol and for two efficiency measures, {\\em information\nrate } and {\\em message round complexity} derive tight bounds. We also\nconstruct a rate optimal protocol family with minimum number of message rounds.\nWe show application of these results to Secure Message Transmission with Public\nDiscussion (SMT-PD), and in particular show a new lower bound on transmission\nrate of these protocols together with a new construction of an optimal SMT-PD\nprotocol."
    },
    {
        "date": "2014-03-19",
        "title": "k-Nearest Neighbor Classification over Semantically Secure Encrypted Relational Data",
        "author": "Bharath K. Samanthula, Yousef Elmehdwi, and Wei Jiang",
        "link": "http://arxiv.org/abs/1403.5001v3",
        "abstract": "Data Mining has wide applications in many areas such as banking, medicine,\nscientific research and among government agencies. Classification is one of the\ncommonly used tasks in data mining applications. For the past decade, due to\nthe rise of various privacy issues, many theoretical and practical solutions to\nthe classification problem have been proposed under different security models.\nHowever, with the recent popularity of cloud computing, users now have the\nopportunity to outsource their data, in encrypted form, as well as the data\nmining tasks to the cloud. Since the data on the cloud is in encrypted form,\nexisting privacy preserving classification techniques are not applicable. In\nthis paper, we focus on solving the classification problem over encrypted data.\nIn particular, we propose a secure k-NN classifier over encrypted data in the\ncloud. The proposed k-NN protocol protects the confidentiality of the data,\nuser's input query, and data access patterns. To the best of our knowledge, our\nwork is the first to develop a secure k-NN classifier over encrypted data under\nthe semi-honest model. Also, we empirically analyze the efficiency of our\nsolution through various experiments."
    },
    {
        "date": "2014-03-19",
        "title": "Chaos Based Mixed Keystream Generation for Voice Data Encryption",
        "author": "Musheer Ahmad, Bashir Alam, and Omar Farooq",
        "link": "http://arxiv.org/abs/1403.4782v1",
        "abstract": "In this paper, a high dimensional chaotic systems based mixed keystream\ngenerator is proposed to secure the voice data. As the voice-based\ncommunication becomes extensively vital in the application areas of military,\nvoice over IP, voice-conferencing, phone banking, news telecasting etc. It\ngreatly demands to preserve sensitive voice signals from the unauthorized\nlistening and illegal usage over shared/open networks. To address the need, the\ndesigned keystream generator employed to work as a symmetric encryption\ntechnique to protect voice bitstreams over insecure transmission channel. The\ngenerator utilizes the features of high dimensional chaos like Lorenz and Chen\nsystems to generate highly unpredictable and random-like sequences. The\nencryption keystream is dynamically extracted from the pre-treated chaotic\nmixed sequences, which are then applied to mask the voice bitstream for\nintegrity protection of voice data. The experimental analyses like\nauto-correlation, signal distribution, parameter residual deviation, key space\nand key-sensitivity demonstrate the effectiveness of the proposed technique for\nsecure voice communication."
    },
    {
        "date": "2014-03-19",
        "title": "An Inter-Component Pixels Permutation Based Color Image Encryption Using Hyper-chaos",
        "author": "Musheer Ahmad, and Hamed D Al-Sharari",
        "link": "http://arxiv.org/abs/1403.4780v1",
        "abstract": "In this paper, a simple and robust color image encryption algorithm based on\nhigh-dimensional chaotic maps is proposed. The algorithm employs a 3D Arnold\ntransform to perform inter-component shuffling of plain-image, while a 2D\nhyper-chaotic map is used to confuse the relationship between the encrypted\nimage and plain-image. The control parameters of Arnold transform are extracted\nfrom pending plain-image, thereby establishing a dependency to the plain-image.\nThe confusion process is carried out in cipher-block chaining mode to make it\ndependent to the encrypted image. This makes the algorithm able to resist the\ncryptographic attacks. The performance of the proposed algorithm is analyzed\nthrough computer simulations. The experimental analyses show that the proposed\nalgorithm has desirable properties of high security, robustness to\ncryptographic attacks and practicability to protect multimedia color images."
    },
    {
        "date": "2014-03-17",
        "title": "WaterRPG: A Graph-based Dynamic Watermarking Model for Software Protection",
        "author": "Ioannis Chionis, Maria Chroni, and Stavros D. Nikolopoulos",
        "link": "http://arxiv.org/abs/1403.6658v1",
        "abstract": "Software watermarking involves embedding a unique identifier or,\nequivalently, a watermark value within a software to prove owner's authenticity\nand thus to prevent or discourage copyright infringement. Towards the embedding\nprocess, several graph theoretic watermarking algorithmic techniques encode the\nwatermark values as graph structures and embed them in application programs.\nRecently, we presented an efficient codec system for encoding a watermark\nnumber $w$ as a reducible permutation graph $F[\\pi^*]$ through the use of\nself-inverting permutations $\\pi^*$. In this paper, we propose a dynamic\nwatermarking model, which we call WaterRPG, for embedding the watermark graph\n$F[\\pi^*]$ into an application program $P$. The main idea behind the proposed\nwatermarking model is a systematic use of appropriate calls of specific\nfunctions of the program $P$. More precisely, for a specific input $I_{key}$ of\nthe program $P$, our model takes the dynamic call-graph $G(P, I_{key})$ of $P$\nand the watermark graph $F[\\pi^*]$, and produces the watermarked program $P^*$\nhaving the following key property: its dynamic call-graph $G(P^*, I_{key})$ is\nisomorphic to the watermark graph $F[\\pi^*]$. Within this idea the program\n$P^*$ is produced by only altering appropriate calls of specific functions of\nthe input application program $P$. We have implemented our watermarking model\nWaterRPG in real application programs and evaluated its functionality under\nvarious and broadly used watermarking assessment criteria. The evaluation\nresults show that our model efficiently watermarks Java application programs\nwith respect to several watermarking metrics like data-rate, bytecode\ninstructions overhead, resiliency, time and space efficiency. Moreover, the\nembedded watermarks withstand several software obfuscation and optimization\nattacks."
    },
    {
        "date": "2014-03-14",
        "title": "Applying mathematical models in cloud computing: A survey",
        "author": "Alexander Ngenzi",
        "link": "http://arxiv.org/abs/1403.3649v1",
        "abstract": "As more and more information on individuals and companies are placed in the\ncloud, concerns are beginning to grow about just how safe an environment it is.\nIt is better to prevent security threats before they enter into the systems and\nthere is no way how this can be prevented without knowing where they come from.\nThe issue of resource allocation and revenue maximization is also equally\nimportant especially when it comes to cloud security. This brings about the\nnecessity of different modelling techniques including but not limited; security\nthreat, resource allocation and revenue maximization models. This survey paper\nwill try to analyse security threats and risk mitigation in cloud computing. It\ngives introduction of how viral attack can invade the virtual machines on the\ncloud, discusses the top security threats and countermeasures by providing the\nviral threat modelling in virtual machines and risk mitigation. Resource\nallocation models and revenue maximization techniques are also discussed."
    },
    {
        "date": "2014-03-14",
        "title": "Proving Security Goals With Shape Analysis Sentences",
        "author": "John D. Ramsdell",
        "link": "http://arxiv.org/abs/1403.3563v1",
        "abstract": "The paper that introduced shape analysis sentences presented a method for\nextracting a sentence in first-order logic that completely characterizes a run\nof CPSA. Logical deduction can then be used to determine if a security goal is\nsatisfied.\n  This paper presents a method for importing shape analysis sentences into a\nproof assistant on top of a detailed theory of strand spaces. The result is a\nsemantically rich environment in which the validity of a security goal can be\ndetermined using shape analysis sentences and the foundation on which they are\nbased."
    },
    {
        "date": "2014-03-13",
        "title": "Fingerprinting Smart Devices Through Embedded Acoustic Components",
        "author": "Anupam Das, Nikita Borisov, and Matthew Caesar",
        "link": "http://arxiv.org/abs/1403.3366v1",
        "abstract": "The widespread use of smart devices gives rise to both security and privacy\nconcerns. Fingerprinting smart devices can assist in authenticating physical\ndevices, but it can also jeopardize privacy by allowing remote identification\nwithout user awareness. We propose a novel fingerprinting approach that uses\nthe microphones and speakers of smart phones to uniquely identify an individual\ndevice. During fabrication, subtle imperfections arise in device microphones\nand speakers which induce anomalies in produced and received sounds. We exploit\nthis observation to fingerprint smart devices through playback and recording of\naudio samples. We use audio-metric tools to analyze and explore different\nacoustic features and analyze their ability to successfully fingerprint smart\ndevices. Our experiments show that it is even possible to fingerprint devices\nthat have the same vendor and model; we were able to accurately distinguish\nover 93% of all recorded audio clips from 15 different units of the same model.\nOur study identifies the prominent acoustic features capable of fingerprinting\ndevices with high success rate and examines the effect of background noise and\nother variables on fingerprinting accuracy."
    },
    {
        "date": "2014-03-13",
        "title": "Mitigating Denial Of Services Using Secure Overlay Service Model",
        "author": "Madhulika Mool, Prajyoti Sabale, Sneha Parpelli, Shalaka Chowriwar, and Nilesh Sambhe",
        "link": "http://arxiv.org/abs/1403.3328v1",
        "abstract": "Denial of service (DoS) and Distributed Denial of Service (DDoS) attacks\ncontinue to threaten the reliability of networking systems. Previous approaches\nfor protecting networks from DoS attacks are reactive in that they wait for an\nattack to be launched before taking appropriate measures to protect the\nnetwork. This leaves the door open for other attacks that use more\nsophisticated methods to mask their traffic. A secure overlay services (SOS)\narchitecture has been proposed to provide reliable communication between\nclients and a target under DoS attacks. The SOS architecture employs a set of\noverlay nodes arranged in three hierarchical layers that controls access to the\ntarget. We propose an architecture called secure overlay services (SOS) that\nproactively prevents denial of service (DoS) attacks, which works toward\nsupporting emergency services, or similar types of communication. The\narchitecture uses a combination of secure overlay tunneling, routing via\nconsistent hashing, and filtering. We reduce the probability of successful\nattacks by: 1) performing intensive filtering near protected network edges,\npushing the attack point into the core of the network, where high-speed routers\ncan handle the volume of attack traffic and 2) introducing randomness and\nanonymity into the forwarding architecture, making it difficult for an attacker\nto target nodes along the path to a specific SOSprotected destination. Using\nsimple analytical models, we evaluate the likelihood that an attacker can\nsuccessfully launch a DoS attack against an SOS protected network. Our analysis\ndemonstrates that such an architecture reduces the likelihood of a successful\nattack to minuscule levels."
    },
    {
        "date": "2014-03-12",
        "title": "Two-sources Randomness Extractors for Elliptic Curves",
        "author": "Abdoul Aziz Ciss",
        "link": "http://arxiv.org/abs/1404.2226v2",
        "abstract": "This paper studies the task of two-sources randomness extractors for elliptic\ncurves defined over finite fields $K$, where $K$ can be a prime or a binary\nfield. In fact, we introduce new constructions of functions over elliptic\ncurves which take in input two random points from two differents subgroups. In\nother words, for a ginven elliptic curve $E$ defined over a finite field\n$\\mathbb{F}_q$ and two random points $P \\in \\mathcal{P}$ and $Q\\in\n\\mathcal{Q}$, where $\\mathcal{P}$ and $\\mathcal{Q}$ are two subgroups of\n$E(\\mathbb{F}_q)$, our function extracts the least significant bits of the\nabscissa of the point $P\\oplus Q$ when $q$ is a large prime, and the $k$-first\n$\\mathbb{F}_p$ coefficients of the asbcissa of the point $P\\oplus Q$ when $q =\np^n$, where $p$ is a prime greater than $5$. We show that the extracted bits\nare close to uniform.\n  Our construction extends some interesting randomness extractors for elliptic\ncurves, namely those defined in \\cite{op} and \\cite{ciss1,ciss2}, when\n$\\mathcal{P} = \\mathcal{Q}$. The proposed constructions can be used in any\ncryptographic schemes which require extraction of random bits from two sources\nover elliptic curves, namely in key exchange protole, design of strong\npseudo-random number generators, etc."
    },
    {
        "date": "2014-03-07",
        "title": "An Expressive Model for the Web Infrastructure: Definition and Application to the BrowserID SSO System",
        "author": "Daniel Fett, Ralf Kuesters, and Guido Schmitz",
        "link": "http://arxiv.org/abs/1403.1866v2",
        "abstract": "The web constitutes a complex infrastructure and as demonstrated by numerous\nattacks, rigorous analysis of standards and web applications is indispensable.\n  Inspired by successful prior work, in particular the work by Akhawe et al. as\nwell as Bansal et al., in this work we propose a formal model for the web\ninfrastructure. While unlike prior works, which aim at automatic analysis, our\nmodel so far is not directly amenable to automation, it is much more\ncomprehensive and accurate with respect to the standards and specifications. As\nsuch, it can serve as a solid basis for the analysis of a broad range of\nstandards and applications.\n  As a case study and another important contribution of our work, we use our\nmodel to carry out the first rigorous analysis of the BrowserID system (a.k.a.\nMozilla Persona), a recently developed complex real-world single sign-on system\nthat employs technologies such as AJAX, cross-document messaging, and HTML5 web\nstorage. Our analysis revealed a number of very critical flaws that could not\nhave been captured in prior models. We propose fixes for the flaws, formally\nstate relevant security properties, and prove that the fixed system in a\nsetting with a so-called secondary identity provider satisfies these security\nproperties in our model. The fixes for the most critical flaws have already\nbeen adopted by Mozilla and our findings have been rewarded by the Mozilla\nSecurity Bug Bounty Program."
    },
    {
        "date": "2014-03-07",
        "title": "Optimal Patching in Clustered Malware Epidemics",
        "author": "Soheil Eshghi, MHR. Khouzani, Saswati Sarkar, and Santosh S. Venkatesh",
        "link": "http://arxiv.org/abs/1403.1639v1",
        "abstract": "Studies on the propagation of malware in mobile networks have revealed that\nthe spread of malware can be highly inhomogeneous. Platform diversity, contact\nlist utilization by the malware, clustering in the network structure, etc. can\nalso lead to differing spreading rates. In this paper, a general formal\nframework is proposed for leveraging such heterogeneity to derive optimal\npatching policies that attain the minimum aggregate cost due to the spread of\nmalware and the surcharge of patching. Using Pontryagin's Maximum Principle for\na stratified epidemic model, it is analytically proven that in the mean-field\ndeterministic regime, optimal patch disseminations are simple single-threshold\npolicies. Through numerical simulations, the behavior of optimal patching\npolicies is investigated in sample topologies and their advantages are\ndemonstrated."
    },
    {
        "date": "2014-03-03",
        "title": "An Explicit Trust Model Towards Better System Security",
        "author": "Orhio Mark Creado, Bala Srinivasan, Phu Dung Le, and Jefferson Tan",
        "link": "http://arxiv.org/abs/1403.0282v1",
        "abstract": "Trust is an absolute necessity for digital communications; but is often\nviewed as an implicit singular entity. The use of the internet as the primary\nvehicle for information exchange has made accountability and verifiability of\nsystem code almost obsolete. This paper proposes a novel approach towards\nenforcing system security by requiring the explicit definition of trust for all\noperating code. By identifying the various classes and levels of trust required\nwithin a computing system; trust is defined as a combination of individual\ncharacteristics. Trust is then represented as a calculable metric obtained\nthrough the collective enforcement of each of these characteristics to varying\ndegrees. System Security is achieved by facilitating trust to be a constantly\nevolving aspect for each operating code segment capable of getting stronger or\nweaker over time."
    },
    {
        "date": "2014-02-26",
        "title": "Authentication Mechanism for Resistance to Password Stealing and Reuse Attack",
        "author": "Sharayu A. Aghav, and RajneeshKaur Bedi",
        "link": "http://arxiv.org/abs/1402.6497v1",
        "abstract": "Considering computer systems, security is the major concern with usability.\nSecurity policies need to be developed to protect information from unauthorized\naccess. Passwords and secrete codes used between users and information systems\nfor secure user authentication with the system. Playing a vital role in\nsecurity, easily guessed passwords are links to vulnerability. They allow\ninvader to put system resources significantly closer to access them, other\naccounts on nearby machines and possibly even administrative privileges with\ndifferent threats and vulnerabilities (e.g., phishing, key logging and\nmalwares). The purpose of this system is to introduce the concept and\nmethodology which helps organization and users to implement stronger password\npolicies. This paper studies a password stealing and reuse issues of password\nbased authentication systems. Techniques and concepts of authentication are\ndiscussed which gives rise to a novel approach of two-factor authentication.\nAvoiding password reuse is a crucial issue in information systems which can at\nsome extent contribute to password stealing issue also. In the proposed system,\neach participating website possesses a user's unique phone number,\ntelecommunication services in registration and recovery phases and a long-term\npassword used to generate one-time password for each login session on all\nwebsites."
    },
    {
        "date": "2014-02-26",
        "title": "Formal verification of a software countermeasure against instruction skip attacks",
        "author": "Nicolas Moro, Karine Heydemann, Emmanuelle Encrenaz, and Bruno Robisson",
        "link": "http://arxiv.org/abs/1402.6461v1",
        "abstract": "Fault attacks against embedded circuits enabled to define many new attack\npaths against secure circuits. Every attack path relies on a specific fault\nmodel which defines the type of faults that the attacker can perform. On\nembedded processors, a fault model consisting in an assembly instruction skip\ncan be very useful for an attacker and has been obtained by using several fault\ninjection means. To avoid this threat, some countermeasure schemes which rely\non temporal redundancy have been proposed. Nevertheless, double fault injection\nin a long enough time interval is practical and can bypass those countermeasure\nschemes. Some fine-grained countermeasure schemes have also been proposed for\nspecific instructions. However, to the best of our knowledge, no approach that\nenables to secure a generic assembly program in order to make it fault-tolerant\nto instruction skip attacks has been formally proven yet. In this paper, we\nprovide a fault-tolerant replacement sequence for almost all the instructions\nof the Thumb-2 instruction set and provide a formal verification for this fault\ntolerance. This simple transformation enables to add a reasonably good security\nlevel to an embedded program and makes practical fault injection attacks much\nharder to achieve."
    },
    {
        "date": "2014-02-26",
        "title": "Electromagnetic fault injection: towards a fault model on a 32-bit microcontroller",
        "author": "Nicolas Moro, Amine Dehbaoui, Karine Heydemann, Bruno Robisson, and Emmanuelle Encrenaz",
        "link": "http://arxiv.org/abs/1402.6421v1",
        "abstract": "Injection of transient faults as a way to attack cryptographic\nimplementations has been largely studied in the last decade. Several attacks\nthat use electromagnetic fault injection against hardware or software\narchitectures have already been presented. On microcontrollers, electromagnetic\nfault injection has mostly been seen as a way to skip assembly instructions or\nsubroutine calls. However, to the best of our knowledge, no precise study about\nthe impact of an electromagnetic glitch fault injection on a microcontroller\nhas been proposed yet. The aim of this paper is twofold: providing a more\nin-depth study of the effects of electromagnetic glitch fault injection on a\nstate-of-the-art microcontroller and building an associated register-transfer\nlevel fault model."
    },
    {
        "date": "2014-02-21",
        "title": "VHDL Modeling of Intrusion Detection & Prevention System (IDPS) A Neural Network Approach",
        "author": "Tanusree Chatterjee, and Abhishek Bhattacharya",
        "link": "http://arxiv.org/abs/1402.5275v1",
        "abstract": "The rapid development and expansion of World Wide Web and network systems\nhave changed the computing world in the last decade and also equipped the\nintruders and hackers with new facilities for their destructive purposes. The\ncost of temporary or permanent damages caused by unauthorized access of the\nintruders to computer systems has urged different organizations to increasingly\nimplement various systems to monitor data flow in their network. The systems\nare generally known as Intrusion Detection System (IDS).Our objective is to\nimplement an artificial network approach to the design of intrusion detection\nand prevention system and finally convert the designed model to a VHDL (Very\nHigh Speed Integrated Circuit Hardware Descriptive Language) code. This feature\nenables the system to suggest proper actions against possible attacks. The\npromising results of the present study show the potential applicability of ANNs\nfor developing practical IDSs."
    },
    {
        "date": "2014-02-14",
        "title": "Privacy Games: Optimal User-Centric Data Obfuscation",
        "author": "Reza Shokri",
        "link": "http://arxiv.org/abs/1402.3426v3",
        "abstract": "In this paper, we design user-centric obfuscation mechanisms that impose the\nminimum utility loss for guaranteeing user's privacy. We optimize utility\nsubject to a joint guarantee of differential privacy (indistinguishability) and\ndistortion privacy (inference error). This double shield of protection limits\nthe information leakage through obfuscation mechanism as well as the posterior\ninference. We show that the privacy achieved through joint\ndifferential-distortion mechanisms against optimal attacks is as large as the\nmaximum privacy that can be achieved by either of these mechanisms separately.\nTheir utility cost is also not larger than what either of the differential or\ndistortion mechanisms imposes. We model the optimization problem as a\nleader-follower game between the designer of obfuscation mechanism and the\npotential adversary, and design adaptive mechanisms that anticipate and protect\nagainst optimal inference algorithms. Thus, the obfuscation mechanism is\noptimal against any inference algorithm."
    },
    {
        "date": "2014-02-13",
        "title": "A graph theoretic linkage attack on microdata in a metric space",
        "author": "Martin Kroll",
        "link": "http://arxiv.org/abs/1402.3198v1",
        "abstract": "Certain methods of analysis require the knowledge of the spatial distances\nbetween entities whose data are stored in a microdata table. For instance, such\nknowledge is necessary and sufficient to perform data mining tasks such as\nnearest neighbour searches or clustering. However, when inter-record distances\nare published in addition to the microdata for research purposes, the risk of\nidentity disclosure has to be taken into consideration again. In order to\ntackle this problem, we introduce a flexible graph model for microdata in a\nmetric space and propose a linkage attack based on realistic assumptions of a\ndata snooper's background knowledge. This attack is based on the idea of\nfinding a maximum approximate common subgraph of two vertex-labelled and\nedge-weighted graphs. By adapting a standard argument from algorithmic graph\ntheory to our setup, this task is transformed to the maximum clique detection\nproblem in a corresponding product graph. Using a toy example and experimental\nresults on simulated data show that publishing even approximate distances could\nincrease the risk of identity disclosure unreasonably."
    },
    {
        "date": "2014-02-12",
        "title": "On the Security of Trustee-based Social Authentications",
        "author": "Neil Zhenqiang Gong, and Di Wang",
        "link": "http://arxiv.org/abs/1402.2699v4",
        "abstract": "Recently, authenticating users with the help of their friends (i.e.,\ntrustee-based social authentication) has been shown to be a promising backup\nauthentication mechanism. A user in this system is associated with a few\ntrustees that were selected from the user's friends. When the user wants to\nregain access to the account, the service provider sends different verification\ncodes to the user's trustees. The user must obtain at least k (i.e., recovery\nthreshold) verification codes from the trustees before being directed to reset\nhis or her password.\n  In this paper, we provide the first systematic study about the security of\ntrustee-based social authentications. Specifically, we first introduce a novel\nframework of attacks, which we call forest fire attacks. In these attacks, an\nattacker initially obtains a small number of compromised users, and then the\nattacker iteratively attacks the rest of users by exploiting trustee-based\nsocial authentications. Then, we construct a probabilistic model to formalize\nthe threats of forest fire attacks and their costs for attackers. Moreover, we\nintroduce various defense strategies. Finally, we apply our framework to\nextensively evaluate various concrete attack and defense strategies using three\nreal-world social network datasets. Our results have strong implications for\nthe design of more secure trustee-based social authentications."
    },
    {
        "date": "2014-02-06",
        "title": "An Improved AIS Based E-mail Classification Technique for Spam Detection",
        "author": "Ismaila Idris, and Shafii Muhammad Abdulhamid",
        "link": "http://arxiv.org/abs/1402.1242v1",
        "abstract": "An improved email classification method based on Artificial Immune System is\nproposed in this paper to develop an immune based system by using the immune\nlearning, immune memory in solving complex problems in spam detection. An\noptimized technique for e-mail classification is accomplished by distinguishing\nthe characteristics of spam and non-spam that is been acquired from trained\ndata set. These extracted features of spam and non-spam are then combined to\nmake a single detector, therefore reducing the false rate. (Non-spam that were\nwrongly classified as spam). Effectiveness of our technique in decreasing the\nfalse rate shall be demonstrated by the result that will be acquired."
    },
    {
        "date": "2014-02-05",
        "title": "Security in Cognitive Radio Networks",
        "author": "Sami Akin",
        "link": "http://arxiv.org/abs/1402.1137v1",
        "abstract": "In this paper, we investigate the information-theoretic security by modeling\na cognitive radio wiretap channel under quality-of-service (QoS) constraints\nand interference power limitations inflicted on primary users (PUs). We\ninitially define four different transmission scenarios regarding channel\nsensing results and their correctness. We provide effective secure transmission\nrates at which a secondary eavesdropper is refrained from listening to a\nsecondary transmitter (ST). Then, we construct a channel state transition\ndiagram that characterizes this channel model. We obtain the effective secure\ncapacity which describes the maximum constant buffer arrival rate under given\nQoS constraints. We find out the optimal transmission power policies that\nmaximize the effective secure capacity, and then, we propose an algorithm that,\nin general, converges quickly to these optimal policy values. Finally, we show\nthe performance levels and gains obtained under different channel conditions\nand scenarios. And, we emphasize, in particular, the significant effect of\nhidden-terminal problem on information-theoretic security in cognitive radios."
    },
    {
        "date": "2014-02-04",
        "title": "Network Traffic Anomaly Detection",
        "author": "Hong Huang, Hussein Al-Azzawi, and Hajar Brani",
        "link": "http://arxiv.org/abs/1402.0856v1",
        "abstract": "This paper presents a tutorial for network anomaly detection, focusing on\nnon-signature-based approaches. Network traffic anomalies are unusual and\nsignificant changes in the traffic of a network. Networks play an important\nrole in today's social and economic infrastructures. The security of the\nnetwork becomes crucial, and network traffic anomaly detection constitutes an\nimportant part of network security. In this paper, we present three major\napproaches to non-signature-based network detection: PCA-based, sketch-based,\nand signal-analysis-based. In addition, we introduce a framework that subsumes\nthe three approaches and a scheme for network anomaly extraction. We believe\nnetwork anomaly detection will become more important in the future because of\nthe increasing importance of network security."
    },
    {
        "date": "2014-02-04",
        "title": "The Complexity of Synchronous Notions of Information Flow Security",
        "author": "Franck Cassez, Ron van der Meyden, and Chenyi Zhang",
        "link": "http://arxiv.org/abs/1402.0601v1",
        "abstract": "The paper considers the complexity of verifying that a finite state system\nsatisfies a number of definitions of information flow security. The systems\nmodel considered is one in which agents operate synchronously with awareness of\nthe global clock. This enables timing based attacks to be captured, whereas\nprevious work on this topic has dealt primarily with asynchronous systems.\nVersions of the notions of nondeducibility on inputs, nondeducibility on\nstrategies, and an unwinding based notion are formulated for this model. All\nthree notions are shown to be decidable, and their computational complexity is\ncharacterised."
    },
    {
        "date": "2014-02-02",
        "title": "Secure Debit Card Device Model",
        "author": "Ms. Rumaisah Munir",
        "link": "http://arxiv.org/abs/1402.0247v1",
        "abstract": "The project envisages the implementation of an e-payment system utilizing\nFIPS-201 Smart Card. The system combines hardware and software modules. The\nhardware module takes data insertions (e.g. currency notes), processes the data\nand then creates connection with the smart card using serial/USB ports to\nperform further mathematical manipulations. The hardware interacts with servers\nat the back for authentication and identification of users and for data storage\npertaining to a particular user. The software module manages database, handles\nidentities, provide authentication and secure communication between the various\nsystem components. It will also provide a component to the end users. This\ncomponent can be in the form of software for computer or executable binaries\nfor PoS devices. The idea is to receive data in the embedded system from data\nreader and smart card. After manipulations, the updated data is imprinted on\nsmart card memory and also updated in the back end servers maintaining\ndatabase. The information to be sent to a server is sent through a PoS device\nwhich has multiple transfer mediums involving wired and un-wired mediums. The\nuser device also acts as an updater; therefore, whenever the smart card is\ninserted by user, it is automatically updated by synchronizing with back-end\ndatabase. The project required expertise in embedded systems, networks, java\nand C++ (Optional)."
    },
    {
        "date": "2014-02-02",
        "title": "Steganography - coding and intercepting the information from encoded pictures in the absence of any initial information",
        "author": "Monika Kwiatkowska, and Lukasz Swierczewski",
        "link": "http://arxiv.org/abs/1404.2237v1",
        "abstract": "The work includes implementation and extraction algorithms capabilities test,\nwithout any additional data (starting position, the number of bits used, gap\nbetween the amount of data encoded) information from encoded files (mostly\nimages). The software is written using OpenMP standard [1], which allowed them\nto run on parallel computers. Performance tests were carried out on computers,\nBlue Gene/P [2], Blue Gene/Q [3] and the system consisting of four AMD Opteron\n6272 [4]. Source code is available under GNU GPL v3 license and are available\nin a repository OLib [5]."
    },
    {
        "date": "2014-02-01",
        "title": "Single-shot security for one-time memories in the isolated qubits model",
        "author": "Yi-Kai Liu",
        "link": "http://arxiv.org/abs/1402.0049v2",
        "abstract": "One-time memories (OTM's) are simple, tamper-resistant cryptographic devices,\nwhich can be used to implement sophisticated functionalities such as one-time\nprograms. Can one construct OTM's whose security follows from some physical\nprinciple? This is not possible in a fully-classical world, or in a\nfully-quantum world, but there is evidence that OTM's can be built using\n\"isolated qubits\" -- qubits that cannot be entangled, but can be accessed using\nadaptive sequences of single-qubit measurements.\n  Here we present new constructions for OTM's using isolated qubits, which\nimprove on previous work in several respects: they achieve a stronger\n\"single-shot\" security guarantee, which is stated in terms of the (smoothed)\nmin-entropy; they are proven secure against adversaries who can perform\narbitrary local operations and classical communication (LOCC); and they are\nefficiently implementable.\n  These results use Wiesner's idea of conjugate coding, combined with\nerror-correcting codes that approach the capacity of the q-ary symmetric\nchannel, and a high-order entropic uncertainty relation, which was originally\ndeveloped for cryptography in the bounded quantum storage model."
    },
    {
        "date": "2014-01-31",
        "title": "Quantitative Analysis of Active Cyber Defenses Based on Temporal Platform Diversity",
        "author": "Kevin M. Carter, Hamed Okhravi, and James Riordan",
        "link": "http://arxiv.org/abs/1401.8255v1",
        "abstract": "Active cyber defenses based on temporal platform diversity have been proposed\nas way to make systems more resistant to attacks. These defenses change the\nproperties of the platforms in order to make attacks more complicated.\nUnfortunately, little work has been done on measuring the effectiveness of\nthese defenses. In this work, we use four different approaches to\nquantitatively analyze these defenses; an abstract analysis studies the\nalgebraic models of a temporal platform diversity system; a set of experiments\non a test bed measures the metrics of interest for the system; a game theoretic\nanalysis studies the impact of preferential selection of platforms and derives\nan optimal strategy; finally, a set of simulations evaluates the metrics of\ninterest on the models. Our results from these approaches all agree and yet are\ncounter-intuitive. We show that although platform diversity can mitigate some\nattacks, it can be detrimental for others. We also illustrate that the benefit\nfrom these systems heavily depends on their threat model and that the\npreferential selection of platforms can achieve better protection."
    },
    {
        "date": "2014-01-31",
        "title": "A Formal Proof of Countermeasures against Fault Injection Attacks on CRT-RSA",
        "author": "Pablo Rauzy, and Sylvain Guilley",
        "link": "http://arxiv.org/abs/1401.8170v1",
        "abstract": "In this article, we describe a methodology that aims at either breaking or\nproving the security of CRT-RSA implementations against fault injection\nattacks. In the specific case-study of the BellCoRe attack, our work bridges a\ngap between formal proofs and implementation-level attacks. We apply our\nresults to three implementations of CRT-RSA, namely the unprotected one, that\nof Shamir, and that of Aum\\\"uller et al. Our findings are that many attacks are\npossible on both the unprotected and the Shamir implementations, while the\nimplementation of Aum\\\"uller et al. is resistant to all single-fault attacks.\nIt is also resistant to double-fault attacks if we consider the less powerful\nthreat-model of its authors."
    },
    {
        "date": "2014-01-28",
        "title": "A Shannon Approach to Secure Multi-party Computations",
        "author": "Eun Jee Lee, and Emmanuel Abbe",
        "link": "http://arxiv.org/abs/1401.7360v3",
        "abstract": "In secure multi-party computations (SMC), parties wish to compute a function\non their private data without revealing more information about their data than\nwhat the function reveals. In this paper, we investigate two Shannon-type\nquestions on this problem. We first consider the traditional one-shot model for\nSMC which does not assume a probabilistic prior on the data. In this model,\nprivate communication and randomness are the key enablers to secure computing,\nand we investigate a notion of randomness cost and capacity. We then move to a\nprobabilistic model for the data, and propose a Shannon model for discrete\nmemoryless SMC. In this model, correlations among data are the key enablers for\nsecure computing, and we investigate a notion of dependency which permits the\nsecure computation of a function. While the models and questions are general,\nthis paper focuses on summation functions, and relies on polar code\nconstructions."
    },
    {
        "date": "2014-01-24",
        "title": "Android Anti-forensics: Modifying CyanogenMod",
        "author": "Karl-Johan Karlsson, and William Bradley Glisson",
        "link": "http://arxiv.org/abs/1401.6444v1",
        "abstract": "Mobile devices implementing Android operating systems inherently create\nopportunities to present environments that are conducive to anti-forensic\nactivities. Previous mobile forensics research focused on applications and data\nhiding anti-forensics solutions. In this work, a set of modifications were\ndeveloped and implemented on a CyanogenMod community distribution of the\nAndroid operating system. The execution of these solutions successfully\nprevented data extractions, blocked the installation of forensic tools, created\nextraction delays and presented false data to industry accepted forensic\nanalysis tools without impacting normal use of the device. The research\ncontribution is an initial empirical analysis of the viability of operating\nsystem modifications in an anti-forensics context along with providing the\nfoundation for future research."
    },
    {
        "date": "2014-01-24",
        "title": "Design of an Encryption-Decryption Module Oriented for Internet Information Security SOC Design",
        "author": "Yixin Liu, Haipeng Zhang, and Tao Feng",
        "link": "http://arxiv.org/abs/1401.6375v1",
        "abstract": "In order to protect the security of network data, a high speed chip module\nfor encrypting and decrypting of network data packet is designed. The chip\nmodule is oriented for internet information security SOC (System on Chip)\ndesign. During the design process, AES (Advanced Encryption Standard) and 3DES\n(Data Encryption Standard) encryption algorithm are adopted to protect the\nsecurity of network data. The following points are focused: (1) The SOC (System\non Chip) design methodology based on IP (Intellectual Property) core is used.\nAES (Advanced Encryption Standard) and 3DES (Data Encryption Standard) IP\n(Intellectual Property) cores are embedded in the chip module, peripheral\ncontrol sub-modules are designed to control the encryption-decryption module,\nwhich is capable of shortening the design period of the chip module. (2) The\nimplementation of encryption-decryption with hardware was presented, which\nimproves the safety of data through the encryption-decryption chip and reduce\nthe load of CPU. (3) In our hardware solution, two AES (Advanced Encryption\nStandard) cores are used to work in parallel, which improves the speed of the\nencryption module. Moreover, the key length of AES (Advanced Encryption\nStandard) encryption algorithm is designed with three optional configurations\nat 128 bits, 256 bits and 192 bits respectively and six optional encryption\nalgorithm modes: CBC (Cipher Block Chaining) mode, ECB (Electronic Code Book)\nmode, GCM (Galois/Counter Mode) mode, XTS(cipherteXT Stealing) mode, CTR\n(CounTeR) mode and 3DES respectively, which adds the flexibility to its\napplications."
    },
    {
        "date": "2014-01-23",
        "title": "Timed-Release Secret Sharing Scheme with Information Theoretic Security",
        "author": "Yohei Watanabe, and Junji Shikata",
        "link": "http://arxiv.org/abs/1401.5895v3",
        "abstract": "In modern cryptography, the secret sharing scheme is an important\ncryptographic primitive and it is used in various situations. In this paper, a\ntimed-release secret sharing scheme (TR-SS) with information-theoretic security\nis first studied. TR-SS is a secret sharing scheme with the property that\nparticipants more than a threshold number can reconstruct a secret by using\ntheir shares only when the time specified by a dealer has come. Specifically,\nin this paper we first introduce a model and formalization of security for\nTR-SS based on the traditional secret sharing scheme and information-theoretic\ntimed-release security. We also derive tight lower bounds on the sizes of\nshares, time-signals, and entities' secret-keys required for TR-SS. In\naddition, we propose a direct construction for TR-SS. Our direct construction\nis optimal in the sense that the construction meets equality in each of our\nbounds. As a result, it is shown that the timed-release security can be\nrealized without any additional redundancy on the share-size."
    },
    {
        "date": "2014-01-21",
        "title": "Quantum Secure Direct Communication using Entanglement and Super Dense Coding",
        "author": "Ola M. Hegazy, Ayman M. Bahaa-Eldin, and Yasser H. Dakroury",
        "link": "http://arxiv.org/abs/1402.6219v1",
        "abstract": "This paper introduces a new quantum protocol for secure direct communication.\nThis protocol is based on Entanglement and Super-Dense coding. In this paper we\npresent some basic definitions of entanglement in quantum mechanics, present\nhow to use the maximally entangled states known as Bell States, and super dense\ncoding technique to achieve secure direct message communication. Finally, we\nwill apply some error models that could affect the transmission of the quantum\ndata on the quantum channels, and how to treat these errors and acquire a safe\ntransmission of the data."
    },
    {
        "date": "2014-01-19",
        "title": "Verification of agent knowledge in dynamic access control policies",
        "author": "Masoud Koleini, Eike Ritter, and Mark Ryan",
        "link": "http://arxiv.org/abs/1401.4730v1",
        "abstract": "We develop a modeling technique based on interpreted systems in order to\nverify temporal-epistemic properties over access control policies. This\napproach enables us to detect information flow vulnerabilities in dynamic\npolicies by verifying the knowledge of the agents gained by both reading and\nreasoning about system information. To overcome the practical limitations of\nstate explosion in model-checking temporal-epistemic properties, we introduce a\nnovel abstraction and refinement technique for temporal-epistemic safety\nproperties in ACTLK (ACTL with knowledge modality K) and a class of interesting\nproperties that does fall in this category."
    },
    {
        "date": "2014-01-19",
        "title": "A Model for Privacy-enhanced Federated Identity Management",
        "author": "Rainer Hoerbe",
        "link": "http://arxiv.org/abs/1401.4726v1",
        "abstract": "Identity federations operating in a business or consumer context need to\nprevent the collection of user data across trust service providers for legal\nand business case reasons. Legal reasons are given by data protection\nlegislation. Other reasons include business owners becoming increasingly aware\nof confidentiality risks that go beyond traditional information security, e.g.,\nthe numbers of authentications to an EDI service might provide insights into\nthe volume of invoices, from which one could derive insider information. This\npaper proposes extended technical controls supporting three privacy\nrequirements: a) Limit d Linkability: Two service providers cannot link data\nrelated to a user without the help of a third party, using neither an\nidentifier nor other identifying attributes like email addresses or payment\ndata; b) Limited Observability: An identity provider cannot trace which\nservices a user is using without the help of a third party; c) Non-Disclosure:\nAttributes provided to the service provider by an attribute provider are not\ndisclosed to the identity provider or an intermediate service broker. Using a\nhub-and-spoke federation style following the privacy-by-design principle, this\nreference architecture addresses the privacy controls mentioned above."
    },
    {
        "date": "2014-01-17",
        "title": "Information Flow Control in WebKit's JavaScript Bytecode",
        "author": "Abhishek Bichhawat, Vineet Rajani, Deepak Garg, and Christian Hammer",
        "link": "http://arxiv.org/abs/1401.4339v2",
        "abstract": "Websites today routinely combine JavaScript from multiple sources, both\ntrusted and untrusted. Hence, JavaScript security is of paramount importance. A\nspecific interesting problem is information flow control (IFC) for JavaScript.\nIn this paper, we develop, formalize and implement a dynamic IFC mechanism for\nthe JavaScript engine of a production Web browser (specifically, Safari's\nWebKit engine). Our IFC mechanism works at the level of JavaScript bytecode and\nhence leverages years of industrial effort on optimizing both the source to\nbytecode compiler and the bytecode interpreter. We track both explicit and\nimplicit flows and observe only moderate overhead. Working with bytecode\nresults in new challenges including the extensive use of unstructured control\nflow in bytecode (which complicates lowering of program context taints),\nunstructured exceptions (which complicate the matter further) and the need to\nmake IFC analysis permissive. We explain how we address these challenges,\nformally model the JavaScript bytecode semantics and our instrumentation, prove\nthe standard property of termination-insensitive non-interference, and present\nexperimental results on an optimized prototype."
    },
    {
        "date": "2014-01-16",
        "title": "A Peered Bulletin Board for Robust Use in Verifiable Voting Systems",
        "author": "Chris Culnane, and Steve Schneider",
        "link": "http://arxiv.org/abs/1401.4151v1",
        "abstract": "The Web Bulletin Board (WBB) is a key component of verifiable election\nsystems. It is used in the context of election verification to publish evidence\nof voting and tallying that voters and officials can check, and where\nchallenges can be launched in the event of malfeasance. In practice, the\nelection authority has responsibility for implementing the web bulletin board\ncorrectly and reliably, and will wish to ensure that it behaves correctly even\nin the presence of failures and attacks. To ensure robustness, an\nimplementation will typically use a number of peers to be able to provide a\ncorrect service even when some peers go down or behave dishonestly. In this\npaper we propose a new protocol to implement such a Web Bulletin Board,\nmotivated by the needs of the vVote verifiable voting system. Using a\ndistributed algorithm increases the complexity of the protocol and requires\ncareful reasoning in order to establish correctness. Here we use the Event-B\nmodelling and refinement approach to establish correctness of the peered design\nagainst an idealised specification of the bulletin board behaviour. In\nparticular we show that for n peers, a threshold of t > 2n/3 peers behaving\ncorrectly is sufficient to ensure correct behaviour of the bulletin board\ndistributed design. The algorithm also behaves correctly even if honest or\ndishonest peers temporarily drop out of the protocol and then return. The\nverification approach also establishes that the protocols used within the\nbulletin board do not interfere with each other. This is the first time a\npeered web bulletin board suite of protocols has been formally verified."
    },
    {
        "date": "2014-01-16",
        "title": "Intrusion Detection using Continuous Time Bayesian Networks",
        "author": "Jing Xu, and Christian R. Shelton",
        "link": "http://arxiv.org/abs/1401.3851v1",
        "abstract": "Intrusion detection systems (IDSs) fall into two high-level categories:\nnetwork-based systems (NIDS) that monitor network behaviors, and host-based\nsystems (HIDS) that monitor system calls. In this work, we present a general\ntechnique for both systems. We use anomaly detection, which identifies patterns\nnot conforming to a historic norm. In both types of systems, the rates of\nchange vary dramatically over time (due to burstiness) and over components (due\nto service difference). To efficiently model such systems, we use continuous\ntime Bayesian networks (CTBNs) and avoid specifying a fixed update interval\ncommon to discrete-time models. We build generative models from the normal\ntraining data, and abnormal behaviors are flagged based on their likelihood\nunder this norm. For NIDS, we construct a hierarchical CTBN model for the\nnetwork packet traces and use Rao-Blackwellized particle filtering to learn the\nparameters. We illustrate the power of our method through experiments on\ndetecting real worms and identifying hosts on two publicly available network\ntraces, the MAWI dataset and the LBNL dataset. For HIDS, we develop a novel\nlearning method to deal with the finite resolution of system log file time\nstamps, without losing the benefits of our continuous time model. We\ndemonstrate the method by detecting intrusions in the DARPA 1998 BSM dataset."
    },
    {
        "date": "2014-01-15",
        "title": "Multipath Private Communication: An Information Theoretic Approach",
        "author": "Hadi Ahmadi, and Reihaneh Safavi-Naini",
        "link": "http://arxiv.org/abs/1401.3659v1",
        "abstract": "Sending private messages over communication environments under surveillance\nis an important challenge in communication security and has attracted\nattentions of cryptographers through time. We believe that resources other than\ncryptographic keys can be used for communication privacy. We consider private\nmessage transmission (PMT) in an abstract multipath communication model between\ntwo communicants, Alice and Bob, in the presence of an eavesdropper, Eve. Alice\nand Bob have pre-shared keys and Eve is computationally unbounded. There are a\ntotal of $n$ paths and the three parties can have simultaneous access to at\nmost $t_a$, $t_b$, and $t_e$ paths. The parties can switch their paths after\nevery $\\lambda$ bits of communication. We study perfect (P)-PMT versus\nasymptotically-perfect (AP)-PMT protocols. The former has zero tolerance of\ntransmission error and leakage, whereas the latter allows for positive error\nand leakage that tend to zero as the message length increases. We derive the\nnecessary and sufficient conditions under which P-PMT and AP-PMT are possible.\nWe also introduce explicit P-PMT and AP-PMT constructions. Our results show\nAP-PMT protocols attain much higher information rates than P-PMT ones.\nInterestingly, AP-PMT is possible even in poorest condition where $t_a=t_b=1$\nand $t_e=n-1$. It remains however an open question whether the derived rates\ncan be improved by more sophisticated AP-PMT protocols.\n  We study applications of our results to private communication over the\nreal-life scenarios of multiple-frequency links and multiple-route networks. We\nshow practical examples of such scenarios that can be abstracted by the\nmultipath setting: Our results prove the possibility of keyless\ninformation-theoretic private message transmission at rates $17\\%$ and $20\\%$\nfor the two example scenarios, respectively. We discuss open problems and\nfuture work at the end."
    },
    {
        "date": "2014-01-15",
        "title": "Intelligent Systems for Information Security",
        "author": "Ayman M. Bahaa-Eldin",
        "link": "http://arxiv.org/abs/1401.3592v1",
        "abstract": "This thesis aims to use intelligent systems to extend and improve performance\nand security of cryptographic techniques. Genetic algorithms framework for\ncryptanalysis problem is addressed. A novel extension to the differential\ncryptanalysis using genetic algorithm is proposed and a fitness measure based\non the differential characteristics of the cipher being attacked is also\nproposed. The complexity of the proposed attack is shown to be less than\nquarter of normal differential cryptanalysis of the same cipher by applying the\nproposed attack to both the basic Substitution Permutation Network and the\nFeistel Network. The basic models of modern block ciphers are attacked instead\nof actual cipher to prove that the attack is applicable to other ciphers\nvulnerable to differential cryptanalysis. A new attack for block cipher based\non the ability of neural networks to perform an approximation of mapping is\nproposed. A complete problem formulation is explained and implementation of the\nattack on some hypothetical Feistel cipher not vulnerable to differential or\nlinear attacks is presented. A new block cipher based on the neural networks is\nproposed. A complete cipher structure is given and a key scheduling is also\nshown. The main properties of neural network being able to perform mapping\nbetween large dimension domains in a very fast and a very small memory compared\nto S-Boxes is used as a base for the cipher."
    },
    {
        "date": "2014-01-13",
        "title": "A reduced semantics for deciding trace equivalence using constraint systems",
        "author": "David Baelde, Stéphanie Delaune, and Lucca Hirschi",
        "link": "http://arxiv.org/abs/1401.2854v2",
        "abstract": "Many privacy-type properties of security protocols can be modelled using\ntrace equivalence properties in suitable process algebras. It has been shown\nthat such properties can be decided for interesting classes of finite processes\n(i.e., without replication) by means of symbolic execution and constraint\nsolving. However, this does not suffice to obtain practical tools. Current\nprototypes suffer from a classical combinatorial explosion problem caused by\nthe exploration of many interleavings in the behaviour of processes.\nM\\\"odersheim et al. have tackled this problem for reachability properties using\npartial order reduction techniques. We revisit their work, generalize it and\nadapt it for equivalence checking. We obtain an optimization in the form of a\nreduced symbolic semantics that eliminates redundant interleavings on the fly."
    },
    {
        "date": "2014-01-12",
        "title": "Practical and fast quantum random number generation based on photon arrival time relative to external reference",
        "author": "You-Qi Nie, Hong-Fei Zhang, Zhen Zhang, Jian Wang, Xiongfeng Ma, Jun Zhang, and Jian-Wei Pan",
        "link": "http://arxiv.org/abs/1401.2594v1",
        "abstract": "We present a practical high-speed quantum random number generator, where the\ntiming of single-photon detection relative to an external time reference is\nmeasured as the raw data. The bias of the raw data can be substantially reduced\ncompared with the previous realizations. The raw random bit rate of our\ngenerator can reach 109 Mbps. We develop a model for the generator and evaluate\nthe min-entropy of the raw data. Toeplitz matrix hashing is applied for\nrandomness extraction, after which the final random bits are able to pass the\nstandard randomness tests."
    },
    {
        "date": "2014-01-06",
        "title": "Power Grid Defense Against Malicious Cascading Failure",
        "author": "Paulo Shakarian, Hansheng Lei, and Roy Lindelauf",
        "link": "http://arxiv.org/abs/1401.1086v1",
        "abstract": "An adversary looking to disrupt a power grid may look to target certain\nsubstations and sources of power generation to initiate a cascading failure\nthat maximizes the number of customers without electricity. This is\nparticularly an important concern when the enemy has the capability to launch\ncyber-attacks as practical concerns (i.e. avoiding disruption of service,\npresence of legacy systems, etc.) may hinder security. Hence, a defender can\nharden the security posture at certain power stations but may lack the time and\nresources to do this for the entire power grid. We model a power grid as a\ngraph and introduce the cascading failure game in which both the defender and\nattacker choose a subset of power stations such as to minimize (maximize) the\nnumber of consumers having access to producers of power. We formalize problems\nfor identifying both mixed and deterministic strategies for both players, prove\ncomplexity results under a variety of different scenarios, identify tractable\ncases, and develop algorithms for these problems. We also perform an\nexperimental evaluation of the model and game on a real-world power grid\nnetwork. Empirically, we noted that the game favors the attacker as he benefits\nmore from increased resources than the defender. Further, the minimax defense\nproduces roughly the same expected payoff as an easy-to-compute deterministic\nload based (DLB) defense when played against a minimax attack strategy.\nHowever, DLB performs more poorly than minimax defense when faced with the\nattacker's best response to DLB. This is likely due to the presence of low-load\nyet high-payoff nodes, which we also found in our empirical analysis."
    }
]